{
	"basePath": "/",
	"consumes.length": 1,
	"consumes[0]": "application/json",
	"definitions.AccessControl.pattern": "(^FullControl$)|(^Read$)|(^ReadAcp$)|(^WriteAcp$)",
	"definitions.AccessControl.type": "string",
	"definitions.AccessControls.items.$ref": "#/definitions/AccessControl",
	"definitions.AccessControls.maxItems": 30,
	"definitions.AccessControls.type": "array",
	"definitions.AccessDeniedException.description": "General authentication failure. The request was not signed correctly.",
	"definitions.AccessDeniedException.type": "object",
	"definitions.Artwork.description": "\u003cp\u003eThe file to be used as album art. There can be multiple artworks associated with an audio file, to a maximum of 20.\u003c/p\u003e \u003cp\u003eTo remove artwork or leave the artwork empty, you can either set \u003ccode\u003eArtwork\u003c/code\u003e to null, or set the \u003ccode\u003eMerge Policy\u003c/code\u003e to \"Replace\" and use an empty \u003ccode\u003eArtwork\u003c/code\u003e array.\u003c/p\u003e \u003cp\u003eTo pass through existing artwork unchanged, set the \u003ccode\u003eMerge Policy\u003c/code\u003e to \"Prepend\", \"Append\", or \"Fallback\", and use an empty \u003ccode\u003eArtwork\u003c/code\u003e array.\u003c/p\u003e",
	"definitions.Artwork.properties.AlbumArtFormat.$ref": "#/definitions/JpgOrPng",
	"definitions.Artwork.properties.AlbumArtFormat.description": "The format of album art, if any. Valid formats are \u003ccode\u003e.jpg\u003c/code\u003e and \u003ccode\u003e.png\u003c/code\u003e.",
	"definitions.Artwork.properties.Encryption.$ref": "#/definitions/Encryption",
	"definitions.Artwork.properties.Encryption.description": "The encryption settings, if any, that you want Elastic Transcoder to apply to your artwork.",
	"definitions.Artwork.properties.InputKey.$ref": "#/definitions/WatermarkKey",
	"definitions.Artwork.properties.InputKey.description": "\u003cp\u003eThe name of the file to be used as album art. To determine which Amazon S3 bucket contains the specified file, Elastic Transcoder checks the pipeline specified by \u003ccode\u003ePipelineId\u003c/code\u003e; the \u003ccode\u003eInputBucket\u003c/code\u003e object in that pipeline identifies the bucket.\u003c/p\u003e \u003cp\u003eIf the file name includes a prefix, for example, \u003ccode\u003ecooking/pie.jpg\u003c/code\u003e, include the prefix in the key. If the file isn't in the specified bucket, Elastic Transcoder returns an error.\u003c/p\u003e",
	"definitions.Artwork.properties.MaxHeight.$ref": "#/definitions/DigitsOrAuto",
	"definitions.Artwork.properties.MaxHeight.description": "The maximum height of the output album art in pixels. If you specify \u003ccode\u003eauto\u003c/code\u003e, Elastic Transcoder uses 600 as the default value. If you specify a numeric value, enter an even integer between 32 and 3072, inclusive.",
	"definitions.Artwork.properties.MaxWidth.$ref": "#/definitions/DigitsOrAuto",
	"definitions.Artwork.properties.MaxWidth.description": "The maximum width of the output album art in pixels. If you specify \u003ccode\u003eauto\u003c/code\u003e, Elastic Transcoder uses 600 as the default value. If you specify a numeric value, enter an even integer between 32 and 4096, inclusive.",
	"definitions.Artwork.properties.PaddingPolicy.$ref": "#/definitions/PaddingPolicy",
	"definitions.Artwork.properties.PaddingPolicy.description": "When you set \u003ccode\u003ePaddingPolicy\u003c/code\u003e to \u003ccode\u003ePad\u003c/code\u003e, Elastic Transcoder may add white bars to the top and bottom and/or left and right sides of the output album art to make the total size of the output art match the values that you specified for \u003ccode\u003eMaxWidth\u003c/code\u003e and \u003ccode\u003eMaxHeight\u003c/code\u003e.",
	"definitions.Artwork.properties.SizingPolicy.$ref": "#/definitions/SizingPolicy",
	"definitions.Artwork.properties.SizingPolicy.description": "\u003cp\u003eSpecify one of the following values to control scaling of the output album art:\u003c/p\u003e \u003cul\u003e \u003cli\u003e \u003cp\u003e \u003ccode\u003eFit:\u003c/code\u003e Elastic Transcoder scales the output art so it matches the value that you specified in either \u003ccode\u003eMaxWidth\u003c/code\u003e or \u003ccode\u003eMaxHeight\u003c/code\u003e without exceeding the other value.\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e \u003ccode\u003eFill:\u003c/code\u003e Elastic Transcoder scales the output art so it matches the value that you specified in either \u003ccode\u003eMaxWidth\u003c/code\u003e or \u003ccode\u003eMaxHeight\u003c/code\u003e and matches or exceeds the other value. Elastic Transcoder centers the output art and then crops it in the dimension (if any) that exceeds the maximum value. \u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e \u003ccode\u003eStretch:\u003c/code\u003e Elastic Transcoder stretches the output art to match the values that you specified for \u003ccode\u003eMaxWidth\u003c/code\u003e and \u003ccode\u003eMaxHeight\u003c/code\u003e. If the relative proportions of the input art and the output art are different, the output art will be distorted.\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e \u003ccode\u003eKeep:\u003c/code\u003e Elastic Transcoder does not scale the output art. If either dimension of the input art exceeds the values that you specified for \u003ccode\u003eMaxWidth\u003c/code\u003e and \u003ccode\u003eMaxHeight\u003c/code\u003e, Elastic Transcoder crops the output art.\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e \u003ccode\u003eShrinkToFit:\u003c/code\u003e Elastic Transcoder scales the output art down so that its dimensions match the values that you specified for at least one of \u003ccode\u003eMaxWidth\u003c/code\u003e and \u003ccode\u003eMaxHeight\u003c/code\u003e without exceeding either value. If you specify this option, Elastic Transcoder does not scale the art up.\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e \u003ccode\u003eShrinkToFill\u003c/code\u003e Elastic Transcoder scales the output art down so that its dimensions match the values that you specified for at least one of \u003ccode\u003eMaxWidth\u003c/code\u003e and \u003ccode\u003eMaxHeight\u003c/code\u003e without dropping below either value. If you specify this option, Elastic Transcoder does not scale the art up.\u003c/p\u003e \u003c/li\u003e \u003c/ul\u003e",
	"definitions.Artwork.type": "object",
	"definitions.Artworks.items.$ref": "#/definitions/Artwork",
	"definitions.Artworks.type": "array",
	"definitions.Ascending.pattern": "(^true$)|(^false$)",
	"definitions.Ascending.type": "string",
	"definitions.AspectRatio.pattern": "(^auto$)|(^1:1$)|(^4:3$)|(^3:2$)|(^16:9$)",
	"definitions.AspectRatio.type": "string",
	"definitions.AudioBitDepth.pattern": "(^8$)|(^16$)|(^24$)|(^32$)",
	"definitions.AudioBitDepth.type": "string",
	"definitions.AudioBitOrder.pattern": "(^LittleEndian$)",
	"definitions.AudioBitOrder.type": "string",
	"definitions.AudioBitRate.pattern": "^\\d{1,3}$",
	"definitions.AudioBitRate.type": "string",
	"definitions.AudioChannels.pattern": "(^auto$)|(^0$)|(^1$)|(^2$)",
	"definitions.AudioChannels.type": "string",
	"definitions.AudioCodec.pattern": "(^AAC$)|(^vorbis$)|(^mp3$)|(^mp2$)|(^pcm$)|(^flac$)",
	"definitions.AudioCodec.type": "string",
	"definitions.AudioCodecOptions.description": "Options associated with your audio codec.",
	"definitions.AudioCodecOptions.properties.BitDepth.$ref": "#/definitions/AudioBitDepth",
	"definitions.AudioCodecOptions.properties.BitDepth.description": "\u003cp\u003eYou can only choose an audio bit depth when you specify \u003ccode\u003eflac\u003c/code\u003e or \u003ccode\u003epcm\u003c/code\u003e for the value of Audio:Codec.\u003c/p\u003e \u003cp\u003eThe bit depth of a sample is how many bits of information are included in the audio samples. The higher the bit depth, the better the audio, but the larger the file.\u003c/p\u003e \u003cp\u003eValid values are \u003ccode\u003e16\u003c/code\u003e and \u003ccode\u003e24\u003c/code\u003e.\u003c/p\u003e \u003cp\u003eThe most common bit depth is \u003ccode\u003e24\u003c/code\u003e.\u003c/p\u003e",
	"definitions.AudioCodecOptions.properties.BitOrder.$ref": "#/definitions/AudioBitOrder",
	"definitions.AudioCodecOptions.properties.BitOrder.description": "\u003cp\u003eYou can only choose an audio bit order when you specify \u003ccode\u003epcm\u003c/code\u003e for the value of Audio:Codec.\u003c/p\u003e \u003cp\u003eThe order the bits of a PCM sample are stored in.\u003c/p\u003e \u003cp\u003eThe supported value is \u003ccode\u003eLittleEndian\u003c/code\u003e.\u003c/p\u003e",
	"definitions.AudioCodecOptions.properties.Profile.$ref": "#/definitions/AudioCodecProfile",
	"definitions.AudioCodecOptions.properties.Profile.description": "\u003cp\u003eYou can only choose an audio profile when you specify AAC for the value of Audio:Codec.\u003c/p\u003e \u003cp\u003eSpecify the AAC profile for the output file. Elastic Transcoder supports the following profiles:\u003c/p\u003e \u003cul\u003e \u003cli\u003e \u003cp\u003e \u003ccode\u003eauto\u003c/code\u003e: If you specify \u003ccode\u003eauto\u003c/code\u003e, Elastic Transcoder selects the profile based on the bit rate selected for the output file.\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e \u003ccode\u003eAAC-LC\u003c/code\u003e: The most common AAC profile. Use for bit rates larger than 64 kbps.\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e \u003ccode\u003eHE-AAC\u003c/code\u003e: Not supported on some older players and devices. Use for bit rates between 40 and 80 kbps.\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e \u003ccode\u003eHE-AACv2\u003c/code\u003e: Not supported on some players and devices. Use for bit rates less than 48 kbps.\u003c/p\u003e \u003c/li\u003e \u003c/ul\u003e \u003cp\u003eAll outputs in a \u003ccode\u003eSmooth\u003c/code\u003e playlist must have the same value for \u003ccode\u003eProfile\u003c/code\u003e.\u003c/p\u003e \u003cnote\u003e \u003cp\u003eIf you created any presets before AAC profiles were added, Elastic Transcoder automatically updated your presets to use AAC-LC. You can change the value as required.\u003c/p\u003e \u003c/note\u003e",
	"definitions.AudioCodecOptions.properties.Signed.$ref": "#/definitions/AudioSigned",
	"definitions.AudioCodecOptions.properties.Signed.description": "\u003cp\u003eYou can only choose whether an audio sample is signed when you specify \u003ccode\u003epcm\u003c/code\u003e for the value of Audio:Codec.\u003c/p\u003e \u003cp\u003eWhether audio samples are represented with negative and positive numbers (signed) or only positive numbers (unsigned).\u003c/p\u003e \u003cp\u003eThe supported value is \u003ccode\u003eSigned\u003c/code\u003e.\u003c/p\u003e",
	"definitions.AudioCodecOptions.type": "object",
	"definitions.AudioCodecProfile.pattern": "(^auto$)|(^AAC-LC$)|(^HE-AAC$)|(^HE-AACv2$)",
	"definitions.AudioCodecProfile.type": "string",
	"definitions.AudioPackingMode.pattern": "(^SingleTrack$)|(^OneChannelPerTrack$)|(^OneChannelPerTrackWithMosTo8Tracks$)",
	"definitions.AudioPackingMode.type": "string",
	"definitions.AudioParameters.description": "Parameters required for transcoding audio.",
	"definitions.AudioParameters.properties.AudioPackingMode.$ref": "#/definitions/AudioPackingMode",
	"definitions.AudioParameters.properties.AudioPackingMode.description": "\u003cp\u003eThe method of organizing audio channels and tracks. Use \u003ccode\u003eAudio:Channels\u003c/code\u003e to specify the number of channels in your output, and \u003ccode\u003eAudio:AudioPackingMode\u003c/code\u003e to specify the number of tracks and their relation to the channels. If you do not specify an \u003ccode\u003eAudio:AudioPackingMode\u003c/code\u003e, Elastic Transcoder uses \u003ccode\u003eSingleTrack\u003c/code\u003e.\u003c/p\u003e \u003cp\u003eThe following values are valid:\u003c/p\u003e \u003cp\u003e \u003ccode\u003eSingleTrack\u003c/code\u003e, \u003ccode\u003eOneChannelPerTrack\u003c/code\u003e, and \u003ccode\u003eOneChannelPerTrackWithMosTo8Tracks\u003c/code\u003e \u003c/p\u003e \u003cp\u003eWhen you specify \u003ccode\u003eSingleTrack\u003c/code\u003e, Elastic Transcoder creates a single track for your output. The track can have up to eight channels. Use \u003ccode\u003eSingleTrack\u003c/code\u003e for all non-\u003ccode\u003emxf\u003c/code\u003e containers.\u003c/p\u003e \u003cp\u003eThe outputs of \u003ccode\u003eSingleTrack\u003c/code\u003e for a specific channel value and inputs are as follows:\u003c/p\u003e \u003cul\u003e \u003cli\u003e \u003cp\u003e \u003ccode\u003e0\u003c/code\u003e \u003cb\u003e channels with any input:\u003c/b\u003e Audio omitted from the output\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e \u003ccode\u003e1, 2, or auto \u003c/code\u003e \u003cb\u003echannels with no audio input:\u003c/b\u003e Audio omitted from the output\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e \u003ccode\u003e1 \u003c/code\u003e \u003cb\u003echannel with any input with audio:\u003c/b\u003e One track with one channel, downmixed if necessary\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e \u003ccode\u003e2 \u003c/code\u003e \u003cb\u003echannels with one track with one channel:\u003c/b\u003e One track with two identical channels\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e \u003ccode\u003e2 or auto \u003c/code\u003e \u003cb\u003echannels with two tracks with one channel each:\u003c/b\u003e One track with two channels\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e \u003ccode\u003e2 or auto \u003c/code\u003e \u003cb\u003echannels with one track with two channels:\u003c/b\u003e One track with two channels\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e \u003ccode\u003e2 \u003c/code\u003e \u003cb\u003echannels with one track with multiple channels:\u003c/b\u003e One track with two channels\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e \u003ccode\u003eauto \u003c/code\u003e \u003cb\u003echannels with one track with one channel:\u003c/b\u003e One track with one channel\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e \u003ccode\u003eauto \u003c/code\u003e \u003cb\u003echannels with one track with multiple channels:\u003c/b\u003e One track with multiple channels\u003c/p\u003e \u003c/li\u003e \u003c/ul\u003e \u003cp\u003eWhen you specify \u003ccode\u003eOneChannelPerTrack\u003c/code\u003e, Elastic Transcoder creates a new track for every channel in your output. Your output can have up to eight single-channel tracks.\u003c/p\u003e \u003cp\u003eThe outputs of \u003ccode\u003eOneChannelPerTrack\u003c/code\u003e for a specific channel value and inputs are as follows:\u003c/p\u003e \u003cul\u003e \u003cli\u003e \u003cp\u003e \u003ccode\u003e0 \u003c/code\u003e \u003cb\u003echannels with any input:\u003c/b\u003e Audio omitted from the output\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e \u003ccode\u003e1, 2, or auto \u003c/code\u003e \u003cb\u003echannels with no audio input:\u003c/b\u003e Audio omitted from the output\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e \u003ccode\u003e1 \u003c/code\u003e \u003cb\u003echannel with any input with audio:\u003c/b\u003e One track with one channel, downmixed if necessary\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e \u003ccode\u003e2 \u003c/code\u003e \u003cb\u003echannels with one track with one channel:\u003c/b\u003e Two tracks with one identical channel each\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e \u003ccode\u003e2 or auto \u003c/code\u003e \u003cb\u003echannels with two tracks with one channel each:\u003c/b\u003e Two tracks with one channel each\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e \u003ccode\u003e2 or auto \u003c/code\u003e \u003cb\u003echannels with one track with two channels:\u003c/b\u003e Two tracks with one channel each\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e \u003ccode\u003e2 \u003c/code\u003e \u003cb\u003echannels with one track with multiple channels:\u003c/b\u003e Two tracks with one channel each\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e \u003ccode\u003eauto \u003c/code\u003e \u003cb\u003echannels with one track with one channel:\u003c/b\u003e One track with one channel\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e \u003ccode\u003eauto \u003c/code\u003e \u003cb\u003echannels with one track with multiple channels:\u003c/b\u003e Up to eight tracks with one channel each\u003c/p\u003e \u003c/li\u003e \u003c/ul\u003e \u003cp\u003eWhen you specify \u003ccode\u003eOneChannelPerTrackWithMosTo8Tracks\u003c/code\u003e, Elastic Transcoder creates eight single-channel tracks for your output. All tracks that do not contain audio data from an input channel are MOS, or Mit Out Sound, tracks.\u003c/p\u003e \u003cp\u003eThe outputs of \u003ccode\u003eOneChannelPerTrackWithMosTo8Tracks\u003c/code\u003e for a specific channel value and inputs are as follows:\u003c/p\u003e \u003cul\u003e \u003cli\u003e \u003cp\u003e \u003ccode\u003e0 \u003c/code\u003e \u003cb\u003echannels with any input:\u003c/b\u003e Audio omitted from the output\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e \u003ccode\u003e1, 2, or auto \u003c/code\u003e \u003cb\u003echannels with no audio input:\u003c/b\u003e Audio omitted from the output\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e \u003ccode\u003e1 \u003c/code\u003e \u003cb\u003echannel with any input with audio:\u003c/b\u003e One track with one channel, downmixed if necessary, plus six MOS tracks\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e \u003ccode\u003e2 \u003c/code\u003e \u003cb\u003echannels with one track with one channel:\u003c/b\u003e Two tracks with one identical channel each, plus six MOS tracks\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e \u003ccode\u003e2 or auto \u003c/code\u003e \u003cb\u003echannels with two tracks with one channel each:\u003c/b\u003e Two tracks with one channel each, plus six MOS tracks\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e \u003ccode\u003e2 or auto \u003c/code\u003e \u003cb\u003echannels with one track with two channels:\u003c/b\u003e Two tracks with one channel each, plus six MOS tracks\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e \u003ccode\u003e2 \u003c/code\u003e \u003cb\u003echannels with one track with multiple channels:\u003c/b\u003e Two tracks with one channel each, plus six MOS tracks\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e \u003ccode\u003eauto \u003c/code\u003e \u003cb\u003echannels with one track with one channel:\u003c/b\u003e One track with one channel, plus seven MOS tracks\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e \u003ccode\u003eauto \u003c/code\u003e \u003cb\u003echannels with one track with multiple channels:\u003c/b\u003e Up to eight tracks with one channel each, plus MOS tracks until there are eight tracks in all\u003c/p\u003e \u003c/li\u003e \u003c/ul\u003e",
	"definitions.AudioParameters.properties.BitRate.$ref": "#/definitions/AudioBitRate",
	"definitions.AudioParameters.properties.BitRate.description": "The bit rate of the audio stream in the output file, in kilobits/second. Enter an integer between 64 and 320, inclusive.",
	"definitions.AudioParameters.properties.Channels.$ref": "#/definitions/AudioChannels",
	"definitions.AudioParameters.properties.Channels.description": "\u003cp\u003eThe number of audio channels in the output file. The following values are valid:\u003c/p\u003e \u003cp\u003e \u003ccode\u003eauto\u003c/code\u003e, \u003ccode\u003e0\u003c/code\u003e, \u003ccode\u003e1\u003c/code\u003e, \u003ccode\u003e2\u003c/code\u003e \u003c/p\u003e \u003cp\u003eOne channel carries the information played by a single speaker. For example, a stereo track with two channels sends one channel to the left speaker, and the other channel to the right speaker. The output channels are organized into tracks. If you want Elastic Transcoder to automatically detect the number of audio channels in the input file and use that value for the output file, select \u003ccode\u003eauto\u003c/code\u003e.\u003c/p\u003e \u003cp\u003eThe output of a specific channel value and inputs are as follows:\u003c/p\u003e \u003cul\u003e \u003cli\u003e \u003cp\u003e \u003ccode\u003eauto\u003c/code\u003e \u003cb\u003e channel specified, with any input:\u003c/b\u003e Pass through up to eight input channels.\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e \u003ccode\u003e0\u003c/code\u003e \u003cb\u003e channels specified, with any input:\u003c/b\u003e Audio omitted from the output.\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e \u003ccode\u003e1\u003c/code\u003e \u003cb\u003e channel specified, with at least one input channel:\u003c/b\u003e Mono sound.\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e \u003ccode\u003e2\u003c/code\u003e \u003cb\u003e channels specified, with any input:\u003c/b\u003e Two identical mono channels or stereo. For more information about tracks, see \u003ccode\u003eAudio:AudioPackingMode.\u003c/code\u003e \u003c/p\u003e \u003c/li\u003e \u003c/ul\u003e \u003cp\u003e For more information about how Elastic Transcoder organizes channels and tracks, see \u003ccode\u003eAudio:AudioPackingMode\u003c/code\u003e.\u003c/p\u003e",
	"definitions.AudioParameters.properties.Codec.$ref": "#/definitions/AudioCodec",
	"definitions.AudioParameters.properties.Codec.description": "The audio codec for the output file. Valid values include \u003ccode\u003eaac\u003c/code\u003e, \u003ccode\u003eflac\u003c/code\u003e, \u003ccode\u003emp2\u003c/code\u003e, \u003ccode\u003emp3\u003c/code\u003e, \u003ccode\u003epcm\u003c/code\u003e, and \u003ccode\u003evorbis\u003c/code\u003e.",
	"definitions.AudioParameters.properties.CodecOptions.$ref": "#/definitions/AudioCodecOptions",
	"definitions.AudioParameters.properties.CodecOptions.description": "\u003cp\u003eIf you specified \u003ccode\u003eAAC\u003c/code\u003e for \u003ccode\u003eAudio:Codec\u003c/code\u003e, this is the \u003ccode\u003eAAC\u003c/code\u003e compression profile to use. Valid values include:\u003c/p\u003e \u003cp\u003e \u003ccode\u003eauto\u003c/code\u003e, \u003ccode\u003eAAC-LC\u003c/code\u003e, \u003ccode\u003eHE-AAC\u003c/code\u003e, \u003ccode\u003eHE-AACv2\u003c/code\u003e \u003c/p\u003e \u003cp\u003eIf you specify \u003ccode\u003eauto\u003c/code\u003e, Elastic Transcoder chooses a profile based on the bit rate of the output file.\u003c/p\u003e",
	"definitions.AudioParameters.properties.SampleRate.$ref": "#/definitions/AudioSampleRate",
	"definitions.AudioParameters.properties.SampleRate.description": "\u003cp\u003eThe sample rate of the audio stream in the output file, in Hertz. Valid values include:\u003c/p\u003e \u003cp\u003e \u003ccode\u003eauto\u003c/code\u003e, \u003ccode\u003e22050\u003c/code\u003e, \u003ccode\u003e32000\u003c/code\u003e, \u003ccode\u003e44100\u003c/code\u003e, \u003ccode\u003e48000\u003c/code\u003e, \u003ccode\u003e96000\u003c/code\u003e \u003c/p\u003e \u003cp\u003eIf you specify \u003ccode\u003eauto\u003c/code\u003e, Elastic Transcoder automatically detects the sample rate.\u003c/p\u003e",
	"definitions.AudioParameters.type": "object",
	"definitions.AudioSampleRate.pattern": "(^auto$)|(^22050$)|(^32000$)|(^44100$)|(^48000$)|(^96000$)|(^192000$)",
	"definitions.AudioSampleRate.type": "string",
	"definitions.AudioSigned.pattern": "(^Unsigned$)|(^Signed$)",
	"definitions.AudioSigned.type": "string",
	"definitions.Base64EncodedString.pattern": "^$|(^(?:[A-Za-z0-9\\+/]{4})*(?:[A-Za-z0-9\\+/]{2}==|[A-Za-z0-9\\+/]{3}=)?$)",
	"definitions.Base64EncodedString.type": "string",
	"definitions.BucketName.pattern": "^(\\w|\\.|-){1,255}$",
	"definitions.BucketName.type": "string",
	"definitions.CancelJobRequest.description": "The \u003ccode\u003eCancelJobRequest\u003c/code\u003e structure.",
	"definitions.CancelJobRequest.type": "object",
	"definitions.CancelJobResponse.description": "The response body contains a JSON object. If the job is successfully canceled, the value of \u003ccode\u003eSuccess\u003c/code\u003e is \u003ccode\u003etrue\u003c/code\u003e.",
	"definitions.CancelJobResponse.type": "object",
	"definitions.CaptionFormat.description": "The file format of the output captions. If you leave this value blank, Elastic Transcoder returns an error.",
	"definitions.CaptionFormat.properties.Encryption.$ref": "#/definitions/Encryption",
	"definitions.CaptionFormat.properties.Encryption.description": "The encryption settings, if any, that you want Elastic Transcoder to apply to your caption formats.",
	"definitions.CaptionFormat.properties.Format.$ref": "#/definitions/CaptionFormatFormat",
	"definitions.CaptionFormat.properties.Format.description": "\u003cp\u003eThe format you specify determines whether Elastic Transcoder generates an embedded or sidecar caption for this output.\u003c/p\u003e \u003cul\u003e \u003cli\u003e \u003cp\u003e \u003cb\u003eValid Embedded Caption Formats:\u003c/b\u003e \u003c/p\u003e \u003cul\u003e \u003cli\u003e \u003cp\u003e \u003cb\u003efor FLAC\u003c/b\u003e: None\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e \u003cb\u003eFor MP3\u003c/b\u003e: None\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e \u003cb\u003eFor MP4\u003c/b\u003e: mov-text\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e \u003cb\u003eFor MPEG-TS\u003c/b\u003e: None\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e \u003cb\u003eFor ogg\u003c/b\u003e: None\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e \u003cb\u003eFor webm\u003c/b\u003e: None\u003c/p\u003e \u003c/li\u003e \u003c/ul\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e \u003cb\u003eValid Sidecar Caption Formats:\u003c/b\u003e Elastic Transcoder supports dfxp (first div element only), scc, srt, and webvtt. If you want ttml or smpte-tt compatible captions, specify dfxp as your output format.\u003c/p\u003e \u003cul\u003e \u003cli\u003e \u003cp\u003e \u003cb\u003eFor FMP4\u003c/b\u003e: dfxp\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e \u003cb\u003eNon-FMP4 outputs\u003c/b\u003e: All sidecar types\u003c/p\u003e \u003c/li\u003e \u003c/ul\u003e \u003cp\u003e \u003ccode\u003efmp4\u003c/code\u003e captions have an extension of \u003ccode\u003e.ismt\u003c/code\u003e \u003c/p\u003e \u003c/li\u003e \u003c/ul\u003e",
	"definitions.CaptionFormat.properties.Pattern.$ref": "#/definitions/CaptionFormatPattern",
	"definitions.CaptionFormat.properties.Pattern.description": "\u003cp\u003eThe prefix for caption filenames, in the form \u003ci\u003edescription\u003c/i\u003e-\u003ccode\u003e{language}\u003c/code\u003e, where:\u003c/p\u003e \u003cul\u003e \u003cli\u003e \u003cp\u003e \u003ci\u003edescription\u003c/i\u003e is a description of the video.\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e \u003ccode\u003e{language}\u003c/code\u003e is a literal value that Elastic Transcoder replaces with the two- or three-letter code for the language of the caption in the output file names.\u003c/p\u003e \u003c/li\u003e \u003c/ul\u003e \u003cp\u003eIf you don't include \u003ccode\u003e{language}\u003c/code\u003e in the file name pattern, Elastic Transcoder automatically appends \"\u003ccode\u003e{language}\u003c/code\u003e\" to the value that you specify for the description. In addition, Elastic Transcoder automatically appends the count to the end of the segment files.\u003c/p\u003e \u003cp\u003eFor example, suppose you're transcoding into srt format. When you enter \"Sydney-{language}-sunrise\", and the language of the captions is English (en), the name of the first caption file is be Sydney-en-sunrise00000.srt.\u003c/p\u003e",
	"definitions.CaptionFormat.type": "object",
	"definitions.CaptionFormatFormat.pattern": "(^mov-text$)|(^srt$)|(^scc$)|(^webvtt$)|(^dfxp$)|(^cea-708$)",
	"definitions.CaptionFormatFormat.type": "string",
	"definitions.CaptionFormatPattern.pattern": "(^$)|(^.*\\{language\\}.*$)",
	"definitions.CaptionFormatPattern.type": "string",
	"definitions.CaptionFormats.items.$ref": "#/definitions/CaptionFormat",
	"definitions.CaptionFormats.maxItems": 4,
	"definitions.CaptionFormats.type": "array",
	"definitions.CaptionMergePolicy.pattern": "(^MergeOverride$)|(^MergeRetain$)|(^Override$)",
	"definitions.CaptionMergePolicy.type": "string",
	"definitions.CaptionSource.description": "A source file for the input sidecar captions used during the transcoding process.",
	"definitions.CaptionSource.properties.Encryption.$ref": "#/definitions/Encryption",
	"definitions.CaptionSource.properties.Encryption.description": "The encryption settings, if any, that Elastic Transcoder needs to decyrpt your caption sources, or that you want Elastic Transcoder to apply to your caption sources.",
	"definitions.CaptionSource.properties.Key.$ref": "#/definitions/LongKey",
	"definitions.CaptionSource.properties.Key.description": "The name of the sidecar caption file that you want Elastic Transcoder to include in the output file.",
	"definitions.CaptionSource.properties.Label.$ref": "#/definitions/Name",
	"definitions.CaptionSource.properties.Label.description": "The label of the caption shown in the player when choosing a language. We recommend that you put the caption language name here, in the language of the captions.",
	"definitions.CaptionSource.properties.Language.$ref": "#/definitions/Key",
	"definitions.CaptionSource.properties.Language.description": "\u003cp\u003eA string that specifies the language of the caption. If you specified multiple inputs with captions, the caption language must match in order to be included in the output. Specify this as one of:\u003c/p\u003e \u003cul\u003e \u003cli\u003e \u003cp\u003e2-character ISO 639-1 code\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e3-character ISO 639-2 code\u003c/p\u003e \u003c/li\u003e \u003c/ul\u003e \u003cp\u003eFor more information on ISO language codes and language names, see the List of ISO 639-1 codes.\u003c/p\u003e",
	"definitions.CaptionSource.properties.TimeOffset.$ref": "#/definitions/TimeOffset",
	"definitions.CaptionSource.properties.TimeOffset.description": "\u003cp\u003eFor clip generation or captions that do not start at the same time as the associated video file, the \u003ccode\u003eTimeOffset\u003c/code\u003e tells Elastic Transcoder how much of the video to encode before including captions.\u003c/p\u003e \u003cp\u003eSpecify the TimeOffset in the form [+-]SS.sss or [+-]HH:mm:SS.ss.\u003c/p\u003e",
	"definitions.CaptionSource.type": "object",
	"definitions.CaptionSources.items.$ref": "#/definitions/CaptionSource",
	"definitions.CaptionSources.maxItems": 20,
	"definitions.CaptionSources.type": "array",
	"definitions.Captions.description": "The captions to be created, if any.",
	"definitions.Captions.properties.CaptionFormats.$ref": "#/definitions/CaptionFormats",
	"definitions.Captions.properties.CaptionFormats.description": "The array of file formats for the output captions. If you leave this value blank, Elastic Transcoder returns an error.",
	"definitions.Captions.properties.CaptionSources.$ref": "#/definitions/CaptionSources",
	"definitions.Captions.properties.CaptionSources.description": "Source files for the input sidecar captions used during the transcoding process. To omit all sidecar captions, leave \u003ccode\u003eCaptionSources\u003c/code\u003e blank.",
	"definitions.Captions.properties.MergePolicy.$ref": "#/definitions/CaptionMergePolicy",
	"definitions.Captions.properties.MergePolicy.description": "\u003cp\u003eA policy that determines how Elastic Transcoder handles the existence of multiple captions.\u003c/p\u003e \u003cul\u003e \u003cli\u003e \u003cp\u003e \u003cb\u003eMergeOverride:\u003c/b\u003e Elastic Transcoder transcodes both embedded and sidecar captions into outputs. If captions for a language are embedded in the input file and also appear in a sidecar file, Elastic Transcoder uses the sidecar captions and ignores the embedded captions for that language.\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e \u003cb\u003eMergeRetain:\u003c/b\u003e Elastic Transcoder transcodes both embedded and sidecar captions into outputs. If captions for a language are embedded in the input file and also appear in a sidecar file, Elastic Transcoder uses the embedded captions and ignores the sidecar captions for that language. If \u003ccode\u003eCaptionSources\u003c/code\u003e is empty, Elastic Transcoder omits all sidecar captions from the output files.\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e \u003cb\u003eOverride:\u003c/b\u003e Elastic Transcoder transcodes only the sidecar captions that you specify in \u003ccode\u003eCaptionSources\u003c/code\u003e.\u003c/p\u003e \u003c/li\u003e \u003c/ul\u003e \u003cp\u003e \u003ccode\u003eMergePolicy\u003c/code\u003e cannot be null.\u003c/p\u003e",
	"definitions.Captions.type": "object",
	"definitions.Clip.description": "Settings for one clip in a composition. All jobs in a playlist must have the same clip settings.",
	"definitions.Clip.properties.TimeSpan.$ref": "#/definitions/TimeSpan",
	"definitions.Clip.properties.TimeSpan.description": "Settings that determine when a clip begins and how long it lasts.",
	"definitions.Clip.type": "object",
	"definitions.CodecOption.maxLength": 255,
	"definitions.CodecOption.minLength": 1,
	"definitions.CodecOption.type": "string",
	"definitions.CodecOptions.items.properties.key.$ref": "#/definitions/CodecOption",
	"definitions.CodecOptions.items.properties.value.$ref": "#/definitions/CodecOption",
	"definitions.CodecOptions.items.type": "object",
	"definitions.CodecOptions.maxItems": 30,
	"definitions.CodecOptions.type": "array",
	"definitions.Composition.items.$ref": "#/definitions/Clip",
	"definitions.Composition.type": "array",
	"definitions.CreateJobOutput.description": "The \u003ccode\u003eCreateJobOutput\u003c/code\u003e structure.",
	"definitions.CreateJobOutput.properties.AlbumArt.$ref": "#/definitions/JobAlbumArt",
	"definitions.CreateJobOutput.properties.AlbumArt.description": "Information about the album art that you want Elastic Transcoder to add to the file during transcoding. You can specify up to twenty album artworks for each output. Settings for each artwork must be defined in the job for the current output.",
	"definitions.CreateJobOutput.properties.Captions.$ref": "#/definitions/Captions",
	"definitions.CreateJobOutput.properties.Captions.description": "\u003cp\u003eYou can configure Elastic Transcoder to transcode captions, or subtitles, from one format to another. All captions must be in UTF-8. Elastic Transcoder supports two types of captions:\u003c/p\u003e \u003cul\u003e \u003cli\u003e \u003cp\u003e \u003cb\u003eEmbedded:\u003c/b\u003e Embedded captions are included in the same file as the audio and video. Elastic Transcoder supports only one embedded caption per language, to a maximum of 300 embedded captions per file.\u003c/p\u003e \u003cp\u003eValid input values include: \u003ccode\u003eCEA-608 (EIA-608\u003c/code\u003e, first non-empty channel only), \u003ccode\u003eCEA-708 (EIA-708\u003c/code\u003e, first non-empty channel only), and \u003ccode\u003emov-text\u003c/code\u003e \u003c/p\u003e \u003cp\u003eValid outputs include: \u003ccode\u003emov-text\u003c/code\u003e \u003c/p\u003e \u003cp\u003eElastic Transcoder supports a maximum of one embedded format per output.\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e \u003cb\u003eSidecar:\u003c/b\u003e Sidecar captions are kept in a separate metadata file from the audio and video data. Sidecar captions require a player that is capable of understanding the relationship between the video file and the sidecar file. Elastic Transcoder supports only one sidecar caption per language, to a maximum of 20 sidecar captions per file.\u003c/p\u003e \u003cp\u003eValid input values include: \u003ccode\u003edfxp\u003c/code\u003e (first div element only), \u003ccode\u003eebu-tt\u003c/code\u003e, \u003ccode\u003escc\u003c/code\u003e, \u003ccode\u003esmpt\u003c/code\u003e, \u003ccode\u003esrt\u003c/code\u003e, \u003ccode\u003ettml\u003c/code\u003e (first div element only), and \u003ccode\u003ewebvtt\u003c/code\u003e \u003c/p\u003e \u003cp\u003eValid outputs include: \u003ccode\u003edfxp\u003c/code\u003e (first div element only), \u003ccode\u003escc\u003c/code\u003e, \u003ccode\u003esrt\u003c/code\u003e, and \u003ccode\u003ewebvtt\u003c/code\u003e.\u003c/p\u003e \u003c/li\u003e \u003c/ul\u003e \u003cp\u003eIf you want ttml or smpte-tt compatible captions, specify dfxp as your output format.\u003c/p\u003e \u003cp\u003eElastic Transcoder does not support OCR (Optical Character Recognition), does not accept pictures as a valid input for captions, and is not available for audio-only transcoding. Elastic Transcoder does not preserve text formatting (for example, italics) during the transcoding process.\u003c/p\u003e \u003cp\u003eTo remove captions or leave the captions empty, set \u003ccode\u003eCaptions\u003c/code\u003e to null. To pass through existing captions unchanged, set the \u003ccode\u003eMergePolicy\u003c/code\u003e to \u003ccode\u003eMergeRetain\u003c/code\u003e, and pass in a null \u003ccode\u003eCaptionSources\u003c/code\u003e array.\u003c/p\u003e \u003cp\u003eFor more information on embedded files, see the Subtitles Wikipedia page.\u003c/p\u003e \u003cp\u003eFor more information on sidecar files, see the Extensible Metadata Platform and Sidecar file Wikipedia pages.\u003c/p\u003e",
	"definitions.CreateJobOutput.properties.Composition.$ref": "#/definitions/Composition",
	"definitions.CreateJobOutput.properties.Composition.description": "You can create an output file that contains an excerpt from the input file. This excerpt, called a clip, can come from the beginning, middle, or end of the file. The Composition object contains settings for the clips that make up an output file. For the current release, you can only specify settings for a single clip per output file. The Composition object cannot be null.",
	"definitions.CreateJobOutput.properties.Encryption.$ref": "#/definitions/Encryption",
	"definitions.CreateJobOutput.properties.Encryption.description": "You can specify encryption settings for any output files that you want to use for a transcoding job. This includes the output file and any watermarks, thumbnails, album art, or captions that you want to use. You must specify encryption settings for each file individually.",
	"definitions.CreateJobOutput.properties.Key.$ref": "#/definitions/Key",
	"definitions.CreateJobOutput.properties.Key.description": " The name to assign to the transcoded file. Elastic Transcoder saves the file in the Amazon S3 bucket specified by the \u003ccode\u003eOutputBucket\u003c/code\u003e object in the pipeline that is specified by the pipeline ID. If a file with the specified name already exists in the output bucket, the job fails. ",
	"definitions.CreateJobOutput.properties.PresetId.$ref": "#/definitions/Id",
	"definitions.CreateJobOutput.properties.PresetId.description": " The \u003ccode\u003eId\u003c/code\u003e of the preset to use for this job. The preset determines the audio, video, and thumbnail settings that Elastic Transcoder uses for transcoding. ",
	"definitions.CreateJobOutput.properties.Rotate.$ref": "#/definitions/Rotate",
	"definitions.CreateJobOutput.properties.Rotate.description": " The number of degrees clockwise by which you want Elastic Transcoder to rotate the output relative to the input. Enter one of the following values: \u003ccode\u003eauto\u003c/code\u003e, \u003ccode\u003e0\u003c/code\u003e, \u003ccode\u003e90\u003c/code\u003e, \u003ccode\u003e180\u003c/code\u003e, \u003ccode\u003e270\u003c/code\u003e. The value \u003ccode\u003eauto\u003c/code\u003e generally works only if the file that you're transcoding contains rotation metadata. ",
	"definitions.CreateJobOutput.properties.SegmentDuration.$ref": "#/definitions/FloatString",
	"definitions.CreateJobOutput.properties.SegmentDuration.description": "\u003cimportant\u003e \u003cp\u003e(Outputs in Fragmented MP4 or MPEG-TS format only.\u003c/p\u003e \u003c/important\u003e \u003cp\u003eIf you specify a preset in \u003ccode\u003ePresetId\u003c/code\u003e for which the value of \u003ccode\u003eContainer\u003c/code\u003e is \u003ccode\u003efmp4\u003c/code\u003e (Fragmented MP4) or \u003ccode\u003ets\u003c/code\u003e (MPEG-TS), \u003ccode\u003eSegmentDuration\u003c/code\u003e is the target maximum duration of each segment in seconds. For \u003ccode\u003eHLSv3\u003c/code\u003e format playlists, each media segment is stored in a separate \u003ccode\u003e.ts\u003c/code\u003e file. For \u003ccode\u003eHLSv4\u003c/code\u003e and \u003ccode\u003eSmooth\u003c/code\u003e playlists, all media segments for an output are stored in a single file. Each segment is approximately the length of the \u003ccode\u003eSegmentDuration\u003c/code\u003e, though individual segments might be shorter or longer.\u003c/p\u003e \u003cp\u003eThe range of valid values is 1 to 60 seconds. If the duration of the video is not evenly divisible by \u003ccode\u003eSegmentDuration\u003c/code\u003e, the duration of the last segment is the remainder of total length/SegmentDuration.\u003c/p\u003e \u003cp\u003eElastic Transcoder creates an output-specific playlist for each output \u003ccode\u003eHLS\u003c/code\u003e output that you specify in OutputKeys. To add an output to the master playlist for this job, include it in the \u003ccode\u003eOutputKeys\u003c/code\u003e of the associated playlist.\u003c/p\u003e",
	"definitions.CreateJobOutput.properties.ThumbnailEncryption.$ref": "#/definitions/Encryption",
	"definitions.CreateJobOutput.properties.ThumbnailEncryption.description": "The encryption settings, if any, that you want Elastic Transcoder to apply to your thumbnail.",
	"definitions.CreateJobOutput.properties.ThumbnailPattern.$ref": "#/definitions/ThumbnailPattern",
	"definitions.CreateJobOutput.properties.ThumbnailPattern.description": "\u003cp\u003eWhether you want Elastic Transcoder to create thumbnails for your videos and, if so, how you want Elastic Transcoder to name the files.\u003c/p\u003e \u003cp\u003eIf you don't want Elastic Transcoder to create thumbnails, specify \"\".\u003c/p\u003e \u003cp\u003eIf you do want Elastic Transcoder to create thumbnails, specify the information that you want to include in the file name for each thumbnail. You can specify the following values in any sequence:\u003c/p\u003e \u003cul\u003e \u003cli\u003e \u003cp\u003e \u003cb\u003e \u003ccode\u003e{count}\u003c/code\u003e (Required)\u003c/b\u003e: If you want to create thumbnails, you must include \u003ccode\u003e{count}\u003c/code\u003e in the \u003ccode\u003eThumbnailPattern\u003c/code\u003e object. Wherever you specify \u003ccode\u003e{count}\u003c/code\u003e, Elastic Transcoder adds a five-digit sequence number (beginning with \u003cb\u003e00001\u003c/b\u003e) to thumbnail file names. The number indicates where a given thumbnail appears in the sequence of thumbnails for a transcoded file. \u003c/p\u003e \u003cimportant\u003e \u003cp\u003eIf you specify a literal value and/or \u003ccode\u003e{resolution}\u003c/code\u003e but you omit \u003ccode\u003e{count}\u003c/code\u003e, Elastic Transcoder returns a validation error and does not create the job.\u003c/p\u003e \u003c/important\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e \u003cb\u003eLiteral values (Optional)\u003c/b\u003e: You can specify literal values anywhere in the \u003ccode\u003eThumbnailPattern\u003c/code\u003e object. For example, you can include them as a file name prefix or as a delimiter between \u003ccode\u003e{resolution}\u003c/code\u003e and \u003ccode\u003e{count}\u003c/code\u003e. \u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e \u003cb\u003e \u003ccode\u003e{resolution}\u003c/code\u003e (Optional)\u003c/b\u003e: If you want Elastic Transcoder to include the resolution in the file name, include \u003ccode\u003e{resolution}\u003c/code\u003e in the \u003ccode\u003eThumbnailPattern\u003c/code\u003e object. \u003c/p\u003e \u003c/li\u003e \u003c/ul\u003e \u003cp\u003eWhen creating thumbnails, Elastic Transcoder automatically saves the files in the format (.jpg or .png) that appears in the preset that you specified in the \u003ccode\u003ePresetID\u003c/code\u003e value of \u003ccode\u003eCreateJobOutput\u003c/code\u003e. Elastic Transcoder also appends the applicable file name extension.\u003c/p\u003e",
	"definitions.CreateJobOutput.properties.Watermarks.$ref": "#/definitions/JobWatermarks",
	"definitions.CreateJobOutput.properties.Watermarks.description": "Information about the watermarks that you want Elastic Transcoder to add to the video during transcoding. You can specify up to four watermarks for each output. Settings for each watermark must be defined in the preset for the current output.",
	"definitions.CreateJobOutput.type": "object",
	"definitions.CreateJobOutputs.items.$ref": "#/definitions/CreateJobOutput",
	"definitions.CreateJobOutputs.maxItems": 30,
	"definitions.CreateJobOutputs.type": "array",
	"definitions.CreateJobPlaylist.description": "Information about the master playlist.",
	"definitions.CreateJobPlaylist.properties.Format.$ref": "#/definitions/PlaylistFormat",
	"definitions.CreateJobPlaylist.properties.Format.description": "The format of the output playlist. Valid formats include \u003ccode\u003eHLSv3\u003c/code\u003e, \u003ccode\u003eHLSv4\u003c/code\u003e, and \u003ccode\u003eSmooth\u003c/code\u003e.",
	"definitions.CreateJobPlaylist.properties.HlsContentProtection.$ref": "#/definitions/HlsContentProtection",
	"definitions.CreateJobPlaylist.properties.HlsContentProtection.description": "The HLS content protection settings, if any, that you want Elastic Transcoder to apply to the output files associated with this playlist.",
	"definitions.CreateJobPlaylist.properties.Name.$ref": "#/definitions/Filename",
	"definitions.CreateJobPlaylist.properties.Name.description": "\u003cp\u003eThe name that you want Elastic Transcoder to assign to the master playlist, for example, nyc-vacation.m3u8. If the name includes a \u003ccode\u003e/\u003c/code\u003e character, the section of the name before the last \u003ccode\u003e/\u003c/code\u003e must be identical for all \u003ccode\u003eName\u003c/code\u003e objects. If you create more than one master playlist, the values of all \u003ccode\u003eName\u003c/code\u003e objects must be unique.\u003c/p\u003e \u003cnote\u003e \u003cp\u003e Elastic Transcoder automatically appends the relevant file extension to the file name (\u003ccode\u003e.m3u8\u003c/code\u003e for \u003ccode\u003eHLSv3\u003c/code\u003e and \u003ccode\u003eHLSv4\u003c/code\u003e playlists, and \u003ccode\u003e.ism\u003c/code\u003e and \u003ccode\u003e.ismc\u003c/code\u003e for \u003ccode\u003eSmooth\u003c/code\u003e playlists). If you include a file extension in \u003ccode\u003eName\u003c/code\u003e, the file name will have two extensions.\u003c/p\u003e \u003c/note\u003e",
	"definitions.CreateJobPlaylist.properties.OutputKeys.$ref": "#/definitions/OutputKeys",
	"definitions.CreateJobPlaylist.properties.OutputKeys.description": "\u003cp\u003eFor each output in this job that you want to include in a master playlist, the value of the \u003ccode\u003eOutputs:Key\u003c/code\u003e object. \u003c/p\u003e \u003cul\u003e \u003cli\u003e \u003cp\u003eIf your output is not \u003ccode\u003eHLS\u003c/code\u003e or does not have a segment duration set, the name of the output file is a concatenation of \u003ccode\u003eOutputKeyPrefix\u003c/code\u003e and \u003ccode\u003eOutputs:Key\u003c/code\u003e:\u003c/p\u003e \u003cp\u003eOutputKeyPrefix\u003ccode\u003eOutputs:Key\u003c/code\u003e \u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003eIf your output is \u003ccode\u003eHLSv3\u003c/code\u003e and has a segment duration set, or is not included in a playlist, Elastic Transcoder creates an output playlist file with a file extension of \u003ccode\u003e.m3u8\u003c/code\u003e, and a series of \u003ccode\u003e.ts\u003c/code\u003e files that include a five-digit sequential counter beginning with 00000:\u003c/p\u003e \u003cp\u003eOutputKeyPrefix\u003ccode\u003eOutputs:Key\u003c/code\u003e.m3u8\u003c/p\u003e \u003cp\u003eOutputKeyPrefix\u003ccode\u003eOutputs:Key\u003c/code\u003e00000.ts\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003eIf your output is \u003ccode\u003eHLSv4\u003c/code\u003e, has a segment duration set, and is included in an \u003ccode\u003eHLSv4\u003c/code\u003e playlist, Elastic Transcoder creates an output playlist file with a file extension of \u003ccode\u003e_v4.m3u8\u003c/code\u003e. If the output is video, Elastic Transcoder also creates an output file with an extension of \u003ccode\u003e_iframe.m3u8\u003c/code\u003e:\u003c/p\u003e \u003cp\u003eOutputKeyPrefix\u003ccode\u003eOutputs:Key\u003c/code\u003e_v4.m3u8\u003c/p\u003e \u003cp\u003eOutputKeyPrefix\u003ccode\u003eOutputs:Key\u003c/code\u003e_iframe.m3u8\u003c/p\u003e \u003cp\u003eOutputKeyPrefix\u003ccode\u003eOutputs:Key\u003c/code\u003e.ts\u003c/p\u003e \u003c/li\u003e \u003c/ul\u003e \u003cp\u003eElastic Transcoder automatically appends the relevant file extension to the file name. If you include a file extension in Output Key, the file name will have two extensions.\u003c/p\u003e \u003cp\u003eIf you include more than one output in a playlist, any segment duration settings, clip settings, or caption settings must be the same for all outputs in the playlist. For \u003ccode\u003eSmooth\u003c/code\u003e playlists, the \u003ccode\u003eAudio:Profile\u003c/code\u003e, \u003ccode\u003eVideo:Profile\u003c/code\u003e, and \u003ccode\u003eVideo:FrameRate\u003c/code\u003e to \u003ccode\u003eVideo:KeyframesMaxDist\u003c/code\u003e ratio must be the same for all outputs.\u003c/p\u003e",
	"definitions.CreateJobPlaylist.properties.PlayReadyDrm.$ref": "#/definitions/PlayReadyDrm",
	"definitions.CreateJobPlaylist.properties.PlayReadyDrm.description": "The DRM settings, if any, that you want Elastic Transcoder to apply to the output files associated with this playlist.",
	"definitions.CreateJobPlaylist.type": "object",
	"definitions.CreateJobPlaylists.items.$ref": "#/definitions/CreateJobPlaylist",
	"definitions.CreateJobPlaylists.maxItems": 30,
	"definitions.CreateJobPlaylists.type": "array",
	"definitions.CreateJobRequest.description": "The \u003ccode\u003eCreateJobRequest\u003c/code\u003e structure.",
	"definitions.CreateJobRequest.properties.Input.$ref": "#/definitions/JobInput",
	"definitions.CreateJobRequest.properties.Input.description": "A section of the request body that provides information about the file that is being transcoded.",
	"definitions.CreateJobRequest.properties.Inputs.$ref": "#/definitions/JobInputs",
	"definitions.CreateJobRequest.properties.Inputs.description": "A section of the request body that provides information about the files that are being transcoded.",
	"definitions.CreateJobRequest.properties.Output.$ref": "#/definitions/CreateJobOutput",
	"definitions.CreateJobRequest.properties.Output.description": " A section of the request body that provides information about the transcoded (target) file. We strongly recommend that you use the \u003ccode\u003eOutputs\u003c/code\u003e syntax instead of the \u003ccode\u003eOutput\u003c/code\u003e syntax. ",
	"definitions.CreateJobRequest.properties.OutputKeyPrefix.$ref": "#/definitions/Key",
	"definitions.CreateJobRequest.properties.OutputKeyPrefix.description": "The value, if any, that you want Elastic Transcoder to prepend to the names of all files that this job creates, including output files, thumbnails, and playlists.",
	"definitions.CreateJobRequest.properties.Outputs.$ref": "#/definitions/CreateJobOutputs",
	"definitions.CreateJobRequest.properties.Outputs.description": " A section of the request body that provides information about the transcoded (target) files. We recommend that you use the \u003ccode\u003eOutputs\u003c/code\u003e syntax instead of the \u003ccode\u003eOutput\u003c/code\u003e syntax. ",
	"definitions.CreateJobRequest.properties.PipelineId.$ref": "#/definitions/Id",
	"definitions.CreateJobRequest.properties.PipelineId.description": "The \u003ccode\u003eId\u003c/code\u003e of the pipeline that you want Elastic Transcoder to use for transcoding. The pipeline determines several settings, including the Amazon S3 bucket from which Elastic Transcoder gets the files to transcode and the bucket into which Elastic Transcoder puts the transcoded files.",
	"definitions.CreateJobRequest.properties.Playlists.$ref": "#/definitions/CreateJobPlaylists",
	"definitions.CreateJobRequest.properties.Playlists.description": "\u003cp\u003eIf you specify a preset in \u003ccode\u003ePresetId\u003c/code\u003e for which the value of \u003ccode\u003eContainer\u003c/code\u003e is fmp4 (Fragmented MP4) or ts (MPEG-TS), Playlists contains information about the master playlists that you want Elastic Transcoder to create.\u003c/p\u003e \u003cp\u003eThe maximum number of master playlists in a job is 30.\u003c/p\u003e",
	"definitions.CreateJobRequest.properties.UserMetadata.$ref": "#/definitions/UserMetadata",
	"definitions.CreateJobRequest.properties.UserMetadata.description": "User-defined metadata that you want to associate with an Elastic Transcoder job. You specify metadata in \u003ccode\u003ekey/value\u003c/code\u003e pairs, and you can add up to 10 \u003ccode\u003ekey/value\u003c/code\u003e pairs per job. Elastic Transcoder does not guarantee that \u003ccode\u003ekey/value\u003c/code\u003e pairs are returned in the same order in which you specify them.",
	"definitions.CreateJobRequest.required.length": 1,
	"definitions.CreateJobRequest.required[0]": "PipelineId",
	"definitions.CreateJobRequest.type": "object",
	"definitions.CreateJobResponse.description": "The CreateJobResponse structure.",
	"definitions.CreateJobResponse.properties.Job.$ref": "#/definitions/Job",
	"definitions.CreateJobResponse.properties.Job.description": "A section of the response body that provides information about the job that is created.",
	"definitions.CreateJobResponse.type": "object",
	"definitions.CreatePipelineRequest.description": "The \u003ccode\u003eCreatePipelineRequest\u003c/code\u003e structure.",
	"definitions.CreatePipelineRequest.properties.AwsKmsKeyArn.$ref": "#/definitions/KeyArn",
	"definitions.CreatePipelineRequest.properties.AwsKmsKeyArn.description": "\u003cp\u003eThe AWS Key Management Service (AWS KMS) key that you want to use with this pipeline.\u003c/p\u003e \u003cp\u003eIf you use either \u003ccode\u003eS3\u003c/code\u003e or \u003ccode\u003eS3-AWS-KMS\u003c/code\u003e as your \u003ccode\u003eEncryption:Mode\u003c/code\u003e, you don't need to provide a key with your job because a default key, known as an AWS-KMS key, is created for you automatically. You need to provide an AWS-KMS key only if you want to use a non-default AWS-KMS key, or if you are using an \u003ccode\u003eEncryption:Mode\u003c/code\u003e of \u003ccode\u003eAES-PKCS7\u003c/code\u003e, \u003ccode\u003eAES-CTR\u003c/code\u003e, or \u003ccode\u003eAES-GCM\u003c/code\u003e.\u003c/p\u003e",
	"definitions.CreatePipelineRequest.properties.ContentConfig.$ref": "#/definitions/PipelineOutputConfig",
	"definitions.CreatePipelineRequest.properties.ContentConfig.description": "\u003cp\u003eThe optional \u003ccode\u003eContentConfig\u003c/code\u003e object specifies information about the Amazon S3 bucket in which you want Elastic Transcoder to save transcoded files and playlists: which bucket to use, which users you want to have access to the files, the type of access you want users to have, and the storage class that you want to assign to the files.\u003c/p\u003e \u003cp\u003eIf you specify values for \u003ccode\u003eContentConfig\u003c/code\u003e, you must also specify values for \u003ccode\u003eThumbnailConfig\u003c/code\u003e.\u003c/p\u003e \u003cp\u003eIf you specify values for \u003ccode\u003eContentConfig\u003c/code\u003e and \u003ccode\u003eThumbnailConfig\u003c/code\u003e, omit the \u003ccode\u003eOutputBucket\u003c/code\u003e object.\u003c/p\u003e \u003cul\u003e \u003cli\u003e \u003cp\u003e \u003cb\u003eBucket\u003c/b\u003e: The Amazon S3 bucket in which you want Elastic Transcoder to save transcoded files and playlists.\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e \u003cb\u003ePermissions\u003c/b\u003e (Optional): The Permissions object specifies which users you want to have access to transcoded files and the type of access you want them to have. You can grant permissions to a maximum of 30 users and/or predefined Amazon S3 groups.\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e \u003cb\u003eGrantee Type\u003c/b\u003e: Specify the type of value that appears in the \u003ccode\u003eGrantee\u003c/code\u003e object: \u003c/p\u003e \u003cul\u003e \u003cli\u003e \u003cp\u003e \u003cb\u003eCanonical\u003c/b\u003e: The value in the \u003ccode\u003eGrantee\u003c/code\u003e object is either the canonical user ID for an AWS account or an origin access identity for an Amazon CloudFront distribution. For more information about canonical user IDs, see Access Control List (ACL) Overview in the Amazon Simple Storage Service Developer Guide. For more information about using CloudFront origin access identities to require that users use CloudFront URLs instead of Amazon S3 URLs, see Using an Origin Access Identity to Restrict Access to Your Amazon S3 Content.\u003c/p\u003e \u003cimportant\u003e \u003cp\u003eA canonical user ID is not the same as an AWS account number.\u003c/p\u003e \u003c/important\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e \u003cb\u003eEmail\u003c/b\u003e: The value in the \u003ccode\u003eGrantee\u003c/code\u003e object is the registered email address of an AWS account.\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e \u003cb\u003eGroup\u003c/b\u003e: The value in the \u003ccode\u003eGrantee\u003c/code\u003e object is one of the following predefined Amazon S3 groups: \u003ccode\u003eAllUsers\u003c/code\u003e, \u003ccode\u003eAuthenticatedUsers\u003c/code\u003e, or \u003ccode\u003eLogDelivery\u003c/code\u003e.\u003c/p\u003e \u003c/li\u003e \u003c/ul\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e \u003cb\u003eGrantee\u003c/b\u003e: The AWS user or group that you want to have access to transcoded files and playlists. To identify the user or group, you can specify the canonical user ID for an AWS account, an origin access identity for a CloudFront distribution, the registered email address of an AWS account, or a predefined Amazon S3 group \u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e \u003cb\u003eAccess\u003c/b\u003e: The permission that you want to give to the AWS user that you specified in \u003ccode\u003eGrantee\u003c/code\u003e. Permissions are granted on the files that Elastic Transcoder adds to the bucket, including playlists and video files. Valid values include: \u003c/p\u003e \u003cul\u003e \u003cli\u003e \u003cp\u003e \u003ccode\u003eREAD\u003c/code\u003e: The grantee can read the objects and metadata for objects that Elastic Transcoder adds to the Amazon S3 bucket.\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e \u003ccode\u003eREAD_ACP\u003c/code\u003e: The grantee can read the object ACL for objects that Elastic Transcoder adds to the Amazon S3 bucket.\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e \u003ccode\u003eWRITE_ACP\u003c/code\u003e: The grantee can write the ACL for the objects that Elastic Transcoder adds to the Amazon S3 bucket.\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e \u003ccode\u003eFULL_CONTROL\u003c/code\u003e: The grantee has \u003ccode\u003eREAD\u003c/code\u003e, \u003ccode\u003eREAD_ACP\u003c/code\u003e, and \u003ccode\u003eWRITE_ACP\u003c/code\u003e permissions for the objects that Elastic Transcoder adds to the Amazon S3 bucket.\u003c/p\u003e \u003c/li\u003e \u003c/ul\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e \u003cb\u003eStorageClass\u003c/b\u003e: The Amazon S3 storage class, \u003ccode\u003eStandard\u003c/code\u003e or \u003ccode\u003eReducedRedundancy\u003c/code\u003e, that you want Elastic Transcoder to assign to the video files and playlists that it stores in your Amazon S3 bucket.\u003c/p\u003e \u003c/li\u003e \u003c/ul\u003e",
	"definitions.CreatePipelineRequest.properties.InputBucket.$ref": "#/definitions/BucketName",
	"definitions.CreatePipelineRequest.properties.InputBucket.description": "The Amazon S3 bucket in which you saved the media files that you want to transcode.",
	"definitions.CreatePipelineRequest.properties.Name.$ref": "#/definitions/Name",
	"definitions.CreatePipelineRequest.properties.Name.description": "\u003cp\u003eThe name of the pipeline. We recommend that the name be unique within the AWS account, but uniqueness is not enforced.\u003c/p\u003e \u003cp\u003eConstraints: Maximum 40 characters.\u003c/p\u003e",
	"definitions.CreatePipelineRequest.properties.Notifications.$ref": "#/definitions/Notifications",
	"definitions.CreatePipelineRequest.properties.Notifications.description": "\u003cp\u003eThe Amazon Simple Notification Service (Amazon SNS) topic that you want to notify to report job status.\u003c/p\u003e \u003cimportant\u003e \u003cp\u003eTo receive notifications, you must also subscribe to the new topic in the Amazon SNS console.\u003c/p\u003e \u003c/important\u003e \u003cul\u003e \u003cli\u003e \u003cp\u003e \u003cb\u003eProgressing\u003c/b\u003e: The topic ARN for the Amazon Simple Notification Service (Amazon SNS) topic that you want to notify when Elastic Transcoder has started to process a job in this pipeline. This is the ARN that Amazon SNS returned when you created the topic. For more information, see Create a Topic in the Amazon Simple Notification Service Developer Guide.\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e \u003cb\u003eCompleted\u003c/b\u003e: The topic ARN for the Amazon SNS topic that you want to notify when Elastic Transcoder has finished processing a job in this pipeline. This is the ARN that Amazon SNS returned when you created the topic.\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e \u003cb\u003eWarning\u003c/b\u003e: The topic ARN for the Amazon SNS topic that you want to notify when Elastic Transcoder encounters a warning condition while processing a job in this pipeline. This is the ARN that Amazon SNS returned when you created the topic.\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e \u003cb\u003eError\u003c/b\u003e: The topic ARN for the Amazon SNS topic that you want to notify when Elastic Transcoder encounters an error condition while processing a job in this pipeline. This is the ARN that Amazon SNS returned when you created the topic.\u003c/p\u003e \u003c/li\u003e \u003c/ul\u003e",
	"definitions.CreatePipelineRequest.properties.OutputBucket.$ref": "#/definitions/BucketName",
	"definitions.CreatePipelineRequest.properties.OutputBucket.description": "\u003cp\u003eThe Amazon S3 bucket in which you want Elastic Transcoder to save the transcoded files. (Use this, or use ContentConfig:Bucket plus ThumbnailConfig:Bucket.)\u003c/p\u003e \u003cp\u003eSpecify this value when all of the following are true:\u003c/p\u003e \u003cul\u003e \u003cli\u003e \u003cp\u003eYou want to save transcoded files, thumbnails (if any), and playlists (if any) together in one bucket.\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003eYou do not want to specify the users or groups who have access to the transcoded files, thumbnails, and playlists.\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003eYou do not want to specify the permissions that Elastic Transcoder grants to the files. \u003c/p\u003e \u003cimportant\u003e \u003cp\u003eWhen Elastic Transcoder saves files in \u003ccode\u003eOutputBucket\u003c/code\u003e, it grants full control over the files only to the AWS account that owns the role that is specified by \u003ccode\u003eRole\u003c/code\u003e.\u003c/p\u003e \u003c/important\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003eYou want to associate the transcoded files and thumbnails with the Amazon S3 Standard storage class.\u003c/p\u003e \u003c/li\u003e \u003c/ul\u003e \u003cp\u003eIf you want to save transcoded files and playlists in one bucket and thumbnails in another bucket, specify which users can access the transcoded files or the permissions the users have, or change the Amazon S3 storage class, omit \u003ccode\u003eOutputBucket\u003c/code\u003e and specify values for \u003ccode\u003eContentConfig\u003c/code\u003e and \u003ccode\u003eThumbnailConfig\u003c/code\u003e instead.\u003c/p\u003e",
	"definitions.CreatePipelineRequest.properties.Role.$ref": "#/definitions/Role",
	"definitions.CreatePipelineRequest.properties.Role.description": "The IAM Amazon Resource Name (ARN) for the role that you want Elastic Transcoder to use to create the pipeline.",
	"definitions.CreatePipelineRequest.properties.ThumbnailConfig.$ref": "#/definitions/PipelineOutputConfig",
	"definitions.CreatePipelineRequest.properties.ThumbnailConfig.description": "\u003cp\u003eThe \u003ccode\u003eThumbnailConfig\u003c/code\u003e object specifies several values, including the Amazon S3 bucket in which you want Elastic Transcoder to save thumbnail files, which users you want to have access to the files, the type of access you want users to have, and the storage class that you want to assign to the files.\u003c/p\u003e \u003cp\u003eIf you specify values for \u003ccode\u003eContentConfig\u003c/code\u003e, you must also specify values for \u003ccode\u003eThumbnailConfig\u003c/code\u003e even if you don't want to create thumbnails.\u003c/p\u003e \u003cp\u003eIf you specify values for \u003ccode\u003eContentConfig\u003c/code\u003e and \u003ccode\u003eThumbnailConfig\u003c/code\u003e, omit the \u003ccode\u003eOutputBucket\u003c/code\u003e object.\u003c/p\u003e \u003cul\u003e \u003cli\u003e \u003cp\u003e \u003cb\u003eBucket\u003c/b\u003e: The Amazon S3 bucket in which you want Elastic Transcoder to save thumbnail files.\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e \u003cb\u003ePermissions\u003c/b\u003e (Optional): The \u003ccode\u003ePermissions\u003c/code\u003e object specifies which users and/or predefined Amazon S3 groups you want to have access to thumbnail files, and the type of access you want them to have. You can grant permissions to a maximum of 30 users and/or predefined Amazon S3 groups.\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e \u003cb\u003eGranteeType\u003c/b\u003e: Specify the type of value that appears in the Grantee object: \u003c/p\u003e \u003cul\u003e \u003cli\u003e \u003cp\u003e \u003cb\u003eCanonical\u003c/b\u003e: The value in the \u003ccode\u003eGrantee\u003c/code\u003e object is either the canonical user ID for an AWS account or an origin access identity for an Amazon CloudFront distribution.\u003c/p\u003e \u003cimportant\u003e \u003cp\u003eA canonical user ID is not the same as an AWS account number.\u003c/p\u003e \u003c/important\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e \u003cb\u003eEmail\u003c/b\u003e: The value in the \u003ccode\u003eGrantee\u003c/code\u003e object is the registered email address of an AWS account. \u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e \u003cb\u003eGroup\u003c/b\u003e: The value in the \u003ccode\u003eGrantee\u003c/code\u003e object is one of the following predefined Amazon S3 groups: \u003ccode\u003eAllUsers\u003c/code\u003e, \u003ccode\u003eAuthenticatedUsers\u003c/code\u003e, or \u003ccode\u003eLogDelivery\u003c/code\u003e.\u003c/p\u003e \u003c/li\u003e \u003c/ul\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e \u003cb\u003eGrantee\u003c/b\u003e: The AWS user or group that you want to have access to thumbnail files. To identify the user or group, you can specify the canonical user ID for an AWS account, an origin access identity for a CloudFront distribution, the registered email address of an AWS account, or a predefined Amazon S3 group. \u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e \u003cb\u003eAccess\u003c/b\u003e: The permission that you want to give to the AWS user that you specified in \u003ccode\u003eGrantee\u003c/code\u003e. Permissions are granted on the thumbnail files that Elastic Transcoder adds to the bucket. Valid values include: \u003c/p\u003e \u003cul\u003e \u003cli\u003e \u003cp\u003e \u003ccode\u003eREAD\u003c/code\u003e: The grantee can read the thumbnails and metadata for objects that Elastic Transcoder adds to the Amazon S3 bucket.\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e \u003ccode\u003eREAD_ACP\u003c/code\u003e: The grantee can read the object ACL for thumbnails that Elastic Transcoder adds to the Amazon S3 bucket.\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e \u003ccode\u003eWRITE_ACP\u003c/code\u003e: The grantee can write the ACL for the thumbnails that Elastic Transcoder adds to the Amazon S3 bucket.\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e \u003ccode\u003eFULL_CONTROL\u003c/code\u003e: The grantee has \u003ccode\u003eREAD\u003c/code\u003e, \u003ccode\u003eREAD_ACP\u003c/code\u003e, and \u003ccode\u003eWRITE_ACP\u003c/code\u003e permissions for the thumbnails that Elastic Transcoder adds to the Amazon S3 bucket.\u003c/p\u003e \u003c/li\u003e \u003c/ul\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e \u003cb\u003eStorageClass\u003c/b\u003e: The Amazon S3 storage class, \u003ccode\u003eStandard\u003c/code\u003e or \u003ccode\u003eReducedRedundancy\u003c/code\u003e, that you want Elastic Transcoder to assign to the thumbnails that it stores in your Amazon S3 bucket.\u003c/p\u003e \u003c/li\u003e \u003c/ul\u003e",
	"definitions.CreatePipelineRequest.required.length": 3,
	"definitions.CreatePipelineRequest.required[0]": "Name",
	"definitions.CreatePipelineRequest.required[1]": "InputBucket",
	"definitions.CreatePipelineRequest.required[2]": "Role",
	"definitions.CreatePipelineRequest.type": "object",
	"definitions.CreatePipelineResponse.description": "When you create a pipeline, Elastic Transcoder returns the values that you specified in the request.",
	"definitions.CreatePipelineResponse.properties.Pipeline.$ref": "#/definitions/Pipeline",
	"definitions.CreatePipelineResponse.properties.Pipeline.description": "A section of the response body that provides information about the pipeline that is created.",
	"definitions.CreatePipelineResponse.properties.Warnings.$ref": "#/definitions/Warnings",
	"definitions.CreatePipelineResponse.properties.Warnings.description": "\u003cp\u003eElastic Transcoder returns a warning if the resources used by your pipeline are not in the same region as the pipeline.\u003c/p\u003e \u003cp\u003eUsing resources in the same region, such as your Amazon S3 buckets, Amazon SNS notification topics, and AWS KMS key, reduces processing time and prevents cross-regional charges.\u003c/p\u003e",
	"definitions.CreatePipelineResponse.type": "object",
	"definitions.CreatePresetRequest.description": "The \u003ccode\u003eCreatePresetRequest\u003c/code\u003e structure.",
	"definitions.CreatePresetRequest.properties.Audio.$ref": "#/definitions/AudioParameters",
	"definitions.CreatePresetRequest.properties.Audio.description": "A section of the request body that specifies the audio parameters.",
	"definitions.CreatePresetRequest.properties.Container.$ref": "#/definitions/PresetContainer",
	"definitions.CreatePresetRequest.properties.Container.description": "The container type for the output file. Valid values include \u003ccode\u003eflac\u003c/code\u003e, \u003ccode\u003eflv\u003c/code\u003e, \u003ccode\u003efmp4\u003c/code\u003e, \u003ccode\u003egif\u003c/code\u003e, \u003ccode\u003emp3\u003c/code\u003e, \u003ccode\u003emp4\u003c/code\u003e, \u003ccode\u003empg\u003c/code\u003e, \u003ccode\u003emxf\u003c/code\u003e, \u003ccode\u003eoga\u003c/code\u003e, \u003ccode\u003eogg\u003c/code\u003e, \u003ccode\u003ets\u003c/code\u003e, and \u003ccode\u003ewebm\u003c/code\u003e.",
	"definitions.CreatePresetRequest.properties.Description.$ref": "#/definitions/Description",
	"definitions.CreatePresetRequest.properties.Description.description": "A description of the preset.",
	"definitions.CreatePresetRequest.properties.Name.$ref": "#/definitions/Name",
	"definitions.CreatePresetRequest.properties.Name.description": "The name of the preset. We recommend that the name be unique within the AWS account, but uniqueness is not enforced.",
	"definitions.CreatePresetRequest.properties.Thumbnails.$ref": "#/definitions/Thumbnails",
	"definitions.CreatePresetRequest.properties.Thumbnails.description": "A section of the request body that specifies the thumbnail parameters, if any.",
	"definitions.CreatePresetRequest.properties.Video.$ref": "#/definitions/VideoParameters",
	"definitions.CreatePresetRequest.properties.Video.description": "A section of the request body that specifies the video parameters.",
	"definitions.CreatePresetRequest.required.length": 2,
	"definitions.CreatePresetRequest.required[0]": "Name",
	"definitions.CreatePresetRequest.required[1]": "Container",
	"definitions.CreatePresetRequest.type": "object",
	"definitions.CreatePresetResponse.description": "The \u003ccode\u003eCreatePresetResponse\u003c/code\u003e structure.",
	"definitions.CreatePresetResponse.properties.Preset.$ref": "#/definitions/Preset",
	"definitions.CreatePresetResponse.properties.Preset.description": "A section of the response body that provides information about the preset that is created.",
	"definitions.CreatePresetResponse.properties.Warning.$ref": "#/definitions/String",
	"definitions.CreatePresetResponse.properties.Warning.description": "If the preset settings don't comply with the standards for the video codec but Elastic Transcoder created the preset, this message explains the reason the preset settings don't meet the standard. Elastic Transcoder created the preset because the settings might produce acceptable output.",
	"definitions.CreatePresetResponse.type": "object",
	"definitions.DeletePipelineRequest.description": "The \u003ccode\u003eDeletePipelineRequest\u003c/code\u003e structure.",
	"definitions.DeletePipelineRequest.type": "object",
	"definitions.DeletePipelineResponse.description": "The \u003ccode\u003eDeletePipelineResponse\u003c/code\u003e structure.",
	"definitions.DeletePipelineResponse.type": "object",
	"definitions.DeletePresetRequest.description": "The \u003ccode\u003eDeletePresetRequest\u003c/code\u003e structure.",
	"definitions.DeletePresetRequest.type": "object",
	"definitions.DeletePresetResponse.description": "The \u003ccode\u003eDeletePresetResponse\u003c/code\u003e structure.",
	"definitions.DeletePresetResponse.type": "object",
	"definitions.Description.maxLength": 255,
	"definitions.Description.minLength": 0,
	"definitions.Description.type": "string",
	"definitions.DetectedProperties.description": "The detected properties of the input file. Elastic Transcoder identifies these values from the input file.",
	"definitions.DetectedProperties.properties.DurationMillis.$ref": "#/definitions/NullableLong",
	"definitions.DetectedProperties.properties.DurationMillis.description": "The detected duration of the input file, in milliseconds.",
	"definitions.DetectedProperties.properties.FileSize.$ref": "#/definitions/NullableLong",
	"definitions.DetectedProperties.properties.FileSize.description": "The detected file size of the input file, in bytes.",
	"definitions.DetectedProperties.properties.FrameRate.$ref": "#/definitions/FloatString",
	"definitions.DetectedProperties.properties.FrameRate.description": "The detected frame rate of the input file, in frames per second.",
	"definitions.DetectedProperties.properties.Height.$ref": "#/definitions/NullableInteger",
	"definitions.DetectedProperties.properties.Height.description": "The detected height of the input file, in pixels.",
	"definitions.DetectedProperties.properties.Width.$ref": "#/definitions/NullableInteger",
	"definitions.DetectedProperties.properties.Width.description": "The detected width of the input file, in pixels.",
	"definitions.DetectedProperties.type": "object",
	"definitions.Digits.pattern": "^\\d{1,5}$",
	"definitions.Digits.type": "string",
	"definitions.DigitsOrAuto.pattern": "(^auto$)|(^\\d{2,4}$)",
	"definitions.DigitsOrAuto.type": "string",
	"definitions.Encryption.description": "The encryption settings, if any, that are used for decrypting your input files or encrypting your output files. If your input file is encrypted, you must specify the mode that Elastic Transcoder uses to decrypt your file, otherwise you must specify the mode you want Elastic Transcoder to use to encrypt your output files.",
	"definitions.Encryption.properties.InitializationVector.$ref": "#/definitions/ZeroTo255String",
	"definitions.Encryption.properties.InitializationVector.description": "The series of random bits created by a random bit generator, unique for every encryption operation, that you used to encrypt your input files or that you want Elastic Transcoder to use to encrypt your output files. The initialization vector must be base64-encoded, and it must be exactly 16 bytes long before being base64-encoded.",
	"definitions.Encryption.properties.Key.$ref": "#/definitions/Base64EncodedString",
	"definitions.Encryption.properties.Key.description": "\u003cp\u003eThe data encryption key that you want Elastic Transcoder to use to encrypt your output file, or that was used to encrypt your input file. The key must be base64-encoded and it must be one of the following bit lengths before being base64-encoded:\u003c/p\u003e \u003cp\u003e \u003ccode\u003e128\u003c/code\u003e, \u003ccode\u003e192\u003c/code\u003e, or \u003ccode\u003e256\u003c/code\u003e. \u003c/p\u003e \u003cp\u003eThe key must also be encrypted by using the Amazon Key Management Service.\u003c/p\u003e",
	"definitions.Encryption.properties.KeyMd5.$ref": "#/definitions/Base64EncodedString",
	"definitions.Encryption.properties.KeyMd5.description": "The MD5 digest of the key that you used to encrypt your input file, or that you want Elastic Transcoder to use to encrypt your output file. Elastic Transcoder uses the key digest as a checksum to make sure your key was not corrupted in transit. The key MD5 must be base64-encoded, and it must be exactly 16 bytes long before being base64-encoded.",
	"definitions.Encryption.properties.Mode.$ref": "#/definitions/EncryptionMode",
	"definitions.Encryption.properties.Mode.description": "\u003cp\u003eThe specific server-side encryption mode that you want Elastic Transcoder to use when decrypting your input files or encrypting your output files. Elastic Transcoder supports the following options:\u003c/p\u003e \u003cul\u003e \u003cli\u003e \u003cp\u003e \u003cb\u003eS3:\u003c/b\u003e Amazon S3 creates and manages the keys used for encrypting your files.\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e \u003cb\u003eS3-AWS-KMS:\u003c/b\u003e Amazon S3 calls the Amazon Key Management Service, which creates and manages the keys that are used for encrypting your files. If you specify \u003ccode\u003eS3-AWS-KMS\u003c/code\u003e and you don't want to use the default key, you must add the AWS-KMS key that you want to use to your pipeline.\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e \u003cb\u003eAES-CBC-PKCS7:\u003c/b\u003e A padded cipher-block mode of operation originally used for HLS files.\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e \u003cb\u003eAES-CTR:\u003c/b\u003e AES Counter Mode.\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e \u003cb\u003eAES-GCM:\u003c/b\u003e AES Galois Counter Mode, a mode of operation that is an authenticated encryption format, meaning that a file, key, or initialization vector that has been tampered with fails the decryption process.\u003c/p\u003e \u003c/li\u003e \u003c/ul\u003e \u003cp\u003eFor all three AES options, you must provide the following settings, which must be base64-encoded:\u003c/p\u003e \u003cul\u003e \u003cli\u003e \u003cp\u003e \u003cb\u003eKey\u003c/b\u003e \u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e \u003cb\u003eKey MD5\u003c/b\u003e \u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e \u003cb\u003eInitialization Vector\u003c/b\u003e \u003c/p\u003e \u003c/li\u003e \u003c/ul\u003e \u003cimportant\u003e \u003cp\u003eFor the AES modes, your private encryption keys and your unencrypted data are never stored by AWS; therefore, it is important that you safely manage your encryption keys. If you lose them, you won't be able to unencrypt your data.\u003c/p\u003e \u003c/important\u003e",
	"definitions.Encryption.type": "object",
	"definitions.EncryptionMode.pattern": "(^s3$)|(^s3-aws-kms$)|(^aes-cbc-pkcs7$)|(^aes-ctr$)|(^aes-gcm$)",
	"definitions.EncryptionMode.type": "string",
	"definitions.ExceptionMessages.items.$ref": "#/definitions/String",
	"definitions.ExceptionMessages.type": "array",
	"definitions.Filename.maxLength": 255,
	"definitions.Filename.minLength": 1,
	"definitions.Filename.type": "string",
	"definitions.FixedGOP.pattern": "(^true$)|(^false$)",
	"definitions.FixedGOP.type": "string",
	"definitions.FloatString.pattern": "^\\d{1,5}(\\.\\d{0,5})?$",
	"definitions.FloatString.type": "string",
	"definitions.FrameRate.pattern": "(^auto$)|(^10$)|(^15$)|(^23.97$)|(^24$)|(^25$)|(^29.97$)|(^30$)|(^50$)|(^60$)",
	"definitions.FrameRate.type": "string",
	"definitions.Grantee.maxLength": 255,
	"definitions.Grantee.minLength": 1,
	"definitions.Grantee.type": "string",
	"definitions.GranteeType.pattern": "(^Canonical$)|(^Email$)|(^Group$)",
	"definitions.GranteeType.type": "string",
	"definitions.HlsContentProtection.description": "The HLS content protection settings, if any, that you want Elastic Transcoder to apply to your output files.",
	"definitions.HlsContentProtection.properties.InitializationVector.$ref": "#/definitions/ZeroTo255String",
	"definitions.HlsContentProtection.properties.InitializationVector.description": "\u003cp\u003eIf Elastic Transcoder is generating your key for you, you must leave this field blank.\u003c/p\u003e \u003cp\u003eThe series of random bits created by a random bit generator, unique for every encryption operation, that you want Elastic Transcoder to use to encrypt your output files. The initialization vector must be base64-encoded, and it must be exactly 16 bytes before being base64-encoded.\u003c/p\u003e",
	"definitions.HlsContentProtection.properties.Key.$ref": "#/definitions/Base64EncodedString",
	"definitions.HlsContentProtection.properties.Key.description": "\u003cp\u003eIf you want Elastic Transcoder to generate a key for you, leave this field blank.\u003c/p\u003e \u003cp\u003eIf you choose to supply your own key, you must encrypt the key by using AWS KMS. The key must be base64-encoded, and it must be one of the following bit lengths before being base64-encoded:\u003c/p\u003e \u003cp\u003e \u003ccode\u003e128\u003c/code\u003e, \u003ccode\u003e192\u003c/code\u003e, or \u003ccode\u003e256\u003c/code\u003e. \u003c/p\u003e",
	"definitions.HlsContentProtection.properties.KeyMd5.$ref": "#/definitions/Base64EncodedString",
	"definitions.HlsContentProtection.properties.KeyMd5.description": "\u003cp\u003eIf Elastic Transcoder is generating your key for you, you must leave this field blank.\u003c/p\u003e \u003cp\u003eThe MD5 digest of the key that you want Elastic Transcoder to use to encrypt your output file, and that you want Elastic Transcoder to use as a checksum to make sure your key was not corrupted in transit. The key MD5 must be base64-encoded, and it must be exactly 16 bytes before being base64- encoded.\u003c/p\u003e",
	"definitions.HlsContentProtection.properties.KeyStoragePolicy.$ref": "#/definitions/KeyStoragePolicy",
	"definitions.HlsContentProtection.properties.KeyStoragePolicy.description": "Specify whether you want Elastic Transcoder to write your HLS license key to an Amazon S3 bucket. If you choose \u003ccode\u003eWithVariantPlaylists\u003c/code\u003e, \u003ccode\u003eLicenseAcquisitionUrl\u003c/code\u003e must be left blank and Elastic Transcoder writes your data key into the same bucket as the associated playlist.",
	"definitions.HlsContentProtection.properties.LicenseAcquisitionUrl.$ref": "#/definitions/ZeroTo512String",
	"definitions.HlsContentProtection.properties.LicenseAcquisitionUrl.description": "The location of the license key required to decrypt your HLS playlist. The URL must be an absolute path, and is referenced in the URI attribute of the EXT-X-KEY metadata tag in the playlist file.",
	"definitions.HlsContentProtection.properties.Method.$ref": "#/definitions/HlsContentProtectionMethod",
	"definitions.HlsContentProtection.properties.Method.description": "\u003cp\u003eThe content protection method for your output. The only valid value is: \u003ccode\u003eaes-128\u003c/code\u003e.\u003c/p\u003e \u003cp\u003eThis value is written into the method attribute of the \u003ccode\u003eEXT-X-KEY\u003c/code\u003e metadata tag in the output playlist.\u003c/p\u003e",
	"definitions.HlsContentProtection.type": "object",
	"definitions.HlsContentProtectionMethod.pattern": "(^aes-128$)",
	"definitions.HlsContentProtectionMethod.type": "string",
	"definitions.HorizontalAlign.pattern": "(^Left$)|(^Right$)|(^Center$)",
	"definitions.HorizontalAlign.type": "string",
	"definitions.Id.pattern": "^\\d{13}-\\w{6}$",
	"definitions.Id.type": "string",
	"definitions.IncompatibleVersionException.type": "object",
	"definitions.InputCaptions.description": "The captions to be created, if any.",
	"definitions.InputCaptions.properties.CaptionSources.$ref": "#/definitions/CaptionSources",
	"definitions.InputCaptions.properties.CaptionSources.description": "Source files for the input sidecar captions used during the transcoding process. To omit all sidecar captions, leave \u003ccode\u003eCaptionSources\u003c/code\u003e blank.",
	"definitions.InputCaptions.properties.MergePolicy.$ref": "#/definitions/CaptionMergePolicy",
	"definitions.InputCaptions.properties.MergePolicy.description": "\u003cp\u003eA policy that determines how Elastic Transcoder handles the existence of multiple captions.\u003c/p\u003e \u003cul\u003e \u003cli\u003e \u003cp\u003e \u003cb\u003eMergeOverride:\u003c/b\u003e Elastic Transcoder transcodes both embedded and sidecar captions into outputs. If captions for a language are embedded in the input file and also appear in a sidecar file, Elastic Transcoder uses the sidecar captions and ignores the embedded captions for that language.\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e \u003cb\u003eMergeRetain:\u003c/b\u003e Elastic Transcoder transcodes both embedded and sidecar captions into outputs. If captions for a language are embedded in the input file and also appear in a sidecar file, Elastic Transcoder uses the embedded captions and ignores the sidecar captions for that language. If \u003ccode\u003eCaptionSources\u003c/code\u003e is empty, Elastic Transcoder omits all sidecar captions from the output files.\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e \u003cb\u003eOverride:\u003c/b\u003e Elastic Transcoder transcodes only the sidecar captions that you specify in \u003ccode\u003eCaptionSources\u003c/code\u003e.\u003c/p\u003e \u003c/li\u003e \u003c/ul\u003e \u003cp\u003e \u003ccode\u003eMergePolicy\u003c/code\u003e cannot be null.\u003c/p\u003e",
	"definitions.InputCaptions.type": "object",
	"definitions.Interlaced.pattern": "(^auto$)|(^true$)|(^false$)",
	"definitions.Interlaced.type": "string",
	"definitions.InternalServiceException.description": "Elastic Transcoder encountered an unexpected exception while trying to fulfill the request.",
	"definitions.InternalServiceException.type": "object",
	"definitions.Job.description": "A section of the response body that provides information about the job that is created.",
	"definitions.Job.properties.Arn.$ref": "#/definitions/String",
	"definitions.Job.properties.Arn.description": "The Amazon Resource Name (ARN) for the job.",
	"definitions.Job.properties.Id.$ref": "#/definitions/Id",
	"definitions.Job.properties.Id.description": "The identifier that Elastic Transcoder assigned to the job. You use this value to get settings for the job or to delete the job.",
	"definitions.Job.properties.Input.$ref": "#/definitions/JobInput",
	"definitions.Job.properties.Input.description": "A section of the request or response body that provides information about the file that is being transcoded.",
	"definitions.Job.properties.Inputs.$ref": "#/definitions/JobInputs",
	"definitions.Job.properties.Inputs.description": "Information about the files that you're transcoding. If you specified multiple files for this job, Elastic Transcoder stitches the files together to make one output.",
	"definitions.Job.properties.Output.$ref": "#/definitions/JobOutput",
	"definitions.Job.properties.Output.description": "\u003cp\u003eIf you specified one output for a job, information about that output. If you specified multiple outputs for a job, the Output object lists information about the first output. This duplicates the information that is listed for the first output in the Outputs object.\u003c/p\u003e \u003cimportant\u003e \u003cp\u003eOutputs recommended instead.\u003c/p\u003e \u003c/important\u003e \u003cp\u003eA section of the request or response body that provides information about the transcoded (target) file. \u003c/p\u003e",
	"definitions.Job.properties.OutputKeyPrefix.$ref": "#/definitions/Key",
	"definitions.Job.properties.OutputKeyPrefix.description": "The value, if any, that you want Elastic Transcoder to prepend to the names of all files that this job creates, including output files, thumbnails, and playlists. We recommend that you add a / or some other delimiter to the end of the \u003ccode\u003eOutputKeyPrefix\u003c/code\u003e.",
	"definitions.Job.properties.Outputs.$ref": "#/definitions/JobOutputs",
	"definitions.Job.properties.Outputs.description": "\u003cp\u003eInformation about the output files. We recommend that you use the \u003ccode\u003eOutputs\u003c/code\u003e syntax for all jobs, even when you want Elastic Transcoder to transcode a file into only one format. Do not use both the \u003ccode\u003eOutputs\u003c/code\u003e and \u003ccode\u003eOutput\u003c/code\u003e syntaxes in the same request. You can create a maximum of 30 outputs per job. \u003c/p\u003e \u003cp\u003eIf you specify more than one output for a job, Elastic Transcoder creates the files for each output in the order in which you specify them in the job.\u003c/p\u003e",
	"definitions.Job.properties.PipelineId.$ref": "#/definitions/Id",
	"definitions.Job.properties.PipelineId.description": " The \u003ccode\u003eId\u003c/code\u003e of the pipeline that you want Elastic Transcoder to use for transcoding. The pipeline determines several settings, including the Amazon S3 bucket from which Elastic Transcoder gets the files to transcode and the bucket into which Elastic Transcoder puts the transcoded files. ",
	"definitions.Job.properties.Playlists.$ref": "#/definitions/Playlists",
	"definitions.Job.properties.Playlists.description": "\u003cimportant\u003e \u003cp\u003eOutputs in Fragmented MP4 or MPEG-TS format only.\u003c/p\u003e \u003c/important\u003e \u003cp\u003eIf you specify a preset in \u003ccode\u003ePresetId\u003c/code\u003e for which the value of \u003ccode\u003eContainer\u003c/code\u003e is fmp4 (Fragmented MP4) or ts (MPEG-TS), \u003ccode\u003ePlaylists\u003c/code\u003e contains information about the master playlists that you want Elastic Transcoder to create.\u003c/p\u003e \u003cp\u003eThe maximum number of master playlists in a job is 30.\u003c/p\u003e",
	"definitions.Job.properties.Status.$ref": "#/definitions/JobStatus",
	"definitions.Job.properties.Status.description": " The status of the job: \u003ccode\u003eSubmitted\u003c/code\u003e, \u003ccode\u003eProgressing\u003c/code\u003e, \u003ccode\u003eComplete\u003c/code\u003e, \u003ccode\u003eCanceled\u003c/code\u003e, or \u003ccode\u003eError\u003c/code\u003e. ",
	"definitions.Job.properties.Timing.$ref": "#/definitions/Timing",
	"definitions.Job.properties.Timing.description": "Details about the timing of a job.",
	"definitions.Job.properties.UserMetadata.$ref": "#/definitions/UserMetadata",
	"definitions.Job.properties.UserMetadata.description": "\u003cp\u003eUser-defined metadata that you want to associate with an Elastic Transcoder job. You specify metadata in \u003ccode\u003ekey/value\u003c/code\u003e pairs, and you can add up to 10 \u003ccode\u003ekey/value\u003c/code\u003e pairs per job. Elastic Transcoder does not guarantee that \u003ccode\u003ekey/value\u003c/code\u003e pairs are returned in the same order in which you specify them.\u003c/p\u003e \u003cp\u003eMetadata \u003ccode\u003ekeys\u003c/code\u003e and \u003ccode\u003evalues\u003c/code\u003e must use characters from the following list:\u003c/p\u003e \u003cul\u003e \u003cli\u003e \u003cp\u003e \u003ccode\u003e0-9\u003c/code\u003e \u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e \u003ccode\u003eA-Z\u003c/code\u003e and \u003ccode\u003ea-z\u003c/code\u003e \u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e \u003ccode\u003eSpace\u003c/code\u003e \u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003eThe following symbols: \u003ccode\u003e_.:/=+-%@\u003c/code\u003e \u003c/p\u003e \u003c/li\u003e \u003c/ul\u003e",
	"definitions.Job.type": "object",
	"definitions.JobAlbumArt.description": "The .jpg or .png file associated with an audio file.",
	"definitions.JobAlbumArt.properties.Artwork.$ref": "#/definitions/Artworks",
	"definitions.JobAlbumArt.properties.Artwork.description": "The file to be used as album art. There can be multiple artworks associated with an audio file, to a maximum of 20. Valid formats are \u003ccode\u003e.jpg\u003c/code\u003e and \u003ccode\u003e.png\u003c/code\u003e ",
	"definitions.JobAlbumArt.properties.MergePolicy.$ref": "#/definitions/MergePolicy",
	"definitions.JobAlbumArt.properties.MergePolicy.description": "\u003cp\u003eA policy that determines how Elastic Transcoder handles the existence of multiple album artwork files.\u003c/p\u003e \u003cul\u003e \u003cli\u003e \u003cp\u003e \u003ccode\u003eReplace:\u003c/code\u003e The specified album art replaces any existing album art.\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e \u003ccode\u003ePrepend:\u003c/code\u003e The specified album art is placed in front of any existing album art.\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e \u003ccode\u003eAppend:\u003c/code\u003e The specified album art is placed after any existing album art.\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e \u003ccode\u003eFallback:\u003c/code\u003e If the original input file contains artwork, Elastic Transcoder uses that artwork for the output. If the original input does not contain artwork, Elastic Transcoder uses the specified album art file.\u003c/p\u003e \u003c/li\u003e \u003c/ul\u003e",
	"definitions.JobAlbumArt.type": "object",
	"definitions.JobContainer.pattern": "(^auto$)|(^3gp$)|(^asf$)|(^avi$)|(^divx$)|(^flv$)|(^mkv$)|(^mov$)|(^mp4$)|(^mpeg$)|(^mpeg-ps$)|(^mpeg-ts$)|(^mxf$)|(^ogg$)|(^ts$)|(^vob$)|(^wav$)|(^webm$)|(^mp3$)|(^m4a$)|(^aac$)",
	"definitions.JobContainer.type": "string",
	"definitions.JobInput.description": "Information about the file that you're transcoding.",
	"definitions.JobInput.properties.AspectRatio.$ref": "#/definitions/AspectRatio",
	"definitions.JobInput.properties.AspectRatio.description": "\u003cp\u003e The aspect ratio of the input file. If you want Elastic Transcoder to automatically detect the aspect ratio of the input file, specify \u003ccode\u003eauto\u003c/code\u003e. If you want to specify the aspect ratio for the output file, enter one of the following values: \u003c/p\u003e \u003cp\u003e \u003ccode\u003e1:1\u003c/code\u003e, \u003ccode\u003e4:3\u003c/code\u003e, \u003ccode\u003e3:2\u003c/code\u003e, \u003ccode\u003e16:9\u003c/code\u003e \u003c/p\u003e \u003cp\u003e If you specify a value other than \u003ccode\u003eauto\u003c/code\u003e, Elastic Transcoder disables automatic detection of the aspect ratio. \u003c/p\u003e",
	"definitions.JobInput.properties.Container.$ref": "#/definitions/JobContainer",
	"definitions.JobInput.properties.Container.description": "\u003cp\u003eThe container type for the input file. If you want Elastic Transcoder to automatically detect the container type of the input file, specify \u003ccode\u003eauto\u003c/code\u003e. If you want to specify the container type for the input file, enter one of the following values: \u003c/p\u003e \u003cp\u003e \u003ccode\u003e3gp\u003c/code\u003e, \u003ccode\u003eaac\u003c/code\u003e, \u003ccode\u003easf\u003c/code\u003e, \u003ccode\u003eavi\u003c/code\u003e, \u003ccode\u003edivx\u003c/code\u003e, \u003ccode\u003eflv\u003c/code\u003e, \u003ccode\u003em4a\u003c/code\u003e, \u003ccode\u003emkv\u003c/code\u003e, \u003ccode\u003emov\u003c/code\u003e, \u003ccode\u003emp3\u003c/code\u003e, \u003ccode\u003emp4\u003c/code\u003e, \u003ccode\u003empeg\u003c/code\u003e, \u003ccode\u003empeg-ps\u003c/code\u003e, \u003ccode\u003empeg-ts\u003c/code\u003e, \u003ccode\u003emxf\u003c/code\u003e, \u003ccode\u003eogg\u003c/code\u003e, \u003ccode\u003evob\u003c/code\u003e, \u003ccode\u003ewav\u003c/code\u003e, \u003ccode\u003ewebm\u003c/code\u003e \u003c/p\u003e",
	"definitions.JobInput.properties.DetectedProperties.$ref": "#/definitions/DetectedProperties",
	"definitions.JobInput.properties.DetectedProperties.description": "The detected properties of the input file.",
	"definitions.JobInput.properties.Encryption.$ref": "#/definitions/Encryption",
	"definitions.JobInput.properties.Encryption.description": "The encryption settings, if any, that are used for decrypting your input files. If your input file is encrypted, you must specify the mode that Elastic Transcoder uses to decrypt your file.",
	"definitions.JobInput.properties.FrameRate.$ref": "#/definitions/FrameRate",
	"definitions.JobInput.properties.FrameRate.description": "\u003cp\u003eThe frame rate of the input file. If you want Elastic Transcoder to automatically detect the frame rate of the input file, specify \u003ccode\u003eauto\u003c/code\u003e. If you want to specify the frame rate for the input file, enter one of the following values: \u003c/p\u003e \u003cp\u003e \u003ccode\u003e10\u003c/code\u003e, \u003ccode\u003e15\u003c/code\u003e, \u003ccode\u003e23.97\u003c/code\u003e, \u003ccode\u003e24\u003c/code\u003e, \u003ccode\u003e25\u003c/code\u003e, \u003ccode\u003e29.97\u003c/code\u003e, \u003ccode\u003e30\u003c/code\u003e, \u003ccode\u003e60\u003c/code\u003e \u003c/p\u003e \u003cp\u003eIf you specify a value other than \u003ccode\u003eauto\u003c/code\u003e, Elastic Transcoder disables automatic detection of the frame rate.\u003c/p\u003e",
	"definitions.JobInput.properties.InputCaptions.$ref": "#/definitions/InputCaptions",
	"definitions.JobInput.properties.InputCaptions.description": "\u003cp\u003eYou can configure Elastic Transcoder to transcode captions, or subtitles, from one format to another. All captions must be in UTF-8. Elastic Transcoder supports two types of captions:\u003c/p\u003e \u003cul\u003e \u003cli\u003e \u003cp\u003e \u003cb\u003eEmbedded:\u003c/b\u003e Embedded captions are included in the same file as the audio and video. Elastic Transcoder supports only one embedded caption per language, to a maximum of 300 embedded captions per file.\u003c/p\u003e \u003cp\u003eValid input values include: \u003ccode\u003eCEA-608 (EIA-608\u003c/code\u003e, first non-empty channel only), \u003ccode\u003eCEA-708 (EIA-708\u003c/code\u003e, first non-empty channel only), and \u003ccode\u003emov-text\u003c/code\u003e \u003c/p\u003e \u003cp\u003eValid outputs include: \u003ccode\u003emov-text\u003c/code\u003e \u003c/p\u003e \u003cp\u003eElastic Transcoder supports a maximum of one embedded format per output.\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e \u003cb\u003eSidecar:\u003c/b\u003e Sidecar captions are kept in a separate metadata file from the audio and video data. Sidecar captions require a player that is capable of understanding the relationship between the video file and the sidecar file. Elastic Transcoder supports only one sidecar caption per language, to a maximum of 20 sidecar captions per file.\u003c/p\u003e \u003cp\u003eValid input values include: \u003ccode\u003edfxp\u003c/code\u003e (first div element only), \u003ccode\u003eebu-tt\u003c/code\u003e, \u003ccode\u003escc\u003c/code\u003e, \u003ccode\u003esmpt\u003c/code\u003e, \u003ccode\u003esrt\u003c/code\u003e, \u003ccode\u003ettml\u003c/code\u003e (first div element only), and \u003ccode\u003ewebvtt\u003c/code\u003e \u003c/p\u003e \u003cp\u003eValid outputs include: \u003ccode\u003edfxp\u003c/code\u003e (first div element only), \u003ccode\u003escc\u003c/code\u003e, \u003ccode\u003esrt\u003c/code\u003e, and \u003ccode\u003ewebvtt\u003c/code\u003e.\u003c/p\u003e \u003c/li\u003e \u003c/ul\u003e \u003cp\u003eIf you want ttml or smpte-tt compatible captions, specify dfxp as your output format.\u003c/p\u003e \u003cp\u003eElastic Transcoder does not support OCR (Optical Character Recognition), does not accept pictures as a valid input for captions, and is not available for audio-only transcoding. Elastic Transcoder does not preserve text formatting (for example, italics) during the transcoding process.\u003c/p\u003e \u003cp\u003eTo remove captions or leave the captions empty, set \u003ccode\u003eCaptions\u003c/code\u003e to null. To pass through existing captions unchanged, set the \u003ccode\u003eMergePolicy\u003c/code\u003e to \u003ccode\u003eMergeRetain\u003c/code\u003e, and pass in a null \u003ccode\u003eCaptionSources\u003c/code\u003e array.\u003c/p\u003e \u003cp\u003eFor more information on embedded files, see the Subtitles Wikipedia page.\u003c/p\u003e \u003cp\u003eFor more information on sidecar files, see the Extensible Metadata Platform and Sidecar file Wikipedia pages.\u003c/p\u003e",
	"definitions.JobInput.properties.Interlaced.$ref": "#/definitions/Interlaced",
	"definitions.JobInput.properties.Interlaced.description": "\u003cp\u003eWhether the input file is interlaced. If you want Elastic Transcoder to automatically detect whether the input file is interlaced, specify \u003ccode\u003eauto\u003c/code\u003e. If you want to specify whether the input file is interlaced, enter one of the following values:\u003c/p\u003e \u003cp\u003e \u003ccode\u003etrue\u003c/code\u003e, \u003ccode\u003efalse\u003c/code\u003e \u003c/p\u003e \u003cp\u003eIf you specify a value other than \u003ccode\u003eauto\u003c/code\u003e, Elastic Transcoder disables automatic detection of interlacing.\u003c/p\u003e",
	"definitions.JobInput.properties.Key.$ref": "#/definitions/LongKey",
	"definitions.JobInput.properties.Key.description": "\u003cp\u003e The name of the file to transcode. Elsewhere in the body of the JSON block is the the ID of the pipeline to use for processing the job. The \u003ccode\u003eInputBucket\u003c/code\u003e object in that pipeline tells Elastic Transcoder which Amazon S3 bucket to get the file from. \u003c/p\u003e \u003cp\u003eIf the file name includes a prefix, such as \u003ccode\u003ecooking/lasagna.mpg\u003c/code\u003e, include the prefix in the key. If the file isn't in the specified bucket, Elastic Transcoder returns an error.\u003c/p\u003e",
	"definitions.JobInput.properties.Resolution.$ref": "#/definitions/Resolution",
	"definitions.JobInput.properties.Resolution.description": "This value must be \u003ccode\u003eauto\u003c/code\u003e, which causes Elastic Transcoder to automatically detect the resolution of the input file.",
	"definitions.JobInput.properties.TimeSpan.$ref": "#/definitions/TimeSpan",
	"definitions.JobInput.properties.TimeSpan.description": "Settings for clipping an input. Each input can have different clip settings.",
	"definitions.JobInput.type": "object",
	"definitions.JobInputs.items.$ref": "#/definitions/JobInput",
	"definitions.JobInputs.maxItems": 10000,
	"definitions.JobInputs.type": "array",
	"definitions.JobOutput.description": "\u003cimportant\u003e \u003cp\u003eOutputs recommended instead.\u003c/p\u003e \u003c/important\u003e \u003cp\u003eIf you specified one output for a job, information about that output. If you specified multiple outputs for a job, the \u003ccode\u003eOutput\u003c/code\u003e object lists information about the first output. This duplicates the information that is listed for the first output in the \u003ccode\u003eOutputs\u003c/code\u003e object.\u003c/p\u003e",
	"definitions.JobOutput.properties.AlbumArt.$ref": "#/definitions/JobAlbumArt",
	"definitions.JobOutput.properties.AlbumArt.description": "The album art to be associated with the output file, if any.",
	"definitions.JobOutput.properties.AppliedColorSpaceConversion.$ref": "#/definitions/String",
	"definitions.JobOutput.properties.AppliedColorSpaceConversion.description": "If Elastic Transcoder used a preset with a \u003ccode\u003eColorSpaceConversionMode\u003c/code\u003e to transcode the output file, the \u003ccode\u003eAppliedColorSpaceConversion\u003c/code\u003e parameter shows the conversion used. If no \u003ccode\u003eColorSpaceConversionMode\u003c/code\u003e was defined in the preset, this parameter is not be included in the job response.",
	"definitions.JobOutput.properties.Captions.$ref": "#/definitions/Captions",
	"definitions.JobOutput.properties.Captions.description": "\u003cp\u003eYou can configure Elastic Transcoder to transcode captions, or subtitles, from one format to another. All captions must be in UTF-8. Elastic Transcoder supports two types of captions:\u003c/p\u003e \u003cul\u003e \u003cli\u003e \u003cp\u003e \u003cb\u003eEmbedded:\u003c/b\u003e Embedded captions are included in the same file as the audio and video. Elastic Transcoder supports only one embedded caption per language, to a maximum of 300 embedded captions per file.\u003c/p\u003e \u003cp\u003eValid input values include: \u003ccode\u003eCEA-608 (EIA-608\u003c/code\u003e, first non-empty channel only), \u003ccode\u003eCEA-708 (EIA-708\u003c/code\u003e, first non-empty channel only), and \u003ccode\u003emov-text\u003c/code\u003e \u003c/p\u003e \u003cp\u003eValid outputs include: \u003ccode\u003emov-text\u003c/code\u003e \u003c/p\u003e \u003cp\u003eElastic Transcoder supports a maximum of one embedded format per output.\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e \u003cb\u003eSidecar:\u003c/b\u003e Sidecar captions are kept in a separate metadata file from the audio and video data. Sidecar captions require a player that is capable of understanding the relationship between the video file and the sidecar file. Elastic Transcoder supports only one sidecar caption per language, to a maximum of 20 sidecar captions per file.\u003c/p\u003e \u003cp\u003eValid input values include: \u003ccode\u003edfxp\u003c/code\u003e (first div element only), \u003ccode\u003eebu-tt\u003c/code\u003e, \u003ccode\u003escc\u003c/code\u003e, \u003ccode\u003esmpt\u003c/code\u003e, \u003ccode\u003esrt\u003c/code\u003e, \u003ccode\u003ettml\u003c/code\u003e (first div element only), and \u003ccode\u003ewebvtt\u003c/code\u003e \u003c/p\u003e \u003cp\u003eValid outputs include: \u003ccode\u003edfxp\u003c/code\u003e (first div element only), \u003ccode\u003escc\u003c/code\u003e, \u003ccode\u003esrt\u003c/code\u003e, and \u003ccode\u003ewebvtt\u003c/code\u003e.\u003c/p\u003e \u003c/li\u003e \u003c/ul\u003e \u003cp\u003eIf you want ttml or smpte-tt compatible captions, specify dfxp as your output format.\u003c/p\u003e \u003cp\u003eElastic Transcoder does not support OCR (Optical Character Recognition), does not accept pictures as a valid input for captions, and is not available for audio-only transcoding. Elastic Transcoder does not preserve text formatting (for example, italics) during the transcoding process.\u003c/p\u003e \u003cp\u003eTo remove captions or leave the captions empty, set \u003ccode\u003eCaptions\u003c/code\u003e to null. To pass through existing captions unchanged, set the \u003ccode\u003eMergePolicy\u003c/code\u003e to \u003ccode\u003eMergeRetain\u003c/code\u003e, and pass in a null \u003ccode\u003eCaptionSources\u003c/code\u003e array.\u003c/p\u003e \u003cp\u003eFor more information on embedded files, see the Subtitles Wikipedia page.\u003c/p\u003e \u003cp\u003eFor more information on sidecar files, see the Extensible Metadata Platform and Sidecar file Wikipedia pages.\u003c/p\u003e",
	"definitions.JobOutput.properties.Composition.$ref": "#/definitions/Composition",
	"definitions.JobOutput.properties.Composition.description": "You can create an output file that contains an excerpt from the input file. This excerpt, called a clip, can come from the beginning, middle, or end of the file. The Composition object contains settings for the clips that make up an output file. For the current release, you can only specify settings for a single clip per output file. The Composition object cannot be null.",
	"definitions.JobOutput.properties.Duration.$ref": "#/definitions/NullableLong",
	"definitions.JobOutput.properties.Duration.description": "Duration of the output file, in seconds.",
	"definitions.JobOutput.properties.DurationMillis.$ref": "#/definitions/NullableLong",
	"definitions.JobOutput.properties.DurationMillis.description": "Duration of the output file, in milliseconds.",
	"definitions.JobOutput.properties.Encryption.$ref": "#/definitions/Encryption",
	"definitions.JobOutput.properties.Encryption.description": "The encryption settings, if any, that you want Elastic Transcoder to apply to your output files. If you choose to use encryption, you must specify a mode to use. If you choose not to use encryption, Elastic Transcoder writes an unencrypted file to your Amazon S3 bucket.",
	"definitions.JobOutput.properties.FileSize.$ref": "#/definitions/NullableLong",
	"definitions.JobOutput.properties.FileSize.description": "File size of the output file, in bytes.",
	"definitions.JobOutput.properties.FrameRate.$ref": "#/definitions/FloatString",
	"definitions.JobOutput.properties.FrameRate.description": "Frame rate of the output file, in frames per second.",
	"definitions.JobOutput.properties.Height.$ref": "#/definitions/NullableInteger",
	"definitions.JobOutput.properties.Height.description": "Height of the output file, in pixels.",
	"definitions.JobOutput.properties.Id.$ref": "#/definitions/String",
	"definitions.JobOutput.properties.Id.description": "A sequential counter, starting with 1, that identifies an output among the outputs from the current job. In the Output syntax, this value is always 1.",
	"definitions.JobOutput.properties.Key.$ref": "#/definitions/Key",
	"definitions.JobOutput.properties.Key.description": " The name to assign to the transcoded file. Elastic Transcoder saves the file in the Amazon S3 bucket specified by the \u003ccode\u003eOutputBucket\u003c/code\u003e object in the pipeline that is specified by the pipeline ID.",
	"definitions.JobOutput.properties.PresetId.$ref": "#/definitions/Id",
	"definitions.JobOutput.properties.PresetId.description": "The value of the \u003ccode\u003eId\u003c/code\u003e object for the preset that you want to use for this job. The preset determines the audio, video, and thumbnail settings that Elastic Transcoder uses for transcoding. To use a preset that you created, specify the preset ID that Elastic Transcoder returned in the response when you created the preset. You can also use the Elastic Transcoder system presets, which you can get with \u003ccode\u003eListPresets\u003c/code\u003e.",
	"definitions.JobOutput.properties.Rotate.$ref": "#/definitions/Rotate",
	"definitions.JobOutput.properties.Rotate.description": "\u003cp\u003eThe number of degrees clockwise by which you want Elastic Transcoder to rotate the output relative to the input. Enter one of the following values:\u003c/p\u003e \u003cp\u003e \u003ccode\u003eauto\u003c/code\u003e, \u003ccode\u003e0\u003c/code\u003e, \u003ccode\u003e90\u003c/code\u003e, \u003ccode\u003e180\u003c/code\u003e, \u003ccode\u003e270\u003c/code\u003e \u003c/p\u003e \u003cp\u003e The value \u003ccode\u003eauto\u003c/code\u003e generally works only if the file that you're transcoding contains rotation metadata.\u003c/p\u003e",
	"definitions.JobOutput.properties.SegmentDuration.$ref": "#/definitions/FloatString",
	"definitions.JobOutput.properties.SegmentDuration.description": "\u003cimportant\u003e \u003cp\u003e(Outputs in Fragmented MP4 or MPEG-TS format only.\u003c/p\u003e \u003c/important\u003e \u003cp\u003eIf you specify a preset in \u003ccode\u003ePresetId\u003c/code\u003e for which the value of \u003ccode\u003eContainer\u003c/code\u003e is \u003ccode\u003efmp4\u003c/code\u003e (Fragmented MP4) or \u003ccode\u003ets\u003c/code\u003e (MPEG-TS), \u003ccode\u003eSegmentDuration\u003c/code\u003e is the target maximum duration of each segment in seconds. For \u003ccode\u003eHLSv3\u003c/code\u003e format playlists, each media segment is stored in a separate \u003ccode\u003e.ts\u003c/code\u003e file. For \u003ccode\u003eHLSv4\u003c/code\u003e, \u003ccode\u003eMPEG-DASH\u003c/code\u003e, and \u003ccode\u003eSmooth\u003c/code\u003e playlists, all media segments for an output are stored in a single file. Each segment is approximately the length of the \u003ccode\u003eSegmentDuration\u003c/code\u003e, though individual segments might be shorter or longer.\u003c/p\u003e \u003cp\u003eThe range of valid values is 1 to 60 seconds. If the duration of the video is not evenly divisible by \u003ccode\u003eSegmentDuration\u003c/code\u003e, the duration of the last segment is the remainder of total length/SegmentDuration.\u003c/p\u003e \u003cp\u003eElastic Transcoder creates an output-specific playlist for each output \u003ccode\u003eHLS\u003c/code\u003e output that you specify in OutputKeys. To add an output to the master playlist for this job, include it in the \u003ccode\u003eOutputKeys\u003c/code\u003e of the associated playlist.\u003c/p\u003e",
	"definitions.JobOutput.properties.Status.$ref": "#/definitions/JobStatus",
	"definitions.JobOutput.properties.Status.description": "\u003cp\u003e The status of one output in a job. If you specified only one output for the job, \u003ccode\u003eOutputs:Status\u003c/code\u003e is always the same as \u003ccode\u003eJob:Status\u003c/code\u003e. If you specified more than one output: \u003c/p\u003e \u003cul\u003e \u003cli\u003e \u003cp\u003e \u003ccode\u003eJob:Status\u003c/code\u003e and \u003ccode\u003eOutputs:Status\u003c/code\u003e for all of the outputs is Submitted until Elastic Transcoder starts to process the first output.\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003eWhen Elastic Transcoder starts to process the first output, \u003ccode\u003eOutputs:Status\u003c/code\u003e for that output and \u003ccode\u003eJob:Status\u003c/code\u003e both change to Progressing. For each output, the value of \u003ccode\u003eOutputs:Status\u003c/code\u003e remains Submitted until Elastic Transcoder starts to process the output.\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003eJob:Status remains Progressing until all of the outputs reach a terminal status, either Complete or Error.\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003eWhen all of the outputs reach a terminal status, \u003ccode\u003eJob:Status\u003c/code\u003e changes to Complete only if \u003ccode\u003eOutputs:Status\u003c/code\u003e for all of the outputs is \u003ccode\u003eComplete\u003c/code\u003e. If \u003ccode\u003eOutputs:Status\u003c/code\u003e for one or more outputs is \u003ccode\u003eError\u003c/code\u003e, the terminal status for \u003ccode\u003eJob:Status\u003c/code\u003e is also \u003ccode\u003eError\u003c/code\u003e.\u003c/p\u003e \u003c/li\u003e \u003c/ul\u003e \u003cp\u003eThe value of \u003ccode\u003eStatus\u003c/code\u003e is one of the following: \u003ccode\u003eSubmitted\u003c/code\u003e, \u003ccode\u003eProgressing\u003c/code\u003e, \u003ccode\u003eComplete\u003c/code\u003e, \u003ccode\u003eCanceled\u003c/code\u003e, or \u003ccode\u003eError\u003c/code\u003e. \u003c/p\u003e",
	"definitions.JobOutput.properties.StatusDetail.$ref": "#/definitions/Description",
	"definitions.JobOutput.properties.StatusDetail.description": "Information that further explains \u003ccode\u003eStatus\u003c/code\u003e.",
	"definitions.JobOutput.properties.ThumbnailEncryption.$ref": "#/definitions/Encryption",
	"definitions.JobOutput.properties.ThumbnailEncryption.description": "The encryption settings, if any, that you want Elastic Transcoder to apply to your thumbnail.",
	"definitions.JobOutput.properties.ThumbnailPattern.$ref": "#/definitions/ThumbnailPattern",
	"definitions.JobOutput.properties.ThumbnailPattern.description": "\u003cp\u003eWhether you want Elastic Transcoder to create thumbnails for your videos and, if so, how you want Elastic Transcoder to name the files.\u003c/p\u003e \u003cp\u003eIf you don't want Elastic Transcoder to create thumbnails, specify \"\".\u003c/p\u003e \u003cp\u003eIf you do want Elastic Transcoder to create thumbnails, specify the information that you want to include in the file name for each thumbnail. You can specify the following values in any sequence:\u003c/p\u003e \u003cul\u003e \u003cli\u003e \u003cp\u003e \u003cb\u003e \u003ccode\u003e{count}\u003c/code\u003e (Required)\u003c/b\u003e: If you want to create thumbnails, you must include \u003ccode\u003e{count}\u003c/code\u003e in the \u003ccode\u003eThumbnailPattern\u003c/code\u003e object. Wherever you specify \u003ccode\u003e{count}\u003c/code\u003e, Elastic Transcoder adds a five-digit sequence number (beginning with \u003cb\u003e00001\u003c/b\u003e) to thumbnail file names. The number indicates where a given thumbnail appears in the sequence of thumbnails for a transcoded file. \u003c/p\u003e \u003cimportant\u003e \u003cp\u003eIf you specify a literal value and/or \u003ccode\u003e{resolution}\u003c/code\u003e but you omit \u003ccode\u003e{count}\u003c/code\u003e, Elastic Transcoder returns a validation error and does not create the job.\u003c/p\u003e \u003c/important\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e \u003cb\u003eLiteral values (Optional)\u003c/b\u003e: You can specify literal values anywhere in the \u003ccode\u003eThumbnailPattern\u003c/code\u003e object. For example, you can include them as a file name prefix or as a delimiter between \u003ccode\u003e{resolution}\u003c/code\u003e and \u003ccode\u003e{count}\u003c/code\u003e. \u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e \u003cb\u003e \u003ccode\u003e{resolution}\u003c/code\u003e (Optional)\u003c/b\u003e: If you want Elastic Transcoder to include the resolution in the file name, include \u003ccode\u003e{resolution}\u003c/code\u003e in the \u003ccode\u003eThumbnailPattern\u003c/code\u003e object. \u003c/p\u003e \u003c/li\u003e \u003c/ul\u003e \u003cp\u003eWhen creating thumbnails, Elastic Transcoder automatically saves the files in the format (.jpg or .png) that appears in the preset that you specified in the \u003ccode\u003ePresetID\u003c/code\u003e value of \u003ccode\u003eCreateJobOutput\u003c/code\u003e. Elastic Transcoder also appends the applicable file name extension.\u003c/p\u003e",
	"definitions.JobOutput.properties.Watermarks.$ref": "#/definitions/JobWatermarks",
	"definitions.JobOutput.properties.Watermarks.description": "\u003cp\u003eInformation about the watermarks that you want Elastic Transcoder to add to the video during transcoding. You can specify up to four watermarks for each output. Settings for each watermark must be defined in the preset that you specify in \u003ccode\u003ePreset\u003c/code\u003e for the current output.\u003c/p\u003e \u003cp\u003eWatermarks are added to the output video in the sequence in which you list them in the job outputthe first watermark in the list is added to the output video first, the second watermark in the list is added next, and so on. As a result, if the settings in a preset cause Elastic Transcoder to place all watermarks in the same location, the second watermark that you add covers the first one, the third one covers the second, and the fourth one covers the third.\u003c/p\u003e",
	"definitions.JobOutput.properties.Width.$ref": "#/definitions/NullableInteger",
	"definitions.JobOutput.properties.Width.description": "Specifies the width of the output file in pixels.",
	"definitions.JobOutput.type": "object",
	"definitions.JobOutputs.items.$ref": "#/definitions/JobOutput",
	"definitions.JobOutputs.type": "array",
	"definitions.JobStatus.pattern": "(^Submitted$)|(^Progressing$)|(^Complete$)|(^Canceled$)|(^Error$)",
	"definitions.JobStatus.type": "string",
	"definitions.JobWatermark.description": "Watermarks can be in .png or .jpg format. If you want to display a watermark that is not rectangular, use the .png format, which supports transparency.",
	"definitions.JobWatermark.properties.Encryption.$ref": "#/definitions/Encryption",
	"definitions.JobWatermark.properties.Encryption.description": "The encryption settings, if any, that you want Elastic Transcoder to apply to your watermarks.",
	"definitions.JobWatermark.properties.InputKey.$ref": "#/definitions/WatermarkKey",
	"definitions.JobWatermark.properties.InputKey.description": "\u003cp\u003e The name of the .png or .jpg file that you want to use for the watermark. To determine which Amazon S3 bucket contains the specified file, Elastic Transcoder checks the pipeline specified by \u003ccode\u003ePipeline\u003c/code\u003e; the \u003ccode\u003eInput Bucket\u003c/code\u003e object in that pipeline identifies the bucket.\u003c/p\u003e \u003cp\u003e If the file name includes a prefix, for example, \u003cb\u003elogos/128x64.png\u003c/b\u003e, include the prefix in the key. If the file isn't in the specified bucket, Elastic Transcoder returns an error. \u003c/p\u003e",
	"definitions.JobWatermark.properties.PresetWatermarkId.$ref": "#/definitions/PresetWatermarkId",
	"definitions.JobWatermark.properties.PresetWatermarkId.description": "The ID of the watermark settings that Elastic Transcoder uses to add watermarks to the video during transcoding. The settings are in the preset specified by Preset for the current output. In that preset, the value of Watermarks Id tells Elastic Transcoder which settings to use.",
	"definitions.JobWatermark.type": "object",
	"definitions.JobWatermarks.items.$ref": "#/definitions/JobWatermark",
	"definitions.JobWatermarks.type": "array",
	"definitions.Jobs.items.$ref": "#/definitions/Job",
	"definitions.Jobs.type": "array",
	"definitions.JpgOrPng.pattern": "(^jpg$)|(^png$)",
	"definitions.JpgOrPng.type": "string",
	"definitions.Key.maxLength": 255,
	"definitions.Key.minLength": 1,
	"definitions.Key.type": "string",
	"definitions.KeyArn.maxLength": 255,
	"definitions.KeyArn.minLength": 0,
	"definitions.KeyArn.type": "string",
	"definitions.KeyIdGuid.pattern": "(^[0-9A-Fa-f]{8}-[0-9A-Fa-f]{4}-[0-9A-Fa-f]{4}-[0-9A-Fa-f]{4}-[0-9A-Fa-f]{12}$)|(^[0-9A-Fa-f]{32}$)",
	"definitions.KeyIdGuid.type": "string",
	"definitions.KeyStoragePolicy.pattern": "(^NoStore$)|(^WithVariantPlaylists$)",
	"definitions.KeyStoragePolicy.type": "string",
	"definitions.KeyframesMaxDist.pattern": "^\\d{1,6}$",
	"definitions.KeyframesMaxDist.type": "string",
	"definitions.LimitExceededException.description": "Too many operations for a given AWS account. For example, the number of pipelines exceeds the maximum allowed.",
	"definitions.LimitExceededException.type": "object",
	"definitions.ListJobsByPipelineRequest.description": "The \u003ccode\u003eListJobsByPipelineRequest\u003c/code\u003e structure.",
	"definitions.ListJobsByPipelineRequest.type": "object",
	"definitions.ListJobsByPipelineResponse.description": "The \u003ccode\u003eListJobsByPipelineResponse\u003c/code\u003e structure.",
	"definitions.ListJobsByPipelineResponse.properties.Jobs.$ref": "#/definitions/Jobs",
	"definitions.ListJobsByPipelineResponse.properties.Jobs.description": "An array of \u003ccode\u003eJob\u003c/code\u003e objects that are in the specified pipeline.",
	"definitions.ListJobsByPipelineResponse.properties.NextPageToken.$ref": "#/definitions/Id",
	"definitions.ListJobsByPipelineResponse.properties.NextPageToken.description": " A value that you use to access the second and subsequent pages of results, if any. When the jobs in the specified pipeline fit on one page or when you've reached the last page of results, the value of \u003ccode\u003eNextPageToken\u003c/code\u003e is \u003ccode\u003enull\u003c/code\u003e. ",
	"definitions.ListJobsByPipelineResponse.type": "object",
	"definitions.ListJobsByStatusRequest.description": "The \u003ccode\u003eListJobsByStatusRequest\u003c/code\u003e structure.",
	"definitions.ListJobsByStatusRequest.type": "object",
	"definitions.ListJobsByStatusResponse.description": " The \u003ccode\u003eListJobsByStatusResponse\u003c/code\u003e structure. ",
	"definitions.ListJobsByStatusResponse.properties.Jobs.$ref": "#/definitions/Jobs",
	"definitions.ListJobsByStatusResponse.properties.Jobs.description": "An array of \u003ccode\u003eJob\u003c/code\u003e objects that have the specified status.",
	"definitions.ListJobsByStatusResponse.properties.NextPageToken.$ref": "#/definitions/Id",
	"definitions.ListJobsByStatusResponse.properties.NextPageToken.description": " A value that you use to access the second and subsequent pages of results, if any. When the jobs in the specified pipeline fit on one page or when you've reached the last page of results, the value of \u003ccode\u003eNextPageToken\u003c/code\u003e is \u003ccode\u003enull\u003c/code\u003e. ",
	"definitions.ListJobsByStatusResponse.type": "object",
	"definitions.ListPipelinesRequest.description": "The \u003ccode\u003eListPipelineRequest\u003c/code\u003e structure.",
	"definitions.ListPipelinesRequest.type": "object",
	"definitions.ListPipelinesResponse.description": "A list of the pipelines associated with the current AWS account.",
	"definitions.ListPipelinesResponse.properties.NextPageToken.$ref": "#/definitions/Id",
	"definitions.ListPipelinesResponse.properties.NextPageToken.description": "A value that you use to access the second and subsequent pages of results, if any. When the pipelines fit on one page or when you've reached the last page of results, the value of \u003ccode\u003eNextPageToken\u003c/code\u003e is \u003ccode\u003enull\u003c/code\u003e.",
	"definitions.ListPipelinesResponse.properties.Pipelines.$ref": "#/definitions/Pipelines",
	"definitions.ListPipelinesResponse.properties.Pipelines.description": "An array of \u003ccode\u003ePipeline\u003c/code\u003e objects.",
	"definitions.ListPipelinesResponse.type": "object",
	"definitions.ListPresetsRequest.description": "The \u003ccode\u003eListPresetsRequest\u003c/code\u003e structure.",
	"definitions.ListPresetsRequest.type": "object",
	"definitions.ListPresetsResponse.description": "The \u003ccode\u003eListPresetsResponse\u003c/code\u003e structure.",
	"definitions.ListPresetsResponse.properties.NextPageToken.$ref": "#/definitions/Id",
	"definitions.ListPresetsResponse.properties.NextPageToken.description": "A value that you use to access the second and subsequent pages of results, if any. When the presets fit on one page or when you've reached the last page of results, the value of \u003ccode\u003eNextPageToken\u003c/code\u003e is \u003ccode\u003enull\u003c/code\u003e.",
	"definitions.ListPresetsResponse.properties.Presets.$ref": "#/definitions/Presets",
	"definitions.ListPresetsResponse.properties.Presets.description": "An array of \u003ccode\u003ePreset\u003c/code\u003e objects.",
	"definitions.ListPresetsResponse.type": "object",
	"definitions.LongKey.maxLength": 1024,
	"definitions.LongKey.minLength": 1,
	"definitions.LongKey.type": "string",
	"definitions.MaxFrameRate.pattern": "(^10$)|(^15$)|(^23.97$)|(^24$)|(^25$)|(^29.97$)|(^30$)|(^50$)|(^60$)",
	"definitions.MaxFrameRate.type": "string",
	"definitions.MergePolicy.pattern": "(^Replace$)|(^Prepend$)|(^Append$)|(^Fallback$)",
	"definitions.MergePolicy.type": "string",
	"definitions.Name.maxLength": 40,
	"definitions.Name.minLength": 1,
	"definitions.Name.type": "string",
	"definitions.NonEmptyBase64EncodedString.pattern": "(^(?:[A-Za-z0-9\\+/]{4})*(?:[A-Za-z0-9\\+/]{2}==|[A-Za-z0-9\\+/]{3}=)?$)",
	"definitions.NonEmptyBase64EncodedString.type": "string",
	"definitions.Notifications.description": "\u003cp\u003eThe Amazon Simple Notification Service (Amazon SNS) topic or topics to notify in order to report job status.\u003c/p\u003e \u003cimportant\u003e \u003cp\u003eTo receive notifications, you must also subscribe to the new topic in the Amazon SNS console.\u003c/p\u003e \u003c/important\u003e",
	"definitions.Notifications.properties.Completed.$ref": "#/definitions/SnsTopic",
	"definitions.Notifications.properties.Completed.description": "The Amazon SNS topic that you want to notify when Elastic Transcoder has finished processing the job.",
	"definitions.Notifications.properties.Error.$ref": "#/definitions/SnsTopic",
	"definitions.Notifications.properties.Error.description": "The Amazon SNS topic that you want to notify when Elastic Transcoder encounters an error condition.",
	"definitions.Notifications.properties.Progressing.$ref": "#/definitions/SnsTopic",
	"definitions.Notifications.properties.Progressing.description": "The Amazon Simple Notification Service (Amazon SNS) topic that you want to notify when Elastic Transcoder has started to process the job.",
	"definitions.Notifications.properties.Warning.$ref": "#/definitions/SnsTopic",
	"definitions.Notifications.properties.Warning.description": "The Amazon SNS topic that you want to notify when Elastic Transcoder encounters a warning condition.",
	"definitions.Notifications.type": "object",
	"definitions.NullableInteger.type": "integer",
	"definitions.NullableLong.type": "integer",
	"definitions.OneTo512String.maxLength": 512,
	"definitions.OneTo512String.minLength": 1,
	"definitions.OneTo512String.type": "string",
	"definitions.Opacity.pattern": "^\\d{1,3}(\\.\\d{0,20})?$",
	"definitions.Opacity.type": "string",
	"definitions.OutputKeys.items.$ref": "#/definitions/Key",
	"definitions.OutputKeys.maxItems": 30,
	"definitions.OutputKeys.type": "array",
	"definitions.PaddingPolicy.pattern": "(^Pad$)|(^NoPad$)",
	"definitions.PaddingPolicy.type": "string",
	"definitions.Permission.description": "The \u003ccode\u003ePermission\u003c/code\u003e structure.",
	"definitions.Permission.properties.Access.$ref": "#/definitions/AccessControls",
	"definitions.Permission.properties.Access.description": "\u003cp\u003e The permission that you want to give to the AWS user that is listed in Grantee. Valid values include: \u003c/p\u003e \u003cul\u003e \u003cli\u003e \u003cp\u003e \u003ccode\u003eREAD\u003c/code\u003e: The grantee can read the thumbnails and metadata for thumbnails that Elastic Transcoder adds to the Amazon S3 bucket.\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e \u003ccode\u003eREAD_ACP\u003c/code\u003e: The grantee can read the object ACL for thumbnails that Elastic Transcoder adds to the Amazon S3 bucket.\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e \u003ccode\u003eWRITE_ACP\u003c/code\u003e: The grantee can write the ACL for the thumbnails that Elastic Transcoder adds to the Amazon S3 bucket.\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e \u003ccode\u003eFULL_CONTROL\u003c/code\u003e: The grantee has READ, READ_ACP, and WRITE_ACP permissions for the thumbnails that Elastic Transcoder adds to the Amazon S3 bucket.\u003c/p\u003e \u003c/li\u003e \u003c/ul\u003e",
	"definitions.Permission.properties.Grantee.$ref": "#/definitions/Grantee",
	"definitions.Permission.properties.Grantee.description": "The AWS user or group that you want to have access to transcoded files and playlists. To identify the user or group, you can specify the canonical user ID for an AWS account, an origin access identity for a CloudFront distribution, the registered email address of an AWS account, or a predefined Amazon S3 group.",
	"definitions.Permission.properties.GranteeType.$ref": "#/definitions/GranteeType",
	"definitions.Permission.properties.GranteeType.description": "\u003cp\u003eThe type of value that appears in the Grantee object:\u003c/p\u003e \u003cul\u003e \u003cli\u003e \u003cp\u003e \u003ccode\u003eCanonical\u003c/code\u003e: Either the canonical user ID for an AWS account or an origin access identity for an Amazon CloudFront distribution.\u003c/p\u003e \u003cimportant\u003e \u003cp\u003eA canonical user ID is not the same as an AWS account number.\u003c/p\u003e \u003c/important\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e \u003ccode\u003eEmail\u003c/code\u003e: The registered email address of an AWS account.\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e \u003ccode\u003eGroup\u003c/code\u003e: One of the following predefined Amazon S3 groups: \u003ccode\u003eAllUsers\u003c/code\u003e, \u003ccode\u003eAuthenticatedUsers\u003c/code\u003e, or \u003ccode\u003eLogDelivery\u003c/code\u003e.\u003c/p\u003e \u003c/li\u003e \u003c/ul\u003e",
	"definitions.Permission.type": "object",
	"definitions.Permissions.items.$ref": "#/definitions/Permission",
	"definitions.Permissions.maxItems": 30,
	"definitions.Permissions.type": "array",
	"definitions.Pipeline.description": "The pipeline (queue) that is used to manage jobs.",
	"definitions.Pipeline.properties.Arn.$ref": "#/definitions/String",
	"definitions.Pipeline.properties.Arn.description": "The Amazon Resource Name (ARN) for the pipeline.",
	"definitions.Pipeline.properties.AwsKmsKeyArn.$ref": "#/definitions/KeyArn",
	"definitions.Pipeline.properties.AwsKmsKeyArn.description": "\u003cp\u003eThe AWS Key Management Service (AWS KMS) key that you want to use with this pipeline.\u003c/p\u003e \u003cp\u003eIf you use either \u003ccode\u003eS3\u003c/code\u003e or \u003ccode\u003eS3-AWS-KMS\u003c/code\u003e as your \u003ccode\u003eEncryption:Mode\u003c/code\u003e, you don't need to provide a key with your job because a default key, known as an AWS-KMS key, is created for you automatically. You need to provide an AWS-KMS key only if you want to use a non-default AWS-KMS key, or if you are using an \u003ccode\u003eEncryption:Mode\u003c/code\u003e of \u003ccode\u003eAES-PKCS7\u003c/code\u003e, \u003ccode\u003eAES-CTR\u003c/code\u003e, or \u003ccode\u003eAES-GCM\u003c/code\u003e.\u003c/p\u003e",
	"definitions.Pipeline.properties.ContentConfig.$ref": "#/definitions/PipelineOutputConfig",
	"definitions.Pipeline.properties.ContentConfig.description": "\u003cp\u003eInformation about the Amazon S3 bucket in which you want Elastic Transcoder to save transcoded files and playlists. Either you specify both \u003ccode\u003eContentConfig\u003c/code\u003e and \u003ccode\u003eThumbnailConfig\u003c/code\u003e, or you specify \u003ccode\u003eOutputBucket\u003c/code\u003e.\u003c/p\u003e \u003cul\u003e \u003cli\u003e \u003cp\u003e \u003cb\u003eBucket\u003c/b\u003e: The Amazon S3 bucket in which you want Elastic Transcoder to save transcoded files and playlists.\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e \u003cb\u003ePermissions\u003c/b\u003e: A list of the users and/or predefined Amazon S3 groups you want to have access to transcoded files and playlists, and the type of access that you want them to have. \u003c/p\u003e \u003cul\u003e \u003cli\u003e \u003cp\u003eGranteeType: The type of value that appears in the \u003ccode\u003eGrantee\u003c/code\u003e object: \u003c/p\u003e \u003cul\u003e \u003cli\u003e \u003cp\u003e \u003ccode\u003eCanonical\u003c/code\u003e: Either the canonical user ID for an AWS account or an origin access identity for an Amazon CloudFront distribution.\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e \u003ccode\u003eEmail\u003c/code\u003e: The registered email address of an AWS account.\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e \u003ccode\u003eGroup\u003c/code\u003e: One of the following predefined Amazon S3 groups: \u003ccode\u003eAllUsers\u003c/code\u003e, \u003ccode\u003eAuthenticatedUsers\u003c/code\u003e, or \u003ccode\u003eLogDelivery\u003c/code\u003e.\u003c/p\u003e \u003c/li\u003e \u003c/ul\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e \u003ccode\u003eGrantee\u003c/code\u003e: The AWS user or group that you want to have access to transcoded files and playlists.\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e \u003ccode\u003eAccess\u003c/code\u003e: The permission that you want to give to the AWS user that is listed in \u003ccode\u003eGrantee\u003c/code\u003e. Valid values include:\u003c/p\u003e \u003cul\u003e \u003cli\u003e \u003cp\u003e \u003ccode\u003eREAD\u003c/code\u003e: The grantee can read the objects and metadata for objects that Elastic Transcoder adds to the Amazon S3 bucket.\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e \u003ccode\u003eREAD_ACP\u003c/code\u003e: The grantee can read the object ACL for objects that Elastic Transcoder adds to the Amazon S3 bucket.\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e \u003ccode\u003eWRITE_ACP\u003c/code\u003e: The grantee can write the ACL for the objects that Elastic Transcoder adds to the Amazon S3 bucket.\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e \u003ccode\u003eFULL_CONTROL\u003c/code\u003e: The grantee has \u003ccode\u003eREAD\u003c/code\u003e, \u003ccode\u003eREAD_ACP\u003c/code\u003e, and \u003ccode\u003eWRITE_ACP\u003c/code\u003e permissions for the objects that Elastic Transcoder adds to the Amazon S3 bucket.\u003c/p\u003e \u003c/li\u003e \u003c/ul\u003e \u003c/li\u003e \u003c/ul\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e \u003cb\u003eStorageClass\u003c/b\u003e: The Amazon S3 storage class, Standard or ReducedRedundancy, that you want Elastic Transcoder to assign to the video files and playlists that it stores in your Amazon S3 bucket. \u003c/p\u003e \u003c/li\u003e \u003c/ul\u003e",
	"definitions.Pipeline.properties.Id.$ref": "#/definitions/Id",
	"definitions.Pipeline.properties.Id.description": "The identifier for the pipeline. You use this value to identify the pipeline in which you want to perform a variety of operations, such as creating a job or a preset.",
	"definitions.Pipeline.properties.InputBucket.$ref": "#/definitions/BucketName",
	"definitions.Pipeline.properties.InputBucket.description": "The Amazon S3 bucket from which Elastic Transcoder gets media files for transcoding and the graphics files, if any, that you want to use for watermarks.",
	"definitions.Pipeline.properties.Name.$ref": "#/definitions/Name",
	"definitions.Pipeline.properties.Name.description": "\u003cp\u003eThe name of the pipeline. We recommend that the name be unique within the AWS account, but uniqueness is not enforced.\u003c/p\u003e \u003cp\u003eConstraints: Maximum 40 characters\u003c/p\u003e",
	"definitions.Pipeline.properties.Notifications.$ref": "#/definitions/Notifications",
	"definitions.Pipeline.properties.Notifications.description": "\u003cp\u003eThe Amazon Simple Notification Service (Amazon SNS) topic that you want to notify to report job status.\u003c/p\u003e \u003cimportant\u003e \u003cp\u003eTo receive notifications, you must also subscribe to the new topic in the Amazon SNS console.\u003c/p\u003e \u003c/important\u003e \u003cul\u003e \u003cli\u003e \u003cp\u003e \u003cb\u003eProgressing\u003c/b\u003e (optional): The Amazon Simple Notification Service (Amazon SNS) topic that you want to notify when Elastic Transcoder has started to process the job.\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e \u003cb\u003eCompleted\u003c/b\u003e (optional): The Amazon SNS topic that you want to notify when Elastic Transcoder has finished processing the job.\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e \u003cb\u003eWarning\u003c/b\u003e (optional): The Amazon SNS topic that you want to notify when Elastic Transcoder encounters a warning condition.\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e \u003cb\u003eError\u003c/b\u003e (optional): The Amazon SNS topic that you want to notify when Elastic Transcoder encounters an error condition.\u003c/p\u003e \u003c/li\u003e \u003c/ul\u003e",
	"definitions.Pipeline.properties.OutputBucket.$ref": "#/definitions/BucketName",
	"definitions.Pipeline.properties.OutputBucket.description": "The Amazon S3 bucket in which you want Elastic Transcoder to save transcoded files, thumbnails, and playlists. Either you specify this value, or you specify both \u003ccode\u003eContentConfig\u003c/code\u003e and \u003ccode\u003eThumbnailConfig\u003c/code\u003e.",
	"definitions.Pipeline.properties.Role.$ref": "#/definitions/Role",
	"definitions.Pipeline.properties.Role.description": "The IAM Amazon Resource Name (ARN) for the role that Elastic Transcoder uses to transcode jobs for this pipeline.",
	"definitions.Pipeline.properties.Status.$ref": "#/definitions/PipelineStatus",
	"definitions.Pipeline.properties.Status.description": "\u003cp\u003eThe current status of the pipeline:\u003c/p\u003e \u003cul\u003e \u003cli\u003e \u003cp\u003e \u003ccode\u003eActive\u003c/code\u003e: The pipeline is processing jobs.\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e \u003ccode\u003ePaused\u003c/code\u003e: The pipeline is not currently processing jobs.\u003c/p\u003e \u003c/li\u003e \u003c/ul\u003e",
	"definitions.Pipeline.properties.ThumbnailConfig.$ref": "#/definitions/PipelineOutputConfig",
	"definitions.Pipeline.properties.ThumbnailConfig.description": "\u003cp\u003eInformation about the Amazon S3 bucket in which you want Elastic Transcoder to save thumbnail files. Either you specify both \u003ccode\u003eContentConfig\u003c/code\u003e and \u003ccode\u003eThumbnailConfig\u003c/code\u003e, or you specify \u003ccode\u003eOutputBucket\u003c/code\u003e.\u003c/p\u003e \u003cul\u003e \u003cli\u003e \u003cp\u003e \u003ccode\u003eBucket\u003c/code\u003e: The Amazon S3 bucket in which you want Elastic Transcoder to save thumbnail files. \u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e \u003ccode\u003ePermissions\u003c/code\u003e: A list of the users and/or predefined Amazon S3 groups you want to have access to thumbnail files, and the type of access that you want them to have. \u003c/p\u003e \u003cul\u003e \u003cli\u003e \u003cp\u003eGranteeType: The type of value that appears in the Grantee object:\u003c/p\u003e \u003cul\u003e \u003cli\u003e \u003cp\u003e \u003ccode\u003eCanonical\u003c/code\u003e: Either the canonical user ID for an AWS account or an origin access identity for an Amazon CloudFront distribution.\u003c/p\u003e \u003cimportant\u003e \u003cp\u003eA canonical user ID is not the same as an AWS account number.\u003c/p\u003e \u003c/important\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e \u003ccode\u003eEmail\u003c/code\u003e: The registered email address of an AWS account.\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e \u003ccode\u003eGroup\u003c/code\u003e: One of the following predefined Amazon S3 groups: \u003ccode\u003eAllUsers\u003c/code\u003e, \u003ccode\u003eAuthenticatedUsers\u003c/code\u003e, or \u003ccode\u003eLogDelivery\u003c/code\u003e.\u003c/p\u003e \u003c/li\u003e \u003c/ul\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e \u003ccode\u003eGrantee\u003c/code\u003e: The AWS user or group that you want to have access to thumbnail files.\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003eAccess: The permission that you want to give to the AWS user that is listed in Grantee. Valid values include: \u003c/p\u003e \u003cul\u003e \u003cli\u003e \u003cp\u003e \u003ccode\u003eREAD\u003c/code\u003e: The grantee can read the thumbnails and metadata for thumbnails that Elastic Transcoder adds to the Amazon S3 bucket.\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e \u003ccode\u003eREAD_ACP\u003c/code\u003e: The grantee can read the object ACL for thumbnails that Elastic Transcoder adds to the Amazon S3 bucket.\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e \u003ccode\u003eWRITE_ACP\u003c/code\u003e: The grantee can write the ACL for the thumbnails that Elastic Transcoder adds to the Amazon S3 bucket.\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e \u003ccode\u003eFULL_CONTROL\u003c/code\u003e: The grantee has READ, READ_ACP, and WRITE_ACP permissions for the thumbnails that Elastic Transcoder adds to the Amazon S3 bucket.\u003c/p\u003e \u003c/li\u003e \u003c/ul\u003e \u003c/li\u003e \u003c/ul\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e \u003ccode\u003eStorageClass\u003c/code\u003e: The Amazon S3 storage class, \u003ccode\u003eStandard\u003c/code\u003e or \u003ccode\u003eReducedRedundancy\u003c/code\u003e, that you want Elastic Transcoder to assign to the thumbnails that it stores in your Amazon S3 bucket.\u003c/p\u003e \u003c/li\u003e \u003c/ul\u003e",
	"definitions.Pipeline.type": "object",
	"definitions.PipelineOutputConfig.description": "The \u003ccode\u003ePipelineOutputConfig\u003c/code\u003e structure.",
	"definitions.PipelineOutputConfig.properties.Bucket.$ref": "#/definitions/BucketName",
	"definitions.PipelineOutputConfig.properties.Bucket.description": "\u003cp\u003e The Amazon S3 bucket in which you want Elastic Transcoder to save the transcoded files. Specify this value when all of the following are true:\u003c/p\u003e \u003cul\u003e \u003cli\u003e \u003cp\u003eYou want to save transcoded files, thumbnails (if any), and playlists (if any) together in one bucket.\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003eYou do not want to specify the users or groups who have access to the transcoded files, thumbnails, and playlists.\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003eYou do not want to specify the permissions that Elastic Transcoder grants to the files.\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003eYou want to associate the transcoded files and thumbnails with the Amazon S3 Standard storage class.\u003c/p\u003e \u003c/li\u003e \u003c/ul\u003e \u003cp\u003eIf you want to save transcoded files and playlists in one bucket and thumbnails in another bucket, specify which users can access the transcoded files or the permissions the users have, or change the Amazon S3 storage class, omit OutputBucket and specify values for \u003ccode\u003eContentConfig\u003c/code\u003e and \u003ccode\u003eThumbnailConfig\u003c/code\u003e instead. \u003c/p\u003e",
	"definitions.PipelineOutputConfig.properties.Permissions.$ref": "#/definitions/Permissions",
	"definitions.PipelineOutputConfig.properties.Permissions.description": "\u003cp\u003eOptional. The \u003ccode\u003ePermissions\u003c/code\u003e object specifies which users and/or predefined Amazon S3 groups you want to have access to transcoded files and playlists, and the type of access you want them to have. You can grant permissions to a maximum of 30 users and/or predefined Amazon S3 groups.\u003c/p\u003e \u003cp\u003eIf you include \u003ccode\u003ePermissions\u003c/code\u003e, Elastic Transcoder grants only the permissions that you specify. It does not grant full permissions to the owner of the role specified by \u003ccode\u003eRole\u003c/code\u003e. If you want that user to have full control, you must explicitly grant full control to the user.\u003c/p\u003e \u003cp\u003e If you omit \u003ccode\u003ePermissions\u003c/code\u003e, Elastic Transcoder grants full control over the transcoded files and playlists to the owner of the role specified by \u003ccode\u003eRole\u003c/code\u003e, and grants no other permissions to any other user or group.\u003c/p\u003e",
	"definitions.PipelineOutputConfig.properties.StorageClass.$ref": "#/definitions/StorageClass",
	"definitions.PipelineOutputConfig.properties.StorageClass.description": " The Amazon S3 storage class, \u003ccode\u003eStandard\u003c/code\u003e or \u003ccode\u003eReducedRedundancy\u003c/code\u003e, that you want Elastic Transcoder to assign to the video files and playlists that it stores in your Amazon S3 bucket. ",
	"definitions.PipelineOutputConfig.type": "object",
	"definitions.PipelineStatus.pattern": "(^Active$)|(^Paused$)",
	"definitions.PipelineStatus.type": "string",
	"definitions.Pipelines.items.$ref": "#/definitions/Pipeline",
	"definitions.Pipelines.type": "array",
	"definitions.PixelsOrPercent.pattern": "(^\\d{1,3}(\\.\\d{0,5})?%$)|(^\\d{1,4}?px$)",
	"definitions.PixelsOrPercent.type": "string",
	"definitions.PlayReadyDrm.description": "\u003cp\u003eThe PlayReady DRM settings, if any, that you want Elastic Transcoder to apply to the output files associated with this playlist.\u003c/p\u003e \u003cp\u003ePlayReady DRM encrypts your media files using \u003ccode\u003eAES-CTR\u003c/code\u003e encryption.\u003c/p\u003e \u003cp\u003eIf you use DRM for an \u003ccode\u003eHLSv3\u003c/code\u003e playlist, your outputs must have a master playlist.\u003c/p\u003e",
	"definitions.PlayReadyDrm.properties.Format.$ref": "#/definitions/PlayReadyDrmFormatString",
	"definitions.PlayReadyDrm.properties.Format.description": "The type of DRM, if any, that you want Elastic Transcoder to apply to the output files associated with this playlist.",
	"definitions.PlayReadyDrm.properties.InitializationVector.$ref": "#/definitions/ZeroTo255String",
	"definitions.PlayReadyDrm.properties.InitializationVector.description": "The series of random bits created by a random bit generator, unique for every encryption operation, that you want Elastic Transcoder to use to encrypt your files. The initialization vector must be base64-encoded, and it must be exactly 8 bytes long before being base64-encoded. If no initialization vector is provided, Elastic Transcoder generates one for you.",
	"definitions.PlayReadyDrm.properties.Key.$ref": "#/definitions/NonEmptyBase64EncodedString",
	"definitions.PlayReadyDrm.properties.Key.description": "\u003cp\u003eThe DRM key for your file, provided by your DRM license provider. The key must be base64-encoded, and it must be one of the following bit lengths before being base64-encoded:\u003c/p\u003e \u003cp\u003e \u003ccode\u003e128\u003c/code\u003e, \u003ccode\u003e192\u003c/code\u003e, or \u003ccode\u003e256\u003c/code\u003e. \u003c/p\u003e \u003cp\u003eThe key must also be encrypted by using AWS KMS.\u003c/p\u003e",
	"definitions.PlayReadyDrm.properties.KeyId.$ref": "#/definitions/KeyIdGuid",
	"definitions.PlayReadyDrm.properties.KeyId.description": "\u003cp\u003eThe ID for your DRM key, so that your DRM license provider knows which key to provide.\u003c/p\u003e \u003cp\u003eThe key ID must be provided in big endian, and Elastic Transcoder converts it to little endian before inserting it into the PlayReady DRM headers. If you are unsure whether your license server provides your key ID in big or little endian, check with your DRM provider.\u003c/p\u003e",
	"definitions.PlayReadyDrm.properties.KeyMd5.$ref": "#/definitions/NonEmptyBase64EncodedString",
	"definitions.PlayReadyDrm.properties.KeyMd5.description": "The MD5 digest of the key used for DRM on your file, and that you want Elastic Transcoder to use as a checksum to make sure your key was not corrupted in transit. The key MD5 must be base64-encoded, and it must be exactly 16 bytes before being base64-encoded.",
	"definitions.PlayReadyDrm.properties.LicenseAcquisitionUrl.$ref": "#/definitions/OneTo512String",
	"definitions.PlayReadyDrm.properties.LicenseAcquisitionUrl.description": "The location of the license key required to play DRM content. The URL must be an absolute path, and is referenced by the PlayReady header. The PlayReady header is referenced in the protection header of the client manifest for Smooth Streaming outputs, and in the EXT-X-DXDRM and EXT-XDXDRMINFO metadata tags for HLS playlist outputs. An example URL looks like this: \u003ccode\u003ehttps://www.example.com/exampleKey/\u003c/code\u003e ",
	"definitions.PlayReadyDrm.type": "object",
	"definitions.PlayReadyDrmFormatString.pattern": "(^microsoft$)|(^discretix-3.0$)",
	"definitions.PlayReadyDrmFormatString.type": "string",
	"definitions.Playlist.description": " Use Only for Fragmented MP4 or MPEG-TS Outputs. If you specify a preset for which the value of Container is \u003ccode\u003efmp4\u003c/code\u003e (Fragmented MP4) or \u003ccode\u003ets\u003c/code\u003e (MPEG-TS), Playlists contains information about the master playlists that you want Elastic Transcoder to create. We recommend that you create only one master playlist per output format. The maximum number of master playlists in a job is 30. ",
	"definitions.Playlist.properties.Format.$ref": "#/definitions/PlaylistFormat",
	"definitions.Playlist.properties.Format.description": "The format of the output playlist. Valid formats include \u003ccode\u003eHLSv3\u003c/code\u003e, \u003ccode\u003eHLSv4\u003c/code\u003e, and \u003ccode\u003eSmooth\u003c/code\u003e.",
	"definitions.Playlist.properties.HlsContentProtection.$ref": "#/definitions/HlsContentProtection",
	"definitions.Playlist.properties.HlsContentProtection.description": "The HLS content protection settings, if any, that you want Elastic Transcoder to apply to the output files associated with this playlist.",
	"definitions.Playlist.properties.Name.$ref": "#/definitions/Filename",
	"definitions.Playlist.properties.Name.description": "\u003cp\u003eThe name that you want Elastic Transcoder to assign to the master playlist, for example, nyc-vacation.m3u8. If the name includes a \u003ccode\u003e/\u003c/code\u003e character, the section of the name before the last \u003ccode\u003e/\u003c/code\u003e must be identical for all \u003ccode\u003eName\u003c/code\u003e objects. If you create more than one master playlist, the values of all \u003ccode\u003eName\u003c/code\u003e objects must be unique.\u003c/p\u003e \u003cnote\u003e \u003cp\u003eElastic Transcoder automatically appends the relevant file extension to the file name (\u003ccode\u003e.m3u8\u003c/code\u003e for \u003ccode\u003eHLSv3\u003c/code\u003e and \u003ccode\u003eHLSv4\u003c/code\u003e playlists, and \u003ccode\u003e.ism\u003c/code\u003e and \u003ccode\u003e.ismc\u003c/code\u003e for \u003ccode\u003eSmooth\u003c/code\u003e playlists). If you include a file extension in \u003ccode\u003eName\u003c/code\u003e, the file name will have two extensions.\u003c/p\u003e \u003c/note\u003e",
	"definitions.Playlist.properties.OutputKeys.$ref": "#/definitions/OutputKeys",
	"definitions.Playlist.properties.OutputKeys.description": "\u003cp\u003eFor each output in this job that you want to include in a master playlist, the value of the Outputs:Key object.\u003c/p\u003e \u003cul\u003e \u003cli\u003e \u003cp\u003eIf your output is not \u003ccode\u003eHLS\u003c/code\u003e or does not have a segment duration set, the name of the output file is a concatenation of \u003ccode\u003eOutputKeyPrefix\u003c/code\u003e and \u003ccode\u003eOutputs:Key\u003c/code\u003e:\u003c/p\u003e \u003cp\u003eOutputKeyPrefix\u003ccode\u003eOutputs:Key\u003c/code\u003e \u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003eIf your output is \u003ccode\u003eHLSv3\u003c/code\u003e and has a segment duration set, or is not included in a playlist, Elastic Transcoder creates an output playlist file with a file extension of \u003ccode\u003e.m3u8\u003c/code\u003e, and a series of \u003ccode\u003e.ts\u003c/code\u003e files that include a five-digit sequential counter beginning with 00000:\u003c/p\u003e \u003cp\u003eOutputKeyPrefix\u003ccode\u003eOutputs:Key\u003c/code\u003e.m3u8\u003c/p\u003e \u003cp\u003eOutputKeyPrefix\u003ccode\u003eOutputs:Key\u003c/code\u003e00000.ts\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003eIf your output is \u003ccode\u003eHLSv4\u003c/code\u003e, has a segment duration set, and is included in an \u003ccode\u003eHLSv4\u003c/code\u003e playlist, Elastic Transcoder creates an output playlist file with a file extension of \u003ccode\u003e_v4.m3u8\u003c/code\u003e. If the output is video, Elastic Transcoder also creates an output file with an extension of \u003ccode\u003e_iframe.m3u8\u003c/code\u003e:\u003c/p\u003e \u003cp\u003eOutputKeyPrefix\u003ccode\u003eOutputs:Key\u003c/code\u003e_v4.m3u8\u003c/p\u003e \u003cp\u003eOutputKeyPrefix\u003ccode\u003eOutputs:Key\u003c/code\u003e_iframe.m3u8\u003c/p\u003e \u003cp\u003eOutputKeyPrefix\u003ccode\u003eOutputs:Key\u003c/code\u003e.ts\u003c/p\u003e \u003c/li\u003e \u003c/ul\u003e \u003cp\u003eElastic Transcoder automatically appends the relevant file extension to the file name. If you include a file extension in Output Key, the file name will have two extensions.\u003c/p\u003e \u003cp\u003eIf you include more than one output in a playlist, any segment duration settings, clip settings, or caption settings must be the same for all outputs in the playlist. For \u003ccode\u003eSmooth\u003c/code\u003e playlists, the \u003ccode\u003eAudio:Profile\u003c/code\u003e, \u003ccode\u003eVideo:Profile\u003c/code\u003e, and \u003ccode\u003eVideo:FrameRate\u003c/code\u003e to \u003ccode\u003eVideo:KeyframesMaxDist\u003c/code\u003e ratio must be the same for all outputs.\u003c/p\u003e",
	"definitions.Playlist.properties.PlayReadyDrm.$ref": "#/definitions/PlayReadyDrm",
	"definitions.Playlist.properties.PlayReadyDrm.description": "The DRM settings, if any, that you want Elastic Transcoder to apply to the output files associated with this playlist.",
	"definitions.Playlist.properties.Status.$ref": "#/definitions/JobStatus",
	"definitions.Playlist.properties.Status.description": "The status of the job with which the playlist is associated.",
	"definitions.Playlist.properties.StatusDetail.$ref": "#/definitions/Description",
	"definitions.Playlist.properties.StatusDetail.description": "Information that further explains the status.",
	"definitions.Playlist.type": "object",
	"definitions.PlaylistFormat.pattern": "(^HLSv3$)|(^HLSv4$)|(^Smooth$)|(^MPEG-DASH$)",
	"definitions.PlaylistFormat.type": "string",
	"definitions.Playlists.items.$ref": "#/definitions/Playlist",
	"definitions.Playlists.type": "array",
	"definitions.Preset.description": "Presets are templates that contain most of the settings for transcoding media files from one format to another. Elastic Transcoder includes some default presets for common formats, for example, several iPod and iPhone versions. You can also create your own presets for formats that aren't included among the default presets. You specify which preset you want to use when you create a job.",
	"definitions.Preset.properties.Arn.$ref": "#/definitions/String",
	"definitions.Preset.properties.Arn.description": "The Amazon Resource Name (ARN) for the preset.",
	"definitions.Preset.properties.Audio.$ref": "#/definitions/AudioParameters",
	"definitions.Preset.properties.Audio.description": "A section of the response body that provides information about the audio preset values.",
	"definitions.Preset.properties.Container.$ref": "#/definitions/PresetContainer",
	"definitions.Preset.properties.Container.description": "The container type for the output file. Valid values include \u003ccode\u003eflac\u003c/code\u003e, \u003ccode\u003eflv\u003c/code\u003e, \u003ccode\u003efmp4\u003c/code\u003e, \u003ccode\u003egif\u003c/code\u003e, \u003ccode\u003emp3\u003c/code\u003e, \u003ccode\u003emp4\u003c/code\u003e, \u003ccode\u003empg\u003c/code\u003e, \u003ccode\u003emxf\u003c/code\u003e, \u003ccode\u003eoga\u003c/code\u003e, \u003ccode\u003eogg\u003c/code\u003e, \u003ccode\u003ets\u003c/code\u003e, and \u003ccode\u003ewebm\u003c/code\u003e.",
	"definitions.Preset.properties.Description.$ref": "#/definitions/Description",
	"definitions.Preset.properties.Description.description": "A description of the preset.",
	"definitions.Preset.properties.Id.$ref": "#/definitions/Id",
	"definitions.Preset.properties.Id.description": "Identifier for the new preset. You use this value to get settings for the preset or to delete it.",
	"definitions.Preset.properties.Name.$ref": "#/definitions/Name",
	"definitions.Preset.properties.Name.description": "The name of the preset.",
	"definitions.Preset.properties.Thumbnails.$ref": "#/definitions/Thumbnails",
	"definitions.Preset.properties.Thumbnails.description": "A section of the response body that provides information about the thumbnail preset values, if any.",
	"definitions.Preset.properties.Type.$ref": "#/definitions/PresetType",
	"definitions.Preset.properties.Type.description": "Whether the preset is a default preset provided by Elastic Transcoder (\u003ccode\u003eSystem\u003c/code\u003e) or a preset that you have defined (\u003ccode\u003eCustom\u003c/code\u003e).",
	"definitions.Preset.properties.Video.$ref": "#/definitions/VideoParameters",
	"definitions.Preset.properties.Video.description": "A section of the response body that provides information about the video preset values.",
	"definitions.Preset.type": "object",
	"definitions.PresetContainer.pattern": "(^mp4$)|(^ts$)|(^webm$)|(^mp3$)|(^flac$)|(^oga$)|(^ogg$)|(^fmp4$)|(^mpg$)|(^flv$)|(^gif$)|(^mxf$)|(^wav$)",
	"definitions.PresetContainer.type": "string",
	"definitions.PresetType.pattern": "(^System$)|(^Custom$)",
	"definitions.PresetType.type": "string",
	"definitions.PresetWatermark.description": "\u003cp\u003eSettings for the size, location, and opacity of graphics that you want Elastic Transcoder to overlay over videos that are transcoded using this preset. You can specify settings for up to four watermarks. Watermarks appear in the specified size and location, and with the specified opacity for the duration of the transcoded video.\u003c/p\u003e \u003cp\u003eWatermarks can be in .png or .jpg format. If you want to display a watermark that is not rectangular, use the .png format, which supports transparency.\u003c/p\u003e \u003cp\u003eWhen you create a job that uses this preset, you specify the .png or .jpg graphics that you want Elastic Transcoder to include in the transcoded videos. You can specify fewer graphics in the job than you specify watermark settings in the preset, which allows you to use the same preset for up to four watermarks that have different dimensions.\u003c/p\u003e",
	"definitions.PresetWatermark.properties.HorizontalAlign.$ref": "#/definitions/HorizontalAlign",
	"definitions.PresetWatermark.properties.HorizontalAlign.description": "\u003cp\u003eThe horizontal position of the watermark unless you specify a non-zero value for \u003ccode\u003eHorizontalOffset\u003c/code\u003e: \u003c/p\u003e \u003cul\u003e \u003cli\u003e \u003cp\u003e \u003cb\u003eLeft\u003c/b\u003e: The left edge of the watermark is aligned with the left border of the video.\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e \u003cb\u003eRight\u003c/b\u003e: The right edge of the watermark is aligned with the right border of the video.\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e \u003cb\u003eCenter\u003c/b\u003e: The watermark is centered between the left and right borders.\u003c/p\u003e \u003c/li\u003e \u003c/ul\u003e",
	"definitions.PresetWatermark.properties.HorizontalOffset.$ref": "#/definitions/PixelsOrPercent",
	"definitions.PresetWatermark.properties.HorizontalOffset.description": "\u003cp\u003eThe amount by which you want the horizontal position of the watermark to be offset from the position specified by HorizontalAlign: \u003c/p\u003e \u003cul\u003e \u003cli\u003e \u003cp\u003enumber of pixels (px): The minimum value is 0 pixels, and the maximum value is the value of MaxWidth.\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003einteger percentage (%): The range of valid values is 0 to 100.\u003c/p\u003e \u003c/li\u003e \u003c/ul\u003e \u003cp\u003eFor example, if you specify Left for \u003ccode\u003eHorizontalAlign\u003c/code\u003e and 5px for \u003ccode\u003eHorizontalOffset\u003c/code\u003e, the left side of the watermark appears 5 pixels from the left border of the output video.\u003c/p\u003e \u003cp\u003e \u003ccode\u003eHorizontalOffset\u003c/code\u003e is only valid when the value of \u003ccode\u003eHorizontalAlign\u003c/code\u003e is \u003ccode\u003eLeft\u003c/code\u003e or \u003ccode\u003eRight\u003c/code\u003e. If you specify an offset that causes the watermark to extend beyond the left or right border and Elastic Transcoder has not added black bars, the watermark is cropped. If Elastic Transcoder has added black bars, the watermark extends into the black bars. If the watermark extends beyond the black bars, it is cropped.\u003c/p\u003e \u003cp\u003eUse the value of \u003ccode\u003eTarget\u003c/code\u003e to specify whether you want to include the black bars that are added by Elastic Transcoder, if any, in the offset calculation.\u003c/p\u003e",
	"definitions.PresetWatermark.properties.Id.$ref": "#/definitions/PresetWatermarkId",
	"definitions.PresetWatermark.properties.Id.description": " A unique identifier for the settings for one watermark. The value of \u003ccode\u003eId\u003c/code\u003e can be up to 40 characters long. ",
	"definitions.PresetWatermark.properties.MaxHeight.$ref": "#/definitions/PixelsOrPercent",
	"definitions.PresetWatermark.properties.MaxHeight.description": "\u003cp\u003eThe maximum height of the watermark in one of the following formats: \u003c/p\u003e \u003cul\u003e \u003cli\u003e \u003cp\u003enumber of pixels (px): The minimum value is 16 pixels, and the maximum value is the value of \u003ccode\u003eMaxHeight\u003c/code\u003e.\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003einteger percentage (%): The range of valid values is 0 to 100. Use the value of \u003ccode\u003eTarget\u003c/code\u003e to specify whether you want Elastic Transcoder to include the black bars that are added by Elastic Transcoder, if any, in the calculation.\u003c/p\u003e \u003c/li\u003e \u003c/ul\u003e \u003cp\u003eIf you specify the value in pixels, it must be less than or equal to the value of \u003ccode\u003eMaxHeight\u003c/code\u003e.\u003c/p\u003e",
	"definitions.PresetWatermark.properties.MaxWidth.$ref": "#/definitions/PixelsOrPercent",
	"definitions.PresetWatermark.properties.MaxWidth.description": "\u003cp\u003eThe maximum width of the watermark in one of the following formats: \u003c/p\u003e \u003cul\u003e \u003cli\u003e \u003cp\u003enumber of pixels (px): The minimum value is 16 pixels, and the maximum value is the value of \u003ccode\u003eMaxWidth\u003c/code\u003e.\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003einteger percentage (%): The range of valid values is 0 to 100. Use the value of \u003ccode\u003eTarget\u003c/code\u003e to specify whether you want Elastic Transcoder to include the black bars that are added by Elastic Transcoder, if any, in the calculation.\u003c/p\u003e \u003cp\u003eIf you specify the value in pixels, it must be less than or equal to the value of \u003ccode\u003eMaxWidth\u003c/code\u003e.\u003c/p\u003e \u003c/li\u003e \u003c/ul\u003e",
	"definitions.PresetWatermark.properties.Opacity.$ref": "#/definitions/Opacity",
	"definitions.PresetWatermark.properties.Opacity.description": "\u003cp\u003eA percentage that indicates how much you want a watermark to obscure the video in the location where it appears. Valid values are 0 (the watermark is invisible) to 100 (the watermark completely obscures the video in the specified location). The datatype of \u003ccode\u003eOpacity\u003c/code\u003e is float.\u003c/p\u003e \u003cp\u003eElastic Transcoder supports transparent .png graphics. If you use a transparent .png, the transparent portion of the video appears as if you had specified a value of 0 for \u003ccode\u003eOpacity\u003c/code\u003e. The .jpg file format doesn't support transparency.\u003c/p\u003e",
	"definitions.PresetWatermark.properties.SizingPolicy.$ref": "#/definitions/WatermarkSizingPolicy",
	"definitions.PresetWatermark.properties.SizingPolicy.description": "\u003cp\u003eA value that controls scaling of the watermark: \u003c/p\u003e \u003cul\u003e \u003cli\u003e \u003cp\u003e \u003cb\u003eFit\u003c/b\u003e: Elastic Transcoder scales the watermark so it matches the value that you specified in either \u003ccode\u003eMaxWidth\u003c/code\u003e or \u003ccode\u003eMaxHeight\u003c/code\u003e without exceeding the other value.\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e \u003cb\u003eStretch\u003c/b\u003e: Elastic Transcoder stretches the watermark to match the values that you specified for \u003ccode\u003eMaxWidth\u003c/code\u003e and \u003ccode\u003eMaxHeight\u003c/code\u003e. If the relative proportions of the watermark and the values of \u003ccode\u003eMaxWidth\u003c/code\u003e and \u003ccode\u003eMaxHeight\u003c/code\u003e are different, the watermark will be distorted.\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e \u003cb\u003eShrinkToFit\u003c/b\u003e: Elastic Transcoder scales the watermark down so that its dimensions match the values that you specified for at least one of \u003ccode\u003eMaxWidth\u003c/code\u003e and \u003ccode\u003eMaxHeight\u003c/code\u003e without exceeding either value. If you specify this option, Elastic Transcoder does not scale the watermark up.\u003c/p\u003e \u003c/li\u003e \u003c/ul\u003e",
	"definitions.PresetWatermark.properties.Target.$ref": "#/definitions/Target",
	"definitions.PresetWatermark.properties.Target.description": "\u003cp\u003eA value that determines how Elastic Transcoder interprets values that you specified for \u003ccode\u003eHorizontalOffset\u003c/code\u003e, \u003ccode\u003eVerticalOffset\u003c/code\u003e, \u003ccode\u003eMaxWidth\u003c/code\u003e, and \u003ccode\u003eMaxHeight\u003c/code\u003e:\u003c/p\u003e \u003cul\u003e \u003cli\u003e \u003cp\u003e \u003cb\u003eContent\u003c/b\u003e: \u003ccode\u003eHorizontalOffset\u003c/code\u003e and \u003ccode\u003eVerticalOffset\u003c/code\u003e values are calculated based on the borders of the video excluding black bars added by Elastic Transcoder, if any. In addition, \u003ccode\u003eMaxWidth\u003c/code\u003e and \u003ccode\u003eMaxHeight\u003c/code\u003e, if specified as a percentage, are calculated based on the borders of the video excluding black bars added by Elastic Transcoder, if any.\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e \u003cb\u003eFrame\u003c/b\u003e: \u003ccode\u003eHorizontalOffset\u003c/code\u003e and \u003ccode\u003eVerticalOffset\u003c/code\u003e values are calculated based on the borders of the video including black bars added by Elastic Transcoder, if any. In addition, \u003ccode\u003eMaxWidth\u003c/code\u003e and \u003ccode\u003eMaxHeight\u003c/code\u003e, if specified as a percentage, are calculated based on the borders of the video including black bars added by Elastic Transcoder, if any.\u003c/p\u003e \u003c/li\u003e \u003c/ul\u003e",
	"definitions.PresetWatermark.properties.VerticalAlign.$ref": "#/definitions/VerticalAlign",
	"definitions.PresetWatermark.properties.VerticalAlign.description": "\u003cp\u003eThe vertical position of the watermark unless you specify a non-zero value for \u003ccode\u003eVerticalOffset\u003c/code\u003e: \u003c/p\u003e \u003cul\u003e \u003cli\u003e \u003cp\u003e \u003cb\u003eTop\u003c/b\u003e: The top edge of the watermark is aligned with the top border of the video.\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e \u003cb\u003eBottom\u003c/b\u003e: The bottom edge of the watermark is aligned with the bottom border of the video.\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e \u003cb\u003eCenter\u003c/b\u003e: The watermark is centered between the top and bottom borders.\u003c/p\u003e \u003c/li\u003e \u003c/ul\u003e",
	"definitions.PresetWatermark.properties.VerticalOffset.$ref": "#/definitions/PixelsOrPercent",
	"definitions.PresetWatermark.properties.VerticalOffset.description": "\u003cp\u003e \u003ccode\u003eVerticalOffset\u003c/code\u003e \u003c/p\u003e \u003cp\u003eThe amount by which you want the vertical position of the watermark to be offset from the position specified by VerticalAlign:\u003c/p\u003e \u003cul\u003e \u003cli\u003e \u003cp\u003enumber of pixels (px): The minimum value is 0 pixels, and the maximum value is the value of \u003ccode\u003eMaxHeight\u003c/code\u003e.\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003einteger percentage (%): The range of valid values is 0 to 100.\u003c/p\u003e \u003c/li\u003e \u003c/ul\u003e \u003cp\u003eFor example, if you specify \u003ccode\u003eTop\u003c/code\u003e for \u003ccode\u003eVerticalAlign\u003c/code\u003e and \u003ccode\u003e5px\u003c/code\u003e for \u003ccode\u003eVerticalOffset\u003c/code\u003e, the top of the watermark appears 5 pixels from the top border of the output video.\u003c/p\u003e \u003cp\u003e \u003ccode\u003eVerticalOffset\u003c/code\u003e is only valid when the value of VerticalAlign is Top or Bottom.\u003c/p\u003e \u003cp\u003eIf you specify an offset that causes the watermark to extend beyond the top or bottom border and Elastic Transcoder has not added black bars, the watermark is cropped. If Elastic Transcoder has added black bars, the watermark extends into the black bars. If the watermark extends beyond the black bars, it is cropped.\u003c/p\u003e \u003cp\u003eUse the value of \u003ccode\u003eTarget\u003c/code\u003e to specify whether you want Elastic Transcoder to include the black bars that are added by Elastic Transcoder, if any, in the offset calculation.\u003c/p\u003e",
	"definitions.PresetWatermark.type": "object",
	"definitions.PresetWatermarkId.maxLength": 40,
	"definitions.PresetWatermarkId.minLength": 1,
	"definitions.PresetWatermarkId.type": "string",
	"definitions.PresetWatermarks.items.$ref": "#/definitions/PresetWatermark",
	"definitions.PresetWatermarks.type": "array",
	"definitions.Presets.items.$ref": "#/definitions/Preset",
	"definitions.Presets.type": "array",
	"definitions.ReadJobRequest.description": "The \u003ccode\u003eReadJobRequest\u003c/code\u003e structure.",
	"definitions.ReadJobRequest.type": "object",
	"definitions.ReadJobResponse.description": "The \u003ccode\u003eReadJobResponse\u003c/code\u003e structure.",
	"definitions.ReadJobResponse.properties.Job.$ref": "#/definitions/Job",
	"definitions.ReadJobResponse.properties.Job.description": "A section of the response body that provides information about the job.",
	"definitions.ReadJobResponse.type": "object",
	"definitions.ReadPipelineRequest.description": "The \u003ccode\u003eReadPipelineRequest\u003c/code\u003e structure.",
	"definitions.ReadPipelineRequest.type": "object",
	"definitions.ReadPipelineResponse.description": "The \u003ccode\u003eReadPipelineResponse\u003c/code\u003e structure.",
	"definitions.ReadPipelineResponse.properties.Pipeline.$ref": "#/definitions/Pipeline",
	"definitions.ReadPipelineResponse.properties.Pipeline.description": "A section of the response body that provides information about the pipeline.",
	"definitions.ReadPipelineResponse.properties.Warnings.$ref": "#/definitions/Warnings",
	"definitions.ReadPipelineResponse.properties.Warnings.description": "\u003cp\u003eElastic Transcoder returns a warning if the resources used by your pipeline are not in the same region as the pipeline.\u003c/p\u003e \u003cp\u003eUsing resources in the same region, such as your Amazon S3 buckets, Amazon SNS notification topics, and AWS KMS key, reduces processing time and prevents cross-regional charges.\u003c/p\u003e",
	"definitions.ReadPipelineResponse.type": "object",
	"definitions.ReadPresetRequest.description": "The \u003ccode\u003eReadPresetRequest\u003c/code\u003e structure.",
	"definitions.ReadPresetRequest.type": "object",
	"definitions.ReadPresetResponse.description": "The \u003ccode\u003eReadPresetResponse\u003c/code\u003e structure.",
	"definitions.ReadPresetResponse.properties.Preset.$ref": "#/definitions/Preset",
	"definitions.ReadPresetResponse.properties.Preset.description": "A section of the response body that provides information about the preset.",
	"definitions.ReadPresetResponse.type": "object",
	"definitions.Resolution.pattern": "(^auto$)|(^\\d{1,5}x\\d{1,5}$)",
	"definitions.Resolution.type": "string",
	"definitions.ResourceInUseException.description": "The resource you are attempting to change is in use. For example, you are attempting to delete a pipeline that is currently in use.",
	"definitions.ResourceInUseException.type": "object",
	"definitions.ResourceNotFoundException.description": "The requested resource does not exist or is not available. For example, the pipeline to which you're trying to add a job doesn't exist or is still being created.",
	"definitions.ResourceNotFoundException.type": "object",
	"definitions.Role.pattern": "^arn:aws:iam::\\w{12}:role/.+$",
	"definitions.Role.type": "string",
	"definitions.Rotate.pattern": "(^auto$)|(^0$)|(^90$)|(^180$)|(^270$)",
	"definitions.Rotate.type": "string",
	"definitions.SizingPolicy.pattern": "(^Fit$)|(^Fill$)|(^Stretch$)|(^Keep$)|(^ShrinkToFit$)|(^ShrinkToFill$)",
	"definitions.SizingPolicy.type": "string",
	"definitions.SnsTopic.pattern": "(^$)|(^arn:aws:sns:.*:\\w{12}:.+$)",
	"definitions.SnsTopic.type": "string",
	"definitions.SnsTopics.items.$ref": "#/definitions/SnsTopic",
	"definitions.SnsTopics.maxItems": 30,
	"definitions.SnsTopics.type": "array",
	"definitions.StorageClass.pattern": "(^ReducedRedundancy$)|(^Standard$)",
	"definitions.StorageClass.type": "string",
	"definitions.String.type": "string",
	"definitions.Success.pattern": "(^true$)|(^false$)",
	"definitions.Success.type": "string",
	"definitions.Target.pattern": "(^Content$)|(^Frame$)",
	"definitions.Target.type": "string",
	"definitions.TestRoleRequest.description": " The \u003ccode\u003eTestRoleRequest\u003c/code\u003e structure. ",
	"definitions.TestRoleRequest.properties.InputBucket.$ref": "#/definitions/BucketName",
	"definitions.TestRoleRequest.properties.InputBucket.description": "The Amazon S3 bucket that contains media files to be transcoded. The action attempts to read from this bucket.",
	"definitions.TestRoleRequest.properties.OutputBucket.$ref": "#/definitions/BucketName",
	"definitions.TestRoleRequest.properties.OutputBucket.description": "The Amazon S3 bucket that Elastic Transcoder writes transcoded media files to. The action attempts to read from this bucket.",
	"definitions.TestRoleRequest.properties.Role.$ref": "#/definitions/Role",
	"definitions.TestRoleRequest.properties.Role.description": "The IAM Amazon Resource Name (ARN) for the role that you want Elastic Transcoder to test.",
	"definitions.TestRoleRequest.properties.Topics.$ref": "#/definitions/SnsTopics",
	"definitions.TestRoleRequest.properties.Topics.description": "The ARNs of one or more Amazon Simple Notification Service (Amazon SNS) topics that you want the action to send a test notification to.",
	"definitions.TestRoleRequest.required.length": 4,
	"definitions.TestRoleRequest.required[0]": "Role",
	"definitions.TestRoleRequest.required[1]": "InputBucket",
	"definitions.TestRoleRequest.required[2]": "OutputBucket",
	"definitions.TestRoleRequest.required[3]": "Topics",
	"definitions.TestRoleRequest.type": "object",
	"definitions.TestRoleResponse.description": "The \u003ccode\u003eTestRoleResponse\u003c/code\u003e structure.",
	"definitions.TestRoleResponse.properties.Messages.$ref": "#/definitions/ExceptionMessages",
	"definitions.TestRoleResponse.properties.Messages.description": "If the \u003ccode\u003eSuccess\u003c/code\u003e element contains \u003ccode\u003efalse\u003c/code\u003e, this value is an array of one or more error messages that were generated during the test process.",
	"definitions.TestRoleResponse.properties.Success.$ref": "#/definitions/Success",
	"definitions.TestRoleResponse.properties.Success.description": "If the operation is successful, this value is \u003ccode\u003etrue\u003c/code\u003e; otherwise, the value is \u003ccode\u003efalse\u003c/code\u003e.",
	"definitions.TestRoleResponse.type": "object",
	"definitions.ThumbnailPattern.pattern": "(^$)|(^.*\\{count\\}.*$)",
	"definitions.ThumbnailPattern.type": "string",
	"definitions.ThumbnailResolution.pattern": "^\\d{1,5}x\\d{1,5}$",
	"definitions.ThumbnailResolution.type": "string",
	"definitions.Thumbnails.description": "Thumbnails for videos.",
	"definitions.Thumbnails.properties.AspectRatio.$ref": "#/definitions/AspectRatio",
	"definitions.Thumbnails.properties.AspectRatio.description": "\u003cimportant\u003e \u003cp\u003eTo better control resolution and aspect ratio of thumbnails, we recommend that you use the values \u003ccode\u003eMaxWidth\u003c/code\u003e, \u003ccode\u003eMaxHeight\u003c/code\u003e, \u003ccode\u003eSizingPolicy\u003c/code\u003e, and \u003ccode\u003ePaddingPolicy\u003c/code\u003e instead of \u003ccode\u003eResolution\u003c/code\u003e and \u003ccode\u003eAspectRatio\u003c/code\u003e. The two groups of settings are mutually exclusive. Do not use them together.\u003c/p\u003e \u003c/important\u003e \u003cp\u003eThe aspect ratio of thumbnails. Valid values include:\u003c/p\u003e \u003cp\u003e \u003ccode\u003eauto\u003c/code\u003e, \u003ccode\u003e1:1\u003c/code\u003e, \u003ccode\u003e4:3\u003c/code\u003e, \u003ccode\u003e3:2\u003c/code\u003e, \u003ccode\u003e16:9\u003c/code\u003e \u003c/p\u003e \u003cp\u003eIf you specify \u003ccode\u003eauto\u003c/code\u003e, Elastic Transcoder tries to preserve the aspect ratio of the video in the output file.\u003c/p\u003e",
	"definitions.Thumbnails.properties.Format.$ref": "#/definitions/JpgOrPng",
	"definitions.Thumbnails.properties.Format.description": "\u003cp\u003eThe format of thumbnails, if any. Valid values are \u003ccode\u003ejpg\u003c/code\u003e and \u003ccode\u003epng\u003c/code\u003e. \u003c/p\u003e \u003cp\u003eYou specify whether you want Elastic Transcoder to create thumbnails when you create a job.\u003c/p\u003e",
	"definitions.Thumbnails.properties.Interval.$ref": "#/definitions/Digits",
	"definitions.Thumbnails.properties.Interval.description": "The approximate number of seconds between thumbnails. Specify an integer value.",
	"definitions.Thumbnails.properties.MaxHeight.$ref": "#/definitions/DigitsOrAuto",
	"definitions.Thumbnails.properties.MaxHeight.description": "The maximum height of thumbnails in pixels. If you specify auto, Elastic Transcoder uses 1080 (Full HD) as the default value. If you specify a numeric value, enter an even integer between 32 and 3072.",
	"definitions.Thumbnails.properties.MaxWidth.$ref": "#/definitions/DigitsOrAuto",
	"definitions.Thumbnails.properties.MaxWidth.description": "The maximum width of thumbnails in pixels. If you specify auto, Elastic Transcoder uses 1920 (Full HD) as the default value. If you specify a numeric value, enter an even integer between 32 and 4096.",
	"definitions.Thumbnails.properties.PaddingPolicy.$ref": "#/definitions/PaddingPolicy",
	"definitions.Thumbnails.properties.PaddingPolicy.description": "When you set \u003ccode\u003ePaddingPolicy\u003c/code\u003e to \u003ccode\u003ePad\u003c/code\u003e, Elastic Transcoder may add black bars to the top and bottom and/or left and right sides of thumbnails to make the total size of the thumbnails match the values that you specified for thumbnail \u003ccode\u003eMaxWidth\u003c/code\u003e and \u003ccode\u003eMaxHeight\u003c/code\u003e settings.",
	"definitions.Thumbnails.properties.Resolution.$ref": "#/definitions/ThumbnailResolution",
	"definitions.Thumbnails.properties.Resolution.description": "\u003cimportant\u003e \u003cp\u003eTo better control resolution and aspect ratio of thumbnails, we recommend that you use the values \u003ccode\u003eMaxWidth\u003c/code\u003e, \u003ccode\u003eMaxHeight\u003c/code\u003e, \u003ccode\u003eSizingPolicy\u003c/code\u003e, and \u003ccode\u003ePaddingPolicy\u003c/code\u003e instead of \u003ccode\u003eResolution\u003c/code\u003e and \u003ccode\u003eAspectRatio\u003c/code\u003e. The two groups of settings are mutually exclusive. Do not use them together.\u003c/p\u003e \u003c/important\u003e \u003cp\u003eThe width and height of thumbnail files in pixels. Specify a value in the format \u003ccode\u003e \u003ci\u003ewidth\u003c/i\u003e \u003c/code\u003e x \u003ccode\u003e \u003ci\u003eheight\u003c/i\u003e \u003c/code\u003e where both values are even integers. The values cannot exceed the width and height that you specified in the \u003ccode\u003eVideo:Resolution\u003c/code\u003e object.\u003c/p\u003e",
	"definitions.Thumbnails.properties.SizingPolicy.$ref": "#/definitions/SizingPolicy",
	"definitions.Thumbnails.properties.SizingPolicy.description": "\u003cp\u003eSpecify one of the following values to control scaling of thumbnails:\u003c/p\u003e \u003cul\u003e \u003cli\u003e \u003cp\u003e \u003ccode\u003eFit\u003c/code\u003e: Elastic Transcoder scales thumbnails so they match the value that you specified in thumbnail MaxWidth or MaxHeight settings without exceeding the other value. \u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e \u003ccode\u003eFill\u003c/code\u003e: Elastic Transcoder scales thumbnails so they match the value that you specified in thumbnail \u003ccode\u003eMaxWidth\u003c/code\u003e or \u003ccode\u003eMaxHeight\u003c/code\u003e settings and matches or exceeds the other value. Elastic Transcoder centers the image in thumbnails and then crops in the dimension (if any) that exceeds the maximum value.\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e \u003ccode\u003eStretch\u003c/code\u003e: Elastic Transcoder stretches thumbnails to match the values that you specified for thumbnail \u003ccode\u003eMaxWidth\u003c/code\u003e and \u003ccode\u003eMaxHeight\u003c/code\u003e settings. If the relative proportions of the input video and thumbnails are different, the thumbnails will be distorted.\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e \u003ccode\u003eKeep\u003c/code\u003e: Elastic Transcoder does not scale thumbnails. If either dimension of the input video exceeds the values that you specified for thumbnail \u003ccode\u003eMaxWidth\u003c/code\u003e and \u003ccode\u003eMaxHeight\u003c/code\u003e settings, Elastic Transcoder crops the thumbnails.\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e \u003ccode\u003eShrinkToFit\u003c/code\u003e: Elastic Transcoder scales thumbnails down so that their dimensions match the values that you specified for at least one of thumbnail \u003ccode\u003eMaxWidth\u003c/code\u003e and \u003ccode\u003eMaxHeight\u003c/code\u003e without exceeding either value. If you specify this option, Elastic Transcoder does not scale thumbnails up.\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e \u003ccode\u003eShrinkToFill\u003c/code\u003e: Elastic Transcoder scales thumbnails down so that their dimensions match the values that you specified for at least one of \u003ccode\u003eMaxWidth\u003c/code\u003e and \u003ccode\u003eMaxHeight\u003c/code\u003e without dropping below either value. If you specify this option, Elastic Transcoder does not scale thumbnails up.\u003c/p\u003e \u003c/li\u003e \u003c/ul\u003e",
	"definitions.Thumbnails.type": "object",
	"definitions.Time.pattern": "(^\\d{1,5}(\\.\\d{0,3})?$)|(^([0-1]?[0-9]:|2[0-3]:)?([0-5]?[0-9]:)?[0-5]?[0-9](\\.\\d{0,3})?$)",
	"definitions.Time.type": "string",
	"definitions.TimeOffset.pattern": "(^[+-]?\\d{1,5}(\\.\\d{0,3})?$)|(^[+-]?([0-1]?[0-9]:|2[0-3]:)?([0-5]?[0-9]:)?[0-5]?[0-9](\\.\\d{0,3})?$)",
	"definitions.TimeOffset.type": "string",
	"definitions.TimeSpan.description": "Settings that determine when a clip begins and how long it lasts.",
	"definitions.TimeSpan.properties.Duration.$ref": "#/definitions/Time",
	"definitions.TimeSpan.properties.Duration.description": "\u003cp\u003eThe duration of the clip. The format can be either HH:mm:ss.SSS (maximum value: 23:59:59.999; SSS is thousandths of a second) or sssss.SSS (maximum value: 86399.999). If you don't specify a value, Elastic Transcoder creates an output file from StartTime to the end of the file.\u003c/p\u003e \u003cp\u003eIf you specify a value longer than the duration of the input file, Elastic Transcoder transcodes the file and returns a warning message.\u003c/p\u003e",
	"definitions.TimeSpan.properties.StartTime.$ref": "#/definitions/Time",
	"definitions.TimeSpan.properties.StartTime.description": "The place in the input file where you want a clip to start. The format can be either HH:mm:ss.SSS (maximum value: 23:59:59.999; SSS is thousandths of a second) or sssss.SSS (maximum value: 86399.999). If you don't specify a value, Elastic Transcoder starts at the beginning of the input file.",
	"definitions.TimeSpan.type": "object",
	"definitions.Timing.description": "Details about the timing of a job.",
	"definitions.Timing.properties.FinishTimeMillis.$ref": "#/definitions/NullableLong",
	"definitions.Timing.properties.FinishTimeMillis.description": "The time the job finished transcoding, in epoch milliseconds.",
	"definitions.Timing.properties.StartTimeMillis.$ref": "#/definitions/NullableLong",
	"definitions.Timing.properties.StartTimeMillis.description": "The time the job began transcoding, in epoch milliseconds.",
	"definitions.Timing.properties.SubmitTimeMillis.$ref": "#/definitions/NullableLong",
	"definitions.Timing.properties.SubmitTimeMillis.description": "The time the job was submitted to Elastic Transcoder, in epoch milliseconds.",
	"definitions.Timing.type": "object",
	"definitions.UpdatePipelineNotificationsRequest.description": "The \u003ccode\u003eUpdatePipelineNotificationsRequest\u003c/code\u003e structure.",
	"definitions.UpdatePipelineNotificationsRequest.properties.Notifications.$ref": "#/definitions/Notifications",
	"definitions.UpdatePipelineNotificationsRequest.properties.Notifications.description": "\u003cp\u003eThe topic ARN for the Amazon Simple Notification Service (Amazon SNS) topic that you want to notify to report job status.\u003c/p\u003e \u003cimportant\u003e \u003cp\u003eTo receive notifications, you must also subscribe to the new topic in the Amazon SNS console.\u003c/p\u003e \u003c/important\u003e \u003cul\u003e \u003cli\u003e \u003cp\u003e \u003cb\u003eProgressing\u003c/b\u003e: The topic ARN for the Amazon Simple Notification Service (Amazon SNS) topic that you want to notify when Elastic Transcoder has started to process jobs that are added to this pipeline. This is the ARN that Amazon SNS returned when you created the topic.\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e \u003cb\u003eCompleted\u003c/b\u003e: The topic ARN for the Amazon SNS topic that you want to notify when Elastic Transcoder has finished processing a job. This is the ARN that Amazon SNS returned when you created the topic.\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e \u003cb\u003eWarning\u003c/b\u003e: The topic ARN for the Amazon SNS topic that you want to notify when Elastic Transcoder encounters a warning condition. This is the ARN that Amazon SNS returned when you created the topic.\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e \u003cb\u003eError\u003c/b\u003e: The topic ARN for the Amazon SNS topic that you want to notify when Elastic Transcoder encounters an error condition. This is the ARN that Amazon SNS returned when you created the topic.\u003c/p\u003e \u003c/li\u003e \u003c/ul\u003e",
	"definitions.UpdatePipelineNotificationsRequest.required.length": 1,
	"definitions.UpdatePipelineNotificationsRequest.required[0]": "Notifications",
	"definitions.UpdatePipelineNotificationsRequest.type": "object",
	"definitions.UpdatePipelineNotificationsResponse.description": "The \u003ccode\u003eUpdatePipelineNotificationsResponse\u003c/code\u003e structure.",
	"definitions.UpdatePipelineNotificationsResponse.properties.Pipeline.$ref": "#/definitions/Pipeline",
	"definitions.UpdatePipelineNotificationsResponse.properties.Pipeline.description": "A section of the response body that provides information about the pipeline associated with this notification.",
	"definitions.UpdatePipelineNotificationsResponse.type": "object",
	"definitions.UpdatePipelineRequest.description": "The \u003ccode\u003eUpdatePipelineRequest\u003c/code\u003e structure.",
	"definitions.UpdatePipelineRequest.properties.AwsKmsKeyArn.$ref": "#/definitions/KeyArn",
	"definitions.UpdatePipelineRequest.properties.AwsKmsKeyArn.description": "\u003cp\u003eThe AWS Key Management Service (AWS KMS) key that you want to use with this pipeline.\u003c/p\u003e \u003cp\u003eIf you use either \u003ccode\u003eS3\u003c/code\u003e or \u003ccode\u003eS3-AWS-KMS\u003c/code\u003e as your \u003ccode\u003eEncryption:Mode\u003c/code\u003e, you don't need to provide a key with your job because a default key, known as an AWS-KMS key, is created for you automatically. You need to provide an AWS-KMS key only if you want to use a non-default AWS-KMS key, or if you are using an \u003ccode\u003eEncryption:Mode\u003c/code\u003e of \u003ccode\u003eAES-PKCS7\u003c/code\u003e, \u003ccode\u003eAES-CTR\u003c/code\u003e, or \u003ccode\u003eAES-GCM\u003c/code\u003e.\u003c/p\u003e",
	"definitions.UpdatePipelineRequest.properties.ContentConfig.$ref": "#/definitions/PipelineOutputConfig",
	"definitions.UpdatePipelineRequest.properties.ContentConfig.description": "\u003cp\u003eThe optional \u003ccode\u003eContentConfig\u003c/code\u003e object specifies information about the Amazon S3 bucket in which you want Elastic Transcoder to save transcoded files and playlists: which bucket to use, which users you want to have access to the files, the type of access you want users to have, and the storage class that you want to assign to the files.\u003c/p\u003e \u003cp\u003eIf you specify values for \u003ccode\u003eContentConfig\u003c/code\u003e, you must also specify values for \u003ccode\u003eThumbnailConfig\u003c/code\u003e.\u003c/p\u003e \u003cp\u003eIf you specify values for \u003ccode\u003eContentConfig\u003c/code\u003e and \u003ccode\u003eThumbnailConfig\u003c/code\u003e, omit the \u003ccode\u003eOutputBucket\u003c/code\u003e object.\u003c/p\u003e \u003cul\u003e \u003cli\u003e \u003cp\u003e \u003cb\u003eBucket\u003c/b\u003e: The Amazon S3 bucket in which you want Elastic Transcoder to save transcoded files and playlists.\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e \u003cb\u003ePermissions\u003c/b\u003e (Optional): The Permissions object specifies which users you want to have access to transcoded files and the type of access you want them to have. You can grant permissions to a maximum of 30 users and/or predefined Amazon S3 groups.\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e \u003cb\u003eGrantee Type\u003c/b\u003e: Specify the type of value that appears in the \u003ccode\u003eGrantee\u003c/code\u003e object:\u003c/p\u003e \u003cul\u003e \u003cli\u003e \u003cp\u003e \u003cb\u003eCanonical\u003c/b\u003e: The value in the \u003ccode\u003eGrantee\u003c/code\u003e object is either the canonical user ID for an AWS account or an origin access identity for an Amazon CloudFront distribution. For more information about canonical user IDs, see Access Control List (ACL) Overview in the Amazon Simple Storage Service Developer Guide. For more information about using CloudFront origin access identities to require that users use CloudFront URLs instead of Amazon S3 URLs, see Using an Origin Access Identity to Restrict Access to Your Amazon S3 Content.\u003c/p\u003e \u003cimportant\u003e \u003cp\u003eA canonical user ID is not the same as an AWS account number.\u003c/p\u003e \u003c/important\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e \u003cb\u003eEmail\u003c/b\u003e: The value in the \u003ccode\u003eGrantee\u003c/code\u003e object is the registered email address of an AWS account.\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e \u003cb\u003eGroup\u003c/b\u003e: The value in the \u003ccode\u003eGrantee\u003c/code\u003e object is one of the following predefined Amazon S3 groups: \u003ccode\u003eAllUsers\u003c/code\u003e, \u003ccode\u003eAuthenticatedUsers\u003c/code\u003e, or \u003ccode\u003eLogDelivery\u003c/code\u003e.\u003c/p\u003e \u003c/li\u003e \u003c/ul\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e \u003cb\u003eGrantee\u003c/b\u003e: The AWS user or group that you want to have access to transcoded files and playlists. To identify the user or group, you can specify the canonical user ID for an AWS account, an origin access identity for a CloudFront distribution, the registered email address of an AWS account, or a predefined Amazon S3 group \u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e \u003cb\u003eAccess\u003c/b\u003e: The permission that you want to give to the AWS user that you specified in \u003ccode\u003eGrantee\u003c/code\u003e. Permissions are granted on the files that Elastic Transcoder adds to the bucket, including playlists and video files. Valid values include: \u003c/p\u003e \u003cul\u003e \u003cli\u003e \u003cp\u003e \u003ccode\u003eREAD\u003c/code\u003e: The grantee can read the objects and metadata for objects that Elastic Transcoder adds to the Amazon S3 bucket.\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e \u003ccode\u003eREAD_ACP\u003c/code\u003e: The grantee can read the object ACL for objects that Elastic Transcoder adds to the Amazon S3 bucket. \u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e \u003ccode\u003eWRITE_ACP\u003c/code\u003e: The grantee can write the ACL for the objects that Elastic Transcoder adds to the Amazon S3 bucket.\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e \u003ccode\u003eFULL_CONTROL\u003c/code\u003e: The grantee has \u003ccode\u003eREAD\u003c/code\u003e, \u003ccode\u003eREAD_ACP\u003c/code\u003e, and \u003ccode\u003eWRITE_ACP\u003c/code\u003e permissions for the objects that Elastic Transcoder adds to the Amazon S3 bucket.\u003c/p\u003e \u003c/li\u003e \u003c/ul\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e \u003cb\u003eStorageClass\u003c/b\u003e: The Amazon S3 storage class, \u003ccode\u003eStandard\u003c/code\u003e or \u003ccode\u003eReducedRedundancy\u003c/code\u003e, that you want Elastic Transcoder to assign to the video files and playlists that it stores in your Amazon S3 bucket.\u003c/p\u003e \u003c/li\u003e \u003c/ul\u003e",
	"definitions.UpdatePipelineRequest.properties.InputBucket.$ref": "#/definitions/BucketName",
	"definitions.UpdatePipelineRequest.properties.InputBucket.description": "The Amazon S3 bucket in which you saved the media files that you want to transcode and the graphics that you want to use as watermarks.",
	"definitions.UpdatePipelineRequest.properties.Name.$ref": "#/definitions/Name",
	"definitions.UpdatePipelineRequest.properties.Name.description": "\u003cp\u003eThe name of the pipeline. We recommend that the name be unique within the AWS account, but uniqueness is not enforced.\u003c/p\u003e \u003cp\u003eConstraints: Maximum 40 characters\u003c/p\u003e",
	"definitions.UpdatePipelineRequest.properties.Notifications.$ref": "#/definitions/Notifications",
	"definitions.UpdatePipelineRequest.properties.Notifications.description": "\u003cp\u003eThe topic ARN for the Amazon Simple Notification Service (Amazon SNS) topic that you want to notify to report job status.\u003c/p\u003e \u003cimportant\u003e \u003cp\u003eTo receive notifications, you must also subscribe to the new topic in the Amazon SNS console.\u003c/p\u003e \u003c/important\u003e \u003cul\u003e \u003cli\u003e \u003cp\u003e \u003cb\u003eProgressing\u003c/b\u003e: The topic ARN for the Amazon Simple Notification Service (Amazon SNS) topic that you want to notify when Elastic Transcoder has started to process jobs that are added to this pipeline. This is the ARN that Amazon SNS returned when you created the topic.\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e \u003cb\u003eCompleted\u003c/b\u003e: The topic ARN for the Amazon SNS topic that you want to notify when Elastic Transcoder has finished processing a job. This is the ARN that Amazon SNS returned when you created the topic.\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e \u003cb\u003eWarning\u003c/b\u003e: The topic ARN for the Amazon SNS topic that you want to notify when Elastic Transcoder encounters a warning condition. This is the ARN that Amazon SNS returned when you created the topic.\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e \u003cb\u003eError\u003c/b\u003e: The topic ARN for the Amazon SNS topic that you want to notify when Elastic Transcoder encounters an error condition. This is the ARN that Amazon SNS returned when you created the topic.\u003c/p\u003e \u003c/li\u003e \u003c/ul\u003e",
	"definitions.UpdatePipelineRequest.properties.Role.$ref": "#/definitions/Role",
	"definitions.UpdatePipelineRequest.properties.Role.description": "The IAM Amazon Resource Name (ARN) for the role that you want Elastic Transcoder to use to transcode jobs for this pipeline.",
	"definitions.UpdatePipelineRequest.properties.ThumbnailConfig.$ref": "#/definitions/PipelineOutputConfig",
	"definitions.UpdatePipelineRequest.properties.ThumbnailConfig.description": "\u003cp\u003eThe \u003ccode\u003eThumbnailConfig\u003c/code\u003e object specifies several values, including the Amazon S3 bucket in which you want Elastic Transcoder to save thumbnail files, which users you want to have access to the files, the type of access you want users to have, and the storage class that you want to assign to the files.\u003c/p\u003e \u003cp\u003eIf you specify values for \u003ccode\u003eContentConfig\u003c/code\u003e, you must also specify values for \u003ccode\u003eThumbnailConfig\u003c/code\u003e even if you don't want to create thumbnails.\u003c/p\u003e \u003cp\u003eIf you specify values for \u003ccode\u003eContentConfig\u003c/code\u003e and \u003ccode\u003eThumbnailConfig\u003c/code\u003e, omit the \u003ccode\u003eOutputBucket\u003c/code\u003e object.\u003c/p\u003e \u003cul\u003e \u003cli\u003e \u003cp\u003e \u003cb\u003eBucket\u003c/b\u003e: The Amazon S3 bucket in which you want Elastic Transcoder to save thumbnail files.\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e \u003cb\u003ePermissions\u003c/b\u003e (Optional): The \u003ccode\u003ePermissions\u003c/code\u003e object specifies which users and/or predefined Amazon S3 groups you want to have access to thumbnail files, and the type of access you want them to have. You can grant permissions to a maximum of 30 users and/or predefined Amazon S3 groups.\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e \u003cb\u003eGranteeType\u003c/b\u003e: Specify the type of value that appears in the Grantee object:\u003c/p\u003e \u003cul\u003e \u003cli\u003e \u003cp\u003e \u003cb\u003eCanonical\u003c/b\u003e: The value in the \u003ccode\u003eGrantee\u003c/code\u003e object is either the canonical user ID for an AWS account or an origin access identity for an Amazon CloudFront distribution.\u003c/p\u003e \u003cimportant\u003e \u003cp\u003eA canonical user ID is not the same as an AWS account number.\u003c/p\u003e \u003c/important\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e \u003cb\u003eEmail\u003c/b\u003e: The value in the \u003ccode\u003eGrantee\u003c/code\u003e object is the registered email address of an AWS account.\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e \u003cb\u003eGroup\u003c/b\u003e: The value in the \u003ccode\u003eGrantee\u003c/code\u003e object is one of the following predefined Amazon S3 groups: \u003ccode\u003eAllUsers\u003c/code\u003e, \u003ccode\u003eAuthenticatedUsers\u003c/code\u003e, or \u003ccode\u003eLogDelivery\u003c/code\u003e.\u003c/p\u003e \u003c/li\u003e \u003c/ul\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e \u003cb\u003eGrantee\u003c/b\u003e: The AWS user or group that you want to have access to thumbnail files. To identify the user or group, you can specify the canonical user ID for an AWS account, an origin access identity for a CloudFront distribution, the registered email address of an AWS account, or a predefined Amazon S3 group. \u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e \u003cb\u003eAccess\u003c/b\u003e: The permission that you want to give to the AWS user that you specified in \u003ccode\u003eGrantee\u003c/code\u003e. Permissions are granted on the thumbnail files that Elastic Transcoder adds to the bucket. Valid values include: \u003c/p\u003e \u003cul\u003e \u003cli\u003e \u003cp\u003e \u003ccode\u003eREAD\u003c/code\u003e: The grantee can read the thumbnails and metadata for objects that Elastic Transcoder adds to the Amazon S3 bucket.\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e \u003ccode\u003eREAD_ACP\u003c/code\u003e: The grantee can read the object ACL for thumbnails that Elastic Transcoder adds to the Amazon S3 bucket.\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e \u003ccode\u003eWRITE_ACP\u003c/code\u003e: The grantee can write the ACL for the thumbnails that Elastic Transcoder adds to the Amazon S3 bucket.\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e \u003ccode\u003eFULL_CONTROL\u003c/code\u003e: The grantee has \u003ccode\u003eREAD\u003c/code\u003e, \u003ccode\u003eREAD_ACP\u003c/code\u003e, and \u003ccode\u003eWRITE_ACP\u003c/code\u003e permissions for the thumbnails that Elastic Transcoder adds to the Amazon S3 bucket. \u003c/p\u003e \u003c/li\u003e \u003c/ul\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e \u003cb\u003eStorageClass\u003c/b\u003e: The Amazon S3 storage class, \u003ccode\u003eStandard\u003c/code\u003e or \u003ccode\u003eReducedRedundancy\u003c/code\u003e, that you want Elastic Transcoder to assign to the thumbnails that it stores in your Amazon S3 bucket.\u003c/p\u003e \u003c/li\u003e \u003c/ul\u003e",
	"definitions.UpdatePipelineRequest.type": "object",
	"definitions.UpdatePipelineResponse.description": "When you update a pipeline, Elastic Transcoder returns the values that you specified in the request.",
	"definitions.UpdatePipelineResponse.properties.Pipeline.$ref": "#/definitions/Pipeline",
	"definitions.UpdatePipelineResponse.properties.Pipeline.description": "The pipeline updated by this \u003ccode\u003eUpdatePipelineResponse\u003c/code\u003e call.",
	"definitions.UpdatePipelineResponse.properties.Warnings.$ref": "#/definitions/Warnings",
	"definitions.UpdatePipelineResponse.properties.Warnings.description": "\u003cp\u003eElastic Transcoder returns a warning if the resources used by your pipeline are not in the same region as the pipeline.\u003c/p\u003e \u003cp\u003eUsing resources in the same region, such as your Amazon S3 buckets, Amazon SNS notification topics, and AWS KMS key, reduces processing time and prevents cross-regional charges.\u003c/p\u003e",
	"definitions.UpdatePipelineResponse.type": "object",
	"definitions.UpdatePipelineStatusRequest.description": "The \u003ccode\u003eUpdatePipelineStatusRequest\u003c/code\u003e structure.",
	"definitions.UpdatePipelineStatusRequest.properties.Status.$ref": "#/definitions/PipelineStatus",
	"definitions.UpdatePipelineStatusRequest.properties.Status.description": "\u003cp\u003eThe desired status of the pipeline:\u003c/p\u003e \u003cul\u003e \u003cli\u003e \u003cp\u003e \u003ccode\u003eActive\u003c/code\u003e: The pipeline is processing jobs.\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e \u003ccode\u003ePaused\u003c/code\u003e: The pipeline is not currently processing jobs.\u003c/p\u003e \u003c/li\u003e \u003c/ul\u003e",
	"definitions.UpdatePipelineStatusRequest.required.length": 1,
	"definitions.UpdatePipelineStatusRequest.required[0]": "Status",
	"definitions.UpdatePipelineStatusRequest.type": "object",
	"definitions.UpdatePipelineStatusResponse.description": "When you update status for a pipeline, Elastic Transcoder returns the values that you specified in the request.",
	"definitions.UpdatePipelineStatusResponse.properties.Pipeline.$ref": "#/definitions/Pipeline",
	"definitions.UpdatePipelineStatusResponse.properties.Pipeline.description": "A section of the response body that provides information about the pipeline.",
	"definitions.UpdatePipelineStatusResponse.type": "object",
	"definitions.UserMetadata.items.properties.key.$ref": "#/definitions/String",
	"definitions.UserMetadata.items.properties.value.$ref": "#/definitions/String",
	"definitions.UserMetadata.items.type": "object",
	"definitions.UserMetadata.type": "array",
	"definitions.ValidationException.description": "One or more required parameter values were not provided in the request.",
	"definitions.ValidationException.type": "object",
	"definitions.VerticalAlign.pattern": "(^Top$)|(^Bottom$)|(^Center$)",
	"definitions.VerticalAlign.type": "string",
	"definitions.VideoBitRate.pattern": "(^\\d{2,5}$)|(^auto$)",
	"definitions.VideoBitRate.type": "string",
	"definitions.VideoCodec.pattern": "(^H\\.264$)|(^vp8$)|(^vp9$)|(^mpeg2$)|(^gif$)",
	"definitions.VideoCodec.type": "string",
	"definitions.VideoParameters.description": "The \u003ccode\u003eVideoParameters\u003c/code\u003e structure.",
	"definitions.VideoParameters.properties.AspectRatio.$ref": "#/definitions/AspectRatio",
	"definitions.VideoParameters.properties.AspectRatio.description": "\u003cimportant\u003e \u003cp\u003eTo better control resolution and aspect ratio of output videos, we recommend that you use the values \u003ccode\u003eMaxWidth\u003c/code\u003e, \u003ccode\u003eMaxHeight\u003c/code\u003e, \u003ccode\u003eSizingPolicy\u003c/code\u003e, \u003ccode\u003ePaddingPolicy\u003c/code\u003e, and \u003ccode\u003eDisplayAspectRatio\u003c/code\u003e instead of \u003ccode\u003eResolution\u003c/code\u003e and \u003ccode\u003eAspectRatio\u003c/code\u003e. The two groups of settings are mutually exclusive. Do not use them together.\u003c/p\u003e \u003c/important\u003e \u003cp\u003eThe display aspect ratio of the video in the output file. Valid values include:\u003c/p\u003e \u003cp\u003e \u003ccode\u003eauto\u003c/code\u003e, \u003ccode\u003e1:1\u003c/code\u003e, \u003ccode\u003e4:3\u003c/code\u003e, \u003ccode\u003e3:2\u003c/code\u003e, \u003ccode\u003e16:9\u003c/code\u003e \u003c/p\u003e \u003cp\u003eIf you specify \u003ccode\u003eauto\u003c/code\u003e, Elastic Transcoder tries to preserve the aspect ratio of the input file.\u003c/p\u003e \u003cp\u003eIf you specify an aspect ratio for the output file that differs from aspect ratio of the input file, Elastic Transcoder adds pillarboxing (black bars on the sides) or letterboxing (black bars on the top and bottom) to maintain the aspect ratio of the active region of the video.\u003c/p\u003e",
	"definitions.VideoParameters.properties.BitRate.$ref": "#/definitions/VideoBitRate",
	"definitions.VideoParameters.properties.BitRate.description": "\u003cp\u003eThe bit rate of the video stream in the output file, in kilobits/second. Valid values depend on the values of \u003ccode\u003eLevel\u003c/code\u003e and \u003ccode\u003eProfile\u003c/code\u003e. If you specify \u003ccode\u003eauto\u003c/code\u003e, Elastic Transcoder uses the detected bit rate of the input source. If you specify a value other than \u003ccode\u003eauto\u003c/code\u003e, we recommend that you specify a value less than or equal to the maximum H.264-compliant value listed for your level and profile:\u003c/p\u003e \u003cp\u003e \u003ci\u003eLevel - Maximum video bit rate in kilobits/second (baseline and main Profile) : maximum video bit rate in kilobits/second (high Profile)\u003c/i\u003e \u003c/p\u003e \u003cul\u003e \u003cli\u003e \u003cp\u003e1 - 64 : 80\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e1b - 128 : 160\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e1.1 - 192 : 240\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e1.2 - 384 : 480\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e1.3 - 768 : 960\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e2 - 2000 : 2500\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e3 - 10000 : 12500\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e3.1 - 14000 : 17500\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e3.2 - 20000 : 25000\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e4 - 20000 : 25000\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e4.1 - 50000 : 62500\u003c/p\u003e \u003c/li\u003e \u003c/ul\u003e",
	"definitions.VideoParameters.properties.Codec.$ref": "#/definitions/VideoCodec",
	"definitions.VideoParameters.properties.Codec.description": "The video codec for the output file. Valid values include \u003ccode\u003egif\u003c/code\u003e, \u003ccode\u003eH.264\u003c/code\u003e, \u003ccode\u003empeg2\u003c/code\u003e, \u003ccode\u003evp8\u003c/code\u003e, and \u003ccode\u003evp9\u003c/code\u003e. You can only specify \u003ccode\u003evp8\u003c/code\u003e and \u003ccode\u003evp9\u003c/code\u003e when the container type is \u003ccode\u003ewebm\u003c/code\u003e, \u003ccode\u003egif\u003c/code\u003e when the container type is \u003ccode\u003egif\u003c/code\u003e, and \u003ccode\u003empeg2\u003c/code\u003e when the container type is \u003ccode\u003empg\u003c/code\u003e.",
	"definitions.VideoParameters.properties.CodecOptions.$ref": "#/definitions/CodecOptions",
	"definitions.VideoParameters.properties.CodecOptions.description": "\u003cp\u003e \u003cb\u003eProfile (H.264/VP8/VP9 Only)\u003c/b\u003e \u003c/p\u003e \u003cp\u003eThe H.264 profile that you want to use for the output file. Elastic Transcoder supports the following profiles:\u003c/p\u003e \u003cul\u003e \u003cli\u003e \u003cp\u003e \u003ccode\u003ebaseline\u003c/code\u003e: The profile most commonly used for videoconferencing and for mobile applications.\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e \u003ccode\u003emain\u003c/code\u003e: The profile used for standard-definition digital TV broadcasts.\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e \u003ccode\u003ehigh\u003c/code\u003e: The profile used for high-definition digital TV broadcasts and for Blu-ray discs.\u003c/p\u003e \u003c/li\u003e \u003c/ul\u003e \u003cp\u003e \u003cb\u003eLevel (H.264 Only)\u003c/b\u003e \u003c/p\u003e \u003cp\u003eThe H.264 level that you want to use for the output file. Elastic Transcoder supports the following levels:\u003c/p\u003e \u003cp\u003e \u003ccode\u003e1\u003c/code\u003e, \u003ccode\u003e1b\u003c/code\u003e, \u003ccode\u003e1.1\u003c/code\u003e, \u003ccode\u003e1.2\u003c/code\u003e, \u003ccode\u003e1.3\u003c/code\u003e, \u003ccode\u003e2\u003c/code\u003e, \u003ccode\u003e2.1\u003c/code\u003e, \u003ccode\u003e2.2\u003c/code\u003e, \u003ccode\u003e3\u003c/code\u003e, \u003ccode\u003e3.1\u003c/code\u003e, \u003ccode\u003e3.2\u003c/code\u003e, \u003ccode\u003e4\u003c/code\u003e, \u003ccode\u003e4.1\u003c/code\u003e \u003c/p\u003e \u003cp\u003e \u003cb\u003eMaxReferenceFrames (H.264 Only)\u003c/b\u003e \u003c/p\u003e \u003cp\u003eApplicable only when the value of Video:Codec is H.264. The maximum number of previously decoded frames to use as a reference for decoding future frames. Valid values are integers 0 through 16, but we recommend that you not use a value greater than the following:\u003c/p\u003e \u003cp\u003e \u003ccode\u003eMin(Floor(Maximum decoded picture buffer in macroblocks * 256 / (Width in pixels * Height in pixels)), 16)\u003c/code\u003e \u003c/p\u003e \u003cp\u003ewhere \u003ci\u003eWidth in pixels\u003c/i\u003e and \u003ci\u003eHeight in pixels\u003c/i\u003e represent either MaxWidth and MaxHeight, or Resolution. \u003ci\u003eMaximum decoded picture buffer in macroblocks\u003c/i\u003e depends on the value of the \u003ccode\u003eLevel\u003c/code\u003e object. See the list below. (A macroblock is a block of pixels measuring 16x16.) \u003c/p\u003e \u003cul\u003e \u003cli\u003e \u003cp\u003e1 - 396\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e1b - 396\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e1.1 - 900\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e1.2 - 2376\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e1.3 - 2376\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e2 - 2376\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e2.1 - 4752\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e2.2 - 8100\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e3 - 8100\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e3.1 - 18000\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e3.2 - 20480\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e4 - 32768\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e4.1 - 32768\u003c/p\u003e \u003c/li\u003e \u003c/ul\u003e \u003cp\u003e \u003cb\u003eMaxBitRate (Optional, H.264/MPEG2/VP8/VP9 only)\u003c/b\u003e \u003c/p\u003e \u003cp\u003eThe maximum number of bits per second in a video buffer; the size of the buffer is specified by \u003ccode\u003eBufferSize\u003c/code\u003e. Specify a value between 16 and 62,500. You can reduce the bandwidth required to stream a video by reducing the maximum bit rate, but this also reduces the quality of the video.\u003c/p\u003e \u003cp\u003e \u003cb\u003eBufferSize (Optional, H.264/MPEG2/VP8/VP9 only)\u003c/b\u003e \u003c/p\u003e \u003cp\u003eThe maximum number of bits in any x seconds of the output video. This window is commonly 10 seconds, the standard segment duration when you're using FMP4 or MPEG-TS for the container type of the output video. Specify an integer greater than 0. If you specify \u003ccode\u003eMaxBitRate\u003c/code\u003e and omit \u003ccode\u003eBufferSize\u003c/code\u003e, Elastic Transcoder sets \u003ccode\u003eBufferSize\u003c/code\u003e to 10 times the value of \u003ccode\u003eMaxBitRate\u003c/code\u003e.\u003c/p\u003e \u003cp\u003e \u003cb\u003eInterlacedMode (Optional, H.264/MPEG2 Only)\u003c/b\u003e \u003c/p\u003e \u003cp\u003eThe interlace mode for the output video.\u003c/p\u003e \u003cp\u003eInterlaced video is used to double the perceived frame rate for a video by interlacing two fields (one field on every other line, the other field on the other lines) so that the human eye registers multiple pictures per frame. Interlacing reduces the bandwidth required for transmitting a video, but can result in blurred images and flickering.\u003c/p\u003e \u003cp\u003eValid values include \u003ccode\u003eProgressive\u003c/code\u003e (no interlacing, top to bottom), \u003ccode\u003eTopFirst\u003c/code\u003e (top field first), \u003ccode\u003eBottomFirst\u003c/code\u003e (bottom field first), and \u003ccode\u003eAuto\u003c/code\u003e.\u003c/p\u003e \u003cp\u003eIf \u003ccode\u003eInterlaceMode\u003c/code\u003e is not specified, Elastic Transcoder uses \u003ccode\u003eProgressive\u003c/code\u003e for the output. If \u003ccode\u003eAuto\u003c/code\u003e is specified, Elastic Transcoder interlaces the output.\u003c/p\u003e \u003cp\u003e \u003cb\u003eColorSpaceConversionMode (Optional, H.264/MPEG2 Only)\u003c/b\u003e \u003c/p\u003e \u003cp\u003eThe color space conversion Elastic Transcoder applies to the output video. Color spaces are the algorithms used by the computer to store information about how to render color. \u003ccode\u003eBt.601\u003c/code\u003e is the standard for standard definition video, while \u003ccode\u003eBt.709\u003c/code\u003e is the standard for high definition video.\u003c/p\u003e \u003cp\u003eValid values include \u003ccode\u003eNone\u003c/code\u003e, \u003ccode\u003eBt709toBt601\u003c/code\u003e, \u003ccode\u003eBt601toBt709\u003c/code\u003e, and \u003ccode\u003eAuto\u003c/code\u003e.\u003c/p\u003e \u003cp\u003eIf you chose \u003ccode\u003eAuto\u003c/code\u003e for \u003ccode\u003eColorSpaceConversionMode\u003c/code\u003e and your output is interlaced, your frame rate is one of \u003ccode\u003e23.97\u003c/code\u003e, \u003ccode\u003e24\u003c/code\u003e, \u003ccode\u003e25\u003c/code\u003e, \u003ccode\u003e29.97\u003c/code\u003e, \u003ccode\u003e50\u003c/code\u003e, or \u003ccode\u003e60\u003c/code\u003e, your \u003ccode\u003eSegmentDuration\u003c/code\u003e is null, and you are using one of the resolution changes from the list below, Elastic Transcoder applies the following color space conversions:\u003c/p\u003e \u003cul\u003e \u003cli\u003e \u003cp\u003e \u003ci\u003eStandard to HD, 720x480 to 1920x1080\u003c/i\u003e - Elastic Transcoder applies \u003ccode\u003eBt601ToBt709\u003c/code\u003e \u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e \u003ci\u003eStandard to HD, 720x576 to 1920x1080\u003c/i\u003e - Elastic Transcoder applies \u003ccode\u003eBt601ToBt709\u003c/code\u003e \u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e \u003ci\u003eHD to Standard, 1920x1080 to 720x480\u003c/i\u003e - Elastic Transcoder applies \u003ccode\u003eBt709ToBt601\u003c/code\u003e \u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e \u003ci\u003eHD to Standard, 1920x1080 to 720x576\u003c/i\u003e - Elastic Transcoder applies \u003ccode\u003eBt709ToBt601\u003c/code\u003e \u003c/p\u003e \u003c/li\u003e \u003c/ul\u003e \u003cnote\u003e \u003cp\u003eElastic Transcoder may change the behavior of the \u003ccode\u003eColorspaceConversionMode\u003c/code\u003e \u003ccode\u003eAuto\u003c/code\u003e mode in the future. All outputs in a playlist must use the same \u003ccode\u003eColorSpaceConversionMode\u003c/code\u003e.\u003c/p\u003e \u003c/note\u003e \u003cp\u003eIf you do not specify a \u003ccode\u003eColorSpaceConversionMode\u003c/code\u003e, Elastic Transcoder does not change the color space of a file. If you are unsure what \u003ccode\u003eColorSpaceConversionMode\u003c/code\u003e was applied to your output file, you can check the \u003ccode\u003eAppliedColorSpaceConversion\u003c/code\u003e parameter included in your job response. If your job does not have an \u003ccode\u003eAppliedColorSpaceConversion\u003c/code\u003e in its response, no \u003ccode\u003eColorSpaceConversionMode\u003c/code\u003e was applied.\u003c/p\u003e \u003cp\u003e \u003cb\u003eChromaSubsampling\u003c/b\u003e \u003c/p\u003e \u003cp\u003eThe sampling pattern for the chroma (color) channels of the output video. Valid values include \u003ccode\u003eyuv420p\u003c/code\u003e and \u003ccode\u003eyuv422p\u003c/code\u003e.\u003c/p\u003e \u003cp\u003e \u003ccode\u003eyuv420p\u003c/code\u003e samples the chroma information of every other horizontal and every other vertical line, \u003ccode\u003eyuv422p\u003c/code\u003e samples the color information of every horizontal line and every other vertical line.\u003c/p\u003e \u003cp\u003e \u003cb\u003eLoopCount (Gif Only)\u003c/b\u003e \u003c/p\u003e \u003cp\u003eThe number of times you want the output gif to loop. Valid values include \u003ccode\u003eInfinite\u003c/code\u003e and integers between \u003ccode\u003e0\u003c/code\u003e and \u003ccode\u003e100\u003c/code\u003e, inclusive.\u003c/p\u003e",
	"definitions.VideoParameters.properties.DisplayAspectRatio.$ref": "#/definitions/AspectRatio",
	"definitions.VideoParameters.properties.DisplayAspectRatio.description": "The value that Elastic Transcoder adds to the metadata in the output file.",
	"definitions.VideoParameters.properties.FixedGOP.$ref": "#/definitions/FixedGOP",
	"definitions.VideoParameters.properties.FixedGOP.description": "\u003cp\u003eApplicable only when the value of Video:Codec is one of \u003ccode\u003eH.264\u003c/code\u003e, \u003ccode\u003eMPEG2\u003c/code\u003e, or \u003ccode\u003eVP8\u003c/code\u003e.\u003c/p\u003e \u003cp\u003eWhether to use a fixed value for \u003ccode\u003eFixedGOP\u003c/code\u003e. Valid values are \u003ccode\u003etrue\u003c/code\u003e and \u003ccode\u003efalse\u003c/code\u003e:\u003c/p\u003e \u003cul\u003e \u003cli\u003e \u003cp\u003e \u003ccode\u003etrue\u003c/code\u003e: Elastic Transcoder uses the value of \u003ccode\u003eKeyframesMaxDist\u003c/code\u003e for the distance between key frames (the number of frames in a group of pictures, or GOP).\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e \u003ccode\u003efalse\u003c/code\u003e: The distance between key frames can vary.\u003c/p\u003e \u003c/li\u003e \u003c/ul\u003e \u003cimportant\u003e \u003cp\u003e \u003ccode\u003eFixedGOP\u003c/code\u003e must be set to \u003ccode\u003etrue\u003c/code\u003e for \u003ccode\u003efmp4\u003c/code\u003e containers.\u003c/p\u003e \u003c/important\u003e",
	"definitions.VideoParameters.properties.FrameRate.$ref": "#/definitions/FrameRate",
	"definitions.VideoParameters.properties.FrameRate.description": "\u003cp\u003eThe frames per second for the video stream in the output file. Valid values include:\u003c/p\u003e \u003cp\u003e \u003ccode\u003eauto\u003c/code\u003e, \u003ccode\u003e10\u003c/code\u003e, \u003ccode\u003e15\u003c/code\u003e, \u003ccode\u003e23.97\u003c/code\u003e, \u003ccode\u003e24\u003c/code\u003e, \u003ccode\u003e25\u003c/code\u003e, \u003ccode\u003e29.97\u003c/code\u003e, \u003ccode\u003e30\u003c/code\u003e, \u003ccode\u003e60\u003c/code\u003e \u003c/p\u003e \u003cp\u003eIf you specify \u003ccode\u003eauto\u003c/code\u003e, Elastic Transcoder uses the detected frame rate of the input source. If you specify a frame rate, we recommend that you perform the following calculation:\u003c/p\u003e \u003cp\u003e \u003ccode\u003eFrame rate = maximum recommended decoding speed in luma samples/second / (width in pixels * height in pixels)\u003c/code\u003e \u003c/p\u003e \u003cp\u003ewhere:\u003c/p\u003e \u003cul\u003e \u003cli\u003e \u003cp\u003e \u003ci\u003ewidth in pixels\u003c/i\u003e and \u003ci\u003eheight in pixels\u003c/i\u003e represent the Resolution of the output video.\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e \u003ci\u003emaximum recommended decoding speed in Luma samples/second\u003c/i\u003e is less than or equal to the maximum value listed in the following table, based on the value that you specified for Level.\u003c/p\u003e \u003c/li\u003e \u003c/ul\u003e \u003cp\u003eThe maximum recommended decoding speed in Luma samples/second for each level is described in the following list (\u003ci\u003eLevel - Decoding speed\u003c/i\u003e):\u003c/p\u003e \u003cul\u003e \u003cli\u003e \u003cp\u003e1 - 380160\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e1b - 380160\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e1.1 - 76800\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e1.2 - 1536000\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e1.3 - 3041280\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e2 - 3041280\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e2.1 - 5068800\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e2.2 - 5184000\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e3 - 10368000\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e3.1 - 27648000\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e3.2 - 55296000\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e4 - 62914560\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e4.1 - 62914560\u003c/p\u003e \u003c/li\u003e \u003c/ul\u003e",
	"definitions.VideoParameters.properties.KeyframesMaxDist.$ref": "#/definitions/KeyframesMaxDist",
	"definitions.VideoParameters.properties.KeyframesMaxDist.description": "\u003cp\u003eApplicable only when the value of Video:Codec is one of \u003ccode\u003eH.264\u003c/code\u003e, \u003ccode\u003eMPEG2\u003c/code\u003e, or \u003ccode\u003eVP8\u003c/code\u003e.\u003c/p\u003e \u003cp\u003eThe maximum number of frames between key frames. Key frames are fully encoded frames; the frames between key frames are encoded based, in part, on the content of the key frames. The value is an integer formatted as a string; valid values are between 1 (every frame is a key frame) and 100000, inclusive. A higher value results in higher compression but may also discernibly decrease video quality.\u003c/p\u003e \u003cp\u003eFor \u003ccode\u003eSmooth\u003c/code\u003e outputs, the \u003ccode\u003eFrameRate\u003c/code\u003e must have a constant ratio to the \u003ccode\u003eKeyframesMaxDist\u003c/code\u003e. This allows \u003ccode\u003eSmooth\u003c/code\u003e playlists to switch between different quality levels while the file is being played.\u003c/p\u003e \u003cp\u003eFor example, an input file can have a \u003ccode\u003eFrameRate\u003c/code\u003e of 30 with a \u003ccode\u003eKeyframesMaxDist\u003c/code\u003e of 90. The output file then needs to have a ratio of 1:3. Valid outputs would have \u003ccode\u003eFrameRate\u003c/code\u003e of 30, 25, and 10, and \u003ccode\u003eKeyframesMaxDist\u003c/code\u003e of 90, 75, and 30, respectively.\u003c/p\u003e \u003cp\u003eAlternately, this can be achieved by setting \u003ccode\u003eFrameRate\u003c/code\u003e to auto and having the same values for \u003ccode\u003eMaxFrameRate\u003c/code\u003e and \u003ccode\u003eKeyframesMaxDist\u003c/code\u003e.\u003c/p\u003e",
	"definitions.VideoParameters.properties.MaxFrameRate.$ref": "#/definitions/MaxFrameRate",
	"definitions.VideoParameters.properties.MaxFrameRate.description": "If you specify \u003ccode\u003eauto\u003c/code\u003e for \u003ccode\u003eFrameRate\u003c/code\u003e, Elastic Transcoder uses the frame rate of the input video for the frame rate of the output video. Specify the maximum frame rate that you want Elastic Transcoder to use when the frame rate of the input video is greater than the desired maximum frame rate of the output video. Valid values include: \u003ccode\u003e10\u003c/code\u003e, \u003ccode\u003e15\u003c/code\u003e, \u003ccode\u003e23.97\u003c/code\u003e, \u003ccode\u003e24\u003c/code\u003e, \u003ccode\u003e25\u003c/code\u003e, \u003ccode\u003e29.97\u003c/code\u003e, \u003ccode\u003e30\u003c/code\u003e, \u003ccode\u003e60\u003c/code\u003e.",
	"definitions.VideoParameters.properties.MaxHeight.$ref": "#/definitions/DigitsOrAuto",
	"definitions.VideoParameters.properties.MaxHeight.description": "The maximum height of the output video in pixels. If you specify \u003ccode\u003eauto\u003c/code\u003e, Elastic Transcoder uses 1080 (Full HD) as the default value. If you specify a numeric value, enter an even integer between 96 and 3072.",
	"definitions.VideoParameters.properties.MaxWidth.$ref": "#/definitions/DigitsOrAuto",
	"definitions.VideoParameters.properties.MaxWidth.description": " The maximum width of the output video in pixels. If you specify \u003ccode\u003eauto\u003c/code\u003e, Elastic Transcoder uses 1920 (Full HD) as the default value. If you specify a numeric value, enter an even integer between 128 and 4096. ",
	"definitions.VideoParameters.properties.PaddingPolicy.$ref": "#/definitions/PaddingPolicy",
	"definitions.VideoParameters.properties.PaddingPolicy.description": "When you set \u003ccode\u003ePaddingPolicy\u003c/code\u003e to \u003ccode\u003ePad\u003c/code\u003e, Elastic Transcoder may add black bars to the top and bottom and/or left and right sides of the output video to make the total size of the output video match the values that you specified for \u003ccode\u003eMaxWidth\u003c/code\u003e and \u003ccode\u003eMaxHeight\u003c/code\u003e.",
	"definitions.VideoParameters.properties.Resolution.$ref": "#/definitions/Resolution",
	"definitions.VideoParameters.properties.Resolution.description": "\u003cimportant\u003e \u003cp\u003eTo better control resolution and aspect ratio of output videos, we recommend that you use the values \u003ccode\u003eMaxWidth\u003c/code\u003e, \u003ccode\u003eMaxHeight\u003c/code\u003e, \u003ccode\u003eSizingPolicy\u003c/code\u003e, \u003ccode\u003ePaddingPolicy\u003c/code\u003e, and \u003ccode\u003eDisplayAspectRatio\u003c/code\u003e instead of \u003ccode\u003eResolution\u003c/code\u003e and \u003ccode\u003eAspectRatio\u003c/code\u003e. The two groups of settings are mutually exclusive. Do not use them together.\u003c/p\u003e \u003c/important\u003e \u003cp\u003eThe width and height of the video in the output file, in pixels. Valid values are \u003ccode\u003eauto\u003c/code\u003e and \u003ci\u003ewidth\u003c/i\u003e x \u003ci\u003eheight\u003c/i\u003e:\u003c/p\u003e \u003cul\u003e \u003cli\u003e \u003cp\u003e \u003ccode\u003eauto\u003c/code\u003e: Elastic Transcoder attempts to preserve the width and height of the input file, subject to the following rules.\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e \u003ccode\u003e \u003ci\u003ewidth\u003c/i\u003e x \u003ci\u003eheight\u003c/i\u003e \u003c/code\u003e: The width and height of the output video in pixels.\u003c/p\u003e \u003c/li\u003e \u003c/ul\u003e \u003cp\u003eNote the following about specifying the width and height:\u003c/p\u003e \u003cul\u003e \u003cli\u003e \u003cp\u003eThe width must be an even integer between 128 and 4096, inclusive.\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003eThe height must be an even integer between 96 and 3072, inclusive.\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003eIf you specify a resolution that is less than the resolution of the input file, Elastic Transcoder rescales the output file to the lower resolution.\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003eIf you specify a resolution that is greater than the resolution of the input file, Elastic Transcoder rescales the output to the higher resolution.\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003eWe recommend that you specify a resolution for which the product of width and height is less than or equal to the applicable value in the following list (\u003ci\u003eList - Max width x height value\u003c/i\u003e):\u003c/p\u003e \u003cul\u003e \u003cli\u003e \u003cp\u003e1 - 25344\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e1b - 25344\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e1.1 - 101376\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e1.2 - 101376\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e1.3 - 101376\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e2 - 101376\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e2.1 - 202752\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e2.2 - 404720\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e3 - 404720\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e3.1 - 921600\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e3.2 - 1310720\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e4 - 2097152\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e4.1 - 2097152\u003c/p\u003e \u003c/li\u003e \u003c/ul\u003e \u003c/li\u003e \u003c/ul\u003e",
	"definitions.VideoParameters.properties.SizingPolicy.$ref": "#/definitions/SizingPolicy",
	"definitions.VideoParameters.properties.SizingPolicy.description": "\u003cp\u003eSpecify one of the following values to control scaling of the output video:\u003c/p\u003e \u003cul\u003e \u003cli\u003e \u003cp\u003e \u003ccode\u003eFit\u003c/code\u003e: Elastic Transcoder scales the output video so it matches the value that you specified in either \u003ccode\u003eMaxWidth\u003c/code\u003e or \u003ccode\u003eMaxHeight\u003c/code\u003e without exceeding the other value.\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e \u003ccode\u003eFill\u003c/code\u003e: Elastic Transcoder scales the output video so it matches the value that you specified in either \u003ccode\u003eMaxWidth\u003c/code\u003e or \u003ccode\u003eMaxHeight\u003c/code\u003e and matches or exceeds the other value. Elastic Transcoder centers the output video and then crops it in the dimension (if any) that exceeds the maximum value.\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e \u003ccode\u003eStretch\u003c/code\u003e: Elastic Transcoder stretches the output video to match the values that you specified for \u003ccode\u003eMaxWidth\u003c/code\u003e and \u003ccode\u003eMaxHeight\u003c/code\u003e. If the relative proportions of the input video and the output video are different, the output video will be distorted.\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e \u003ccode\u003eKeep\u003c/code\u003e: Elastic Transcoder does not scale the output video. If either dimension of the input video exceeds the values that you specified for \u003ccode\u003eMaxWidth\u003c/code\u003e and \u003ccode\u003eMaxHeight\u003c/code\u003e, Elastic Transcoder crops the output video.\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e \u003ccode\u003eShrinkToFit\u003c/code\u003e: Elastic Transcoder scales the output video down so that its dimensions match the values that you specified for at least one of \u003ccode\u003eMaxWidth\u003c/code\u003e and \u003ccode\u003eMaxHeight\u003c/code\u003e without exceeding either value. If you specify this option, Elastic Transcoder does not scale the video up.\u003c/p\u003e \u003c/li\u003e \u003cli\u003e \u003cp\u003e \u003ccode\u003eShrinkToFill\u003c/code\u003e: Elastic Transcoder scales the output video down so that its dimensions match the values that you specified for at least one of \u003ccode\u003eMaxWidth\u003c/code\u003e and \u003ccode\u003eMaxHeight\u003c/code\u003e without dropping below either value. If you specify this option, Elastic Transcoder does not scale the video up.\u003c/p\u003e \u003c/li\u003e \u003c/ul\u003e",
	"definitions.VideoParameters.properties.Watermarks.$ref": "#/definitions/PresetWatermarks",
	"definitions.VideoParameters.properties.Watermarks.description": "\u003cp\u003eSettings for the size, location, and opacity of graphics that you want Elastic Transcoder to overlay over videos that are transcoded using this preset. You can specify settings for up to four watermarks. Watermarks appear in the specified size and location, and with the specified opacity for the duration of the transcoded video.\u003c/p\u003e \u003cp\u003eWatermarks can be in .png or .jpg format. If you want to display a watermark that is not rectangular, use the .png format, which supports transparency.\u003c/p\u003e \u003cp\u003eWhen you create a job that uses this preset, you specify the .png or .jpg graphics that you want Elastic Transcoder to include in the transcoded videos. You can specify fewer graphics in the job than you specify watermark settings in the preset, which allows you to use the same preset for up to four watermarks that have different dimensions.\u003c/p\u003e",
	"definitions.VideoParameters.type": "object",
	"definitions.Warning.description": "\u003cp\u003eElastic Transcoder returns a warning if the resources used by your pipeline are not in the same region as the pipeline.\u003c/p\u003e \u003cp\u003eUsing resources in the same region, such as your Amazon S3 buckets, Amazon SNS notification topics, and AWS KMS key, reduces processing time and prevents cross-regional charges.\u003c/p\u003e",
	"definitions.Warning.properties.Code.$ref": "#/definitions/String",
	"definitions.Warning.properties.Code.description": "The code of the cross-regional warning.",
	"definitions.Warning.properties.Message.$ref": "#/definitions/String",
	"definitions.Warning.properties.Message.description": "\u003cp\u003eThe message explaining what resources are in a different region from the pipeline.\u003c/p\u003e \u003cnote\u003e \u003cp\u003eAWS KMS keys must be in the same region as the pipeline.\u003c/p\u003e \u003c/note\u003e",
	"definitions.Warning.type": "object",
	"definitions.Warnings.items.$ref": "#/definitions/Warning",
	"definitions.Warnings.type": "array",
	"definitions.WatermarkKey.maxLength": 1024,
	"definitions.WatermarkKey.minLength": 1,
	"definitions.WatermarkKey.pattern": "(^.{1,1020}.jpg$)|(^.{1,1019}.jpeg$)|(^.{1,1020}.png$)",
	"definitions.WatermarkKey.type": "string",
	"definitions.WatermarkSizingPolicy.pattern": "(^Fit$)|(^Stretch$)|(^ShrinkToFit$)",
	"definitions.WatermarkSizingPolicy.type": "string",
	"definitions.ZeroTo255String.maxLength": 255,
	"definitions.ZeroTo255String.minLength": 0,
	"definitions.ZeroTo255String.type": "string",
	"definitions.ZeroTo512String.maxLength": 512,
	"definitions.ZeroTo512String.minLength": 0,
	"definitions.ZeroTo512String.type": "string",
	"externalDocs.description": "Amazon Web Services documentation",
	"externalDocs.url": "https://aws.amazon.com/elastictranscoder/",
	"host": "elastictranscoder.amazonaws.com",
	"info.contact.email": "mike.ralphson@gmail.com",
	"info.contact.name": "Mike Ralphson",
	"info.contact.url": "https://github.com/mermade/aws2openapi",
	"info.description": "\u003cfullname\u003eAWS Elastic Transcoder Service\u003c/fullname\u003e \u003cp\u003eThe AWS Elastic Transcoder Service.\u003c/p\u003e",
	"info.license.name": "Apache 2.0 License",
	"info.license.url": "http://www.apache.org/licenses/",
	"info.termsOfService": "https://aws.amazon.com/service-terms/",
	"info.title": "Amazon Elastic Transcoder",
	"info.version": "2012-09-25",
	"info.x-apiClientRegistration.url": "https://portal.aws.amazon.com/gp/aws/developer/registration/index.html?nc2=h_ct",
	"info.x-apisguru-categories.length": 1,
	"info.x-apisguru-categories[0]": "cloud",
	"info.x-logo.backgroundColor": "#FFFFFF",
	"info.x-logo.url": "https://api.apis.guru/v2/cache/logo/https_media.amazonwebservices.com_blog_2007_big_pbaws_logo_300px.jpg",
	"info.x-origin.length": 1,
	"info.x-origin[0].contentType": "application/json",
	"info.x-origin[0].converter.url": "https://github.com/mermade/aws2openapi",
	"info.x-origin[0].converter.version": "1.0.0",
	"info.x-origin[0].url": "https://raw.githubusercontent.com/aws/aws-sdk-js/master/apis/elastictranscoder-2012-09-25.normal.json",
	"info.x-origin[0].x-apisguru-direct": true,
	"info.x-preferred": true,
	"info.x-providerName": "amazonaws.com",
	"info.x-release": "v4",
	"info.x-serviceName": "elastictranscoder",
	"parameters.Action.in": "header",
	"parameters.Action.name": "Action",
	"parameters.Action.required": true,
	"parameters.Action.type": "string",
	"parameters.Version.in": "header",
	"parameters.Version.name": "Version",
	"parameters.Version.required": true,
	"parameters.Version.type": "string",
	"parameters.X-Amz-Algorithm.in": "header",
	"parameters.X-Amz-Algorithm.name": "X-Amz-Algorithm",
	"parameters.X-Amz-Algorithm.required": false,
	"parameters.X-Amz-Algorithm.type": "string",
	"parameters.X-Amz-Content-Sha256.in": "header",
	"parameters.X-Amz-Content-Sha256.name": "X-Amz-Content-Sha256",
	"parameters.X-Amz-Content-Sha256.required": false,
	"parameters.X-Amz-Content-Sha256.type": "string",
	"parameters.X-Amz-Credential.in": "header",
	"parameters.X-Amz-Credential.name": "X-Amz-Credential",
	"parameters.X-Amz-Credential.required": false,
	"parameters.X-Amz-Credential.type": "string",
	"parameters.X-Amz-Date.in": "header",
	"parameters.X-Amz-Date.name": "X-Amz-Date",
	"parameters.X-Amz-Date.required": false,
	"parameters.X-Amz-Date.type": "string",
	"parameters.X-Amz-Security-Token.in": "header",
	"parameters.X-Amz-Security-Token.name": "X-Amz-Security-Token",
	"parameters.X-Amz-Security-Token.required": false,
	"parameters.X-Amz-Security-Token.type": "string",
	"parameters.X-Amz-Signature.in": "header",
	"parameters.X-Amz-Signature.name": "X-Amz-Signature",
	"parameters.X-Amz-Signature.required": false,
	"parameters.X-Amz-Signature.type": "string",
	"parameters.X-Amz-SignedHeaders.in": "header",
	"parameters.X-Amz-SignedHeaders.name": "X-Amz-SignedHeaders",
	"parameters.X-Amz-SignedHeaders.required": false,
	"parameters.X-Amz-SignedHeaders.type": "string",
	"paths./2012-09-25/jobs.parameters.length": 9,
	"paths./2012-09-25/jobs.parameters[0].$ref": "#/parameters/Action",
	"paths./2012-09-25/jobs.parameters[1].$ref": "#/parameters/Version",
	"paths./2012-09-25/jobs.parameters[2].$ref": "#/parameters/X-Amz-Content-Sha256",
	"paths./2012-09-25/jobs.parameters[3].$ref": "#/parameters/X-Amz-Date",
	"paths./2012-09-25/jobs.parameters[4].$ref": "#/parameters/X-Amz-Algorithm",
	"paths./2012-09-25/jobs.parameters[5].$ref": "#/parameters/X-Amz-Credential",
	"paths./2012-09-25/jobs.parameters[6].$ref": "#/parameters/X-Amz-Security-Token",
	"paths./2012-09-25/jobs.parameters[7].$ref": "#/parameters/X-Amz-Signature",
	"paths./2012-09-25/jobs.parameters[8].$ref": "#/parameters/X-Amz-SignedHeaders",
	"paths./2012-09-25/jobs.post.description": "\u003cp\u003eWhen you create a job, Elastic Transcoder returns JSON data that includes the values that you specified plus information about the job that is created.\u003c/p\u003e \u003cp\u003eIf you have specified more than one output for your jobs (for example, one output for the Kindle Fire and another output for the Apple iPhone 4s), you currently must use the Elastic Transcoder API to list the jobs (as opposed to the AWS Console).\u003c/p\u003e",
	"paths./2012-09-25/jobs.post.operationId": "CreateJob",
	"paths./2012-09-25/jobs.post.parameters.length": 1,
	"paths./2012-09-25/jobs.post.parameters[0].in": "body",
	"paths./2012-09-25/jobs.post.parameters[0].name": "body",
	"paths./2012-09-25/jobs.post.parameters[0].required": true,
	"paths./2012-09-25/jobs.post.parameters[0].schema.$ref": "#/definitions/CreateJobRequest",
	"paths./2012-09-25/jobs.post.responses.201.description": "Success",
	"paths./2012-09-25/jobs.post.responses.201.schema.$ref": "#/definitions/CreateJobResponse",
	"paths./2012-09-25/jobs.post.responses.480.description": "ValidationException",
	"paths./2012-09-25/jobs.post.responses.480.schema.$ref": "#/definitions/ValidationException",
	"paths./2012-09-25/jobs.post.responses.481.description": "IncompatibleVersionException",
	"paths./2012-09-25/jobs.post.responses.481.schema.$ref": "#/definitions/IncompatibleVersionException",
	"paths./2012-09-25/jobs.post.responses.482.description": "ResourceNotFoundException",
	"paths./2012-09-25/jobs.post.responses.482.schema.$ref": "#/definitions/ResourceNotFoundException",
	"paths./2012-09-25/jobs.post.responses.483.description": "AccessDeniedException",
	"paths./2012-09-25/jobs.post.responses.483.schema.$ref": "#/definitions/AccessDeniedException",
	"paths./2012-09-25/jobs.post.responses.484.description": "LimitExceededException",
	"paths./2012-09-25/jobs.post.responses.484.schema.$ref": "#/definitions/LimitExceededException",
	"paths./2012-09-25/jobs.post.responses.485.description": "InternalServiceException",
	"paths./2012-09-25/jobs.post.responses.485.schema.$ref": "#/definitions/InternalServiceException",
	"paths./2012-09-25/jobs/{Id}.get.description": "The ReadJob operation returns detailed information about a job.",
	"paths./2012-09-25/jobs/{Id}.get.operationId": "ReadJob",
	"paths./2012-09-25/jobs/{Id}.get.parameters.length": 2,
	"paths./2012-09-25/jobs/{Id}.get.parameters[0].in": "body",
	"paths./2012-09-25/jobs/{Id}.get.parameters[0].name": "body",
	"paths./2012-09-25/jobs/{Id}.get.parameters[0].required": true,
	"paths./2012-09-25/jobs/{Id}.get.parameters[0].schema.$ref": "#/definitions/ReadJobRequest",
	"paths./2012-09-25/jobs/{Id}.get.parameters[1].in": "path",
	"paths./2012-09-25/jobs/{Id}.get.parameters[1].name": "Id",
	"paths./2012-09-25/jobs/{Id}.get.parameters[1].required": true,
	"paths./2012-09-25/jobs/{Id}.get.parameters[1].type": "string",
	"paths./2012-09-25/jobs/{Id}.get.responses.200.description": "Success",
	"paths./2012-09-25/jobs/{Id}.get.responses.200.schema.$ref": "#/definitions/ReadJobResponse",
	"paths./2012-09-25/jobs/{Id}.get.responses.480.description": "ValidationException",
	"paths./2012-09-25/jobs/{Id}.get.responses.480.schema.$ref": "#/definitions/ValidationException",
	"paths./2012-09-25/jobs/{Id}.get.responses.481.description": "IncompatibleVersionException",
	"paths./2012-09-25/jobs/{Id}.get.responses.481.schema.$ref": "#/definitions/IncompatibleVersionException",
	"paths./2012-09-25/jobs/{Id}.get.responses.482.description": "ResourceNotFoundException",
	"paths./2012-09-25/jobs/{Id}.get.responses.482.schema.$ref": "#/definitions/ResourceNotFoundException",
	"paths./2012-09-25/jobs/{Id}.get.responses.483.description": "AccessDeniedException",
	"paths./2012-09-25/jobs/{Id}.get.responses.483.schema.$ref": "#/definitions/AccessDeniedException",
	"paths./2012-09-25/jobs/{Id}.get.responses.484.description": "InternalServiceException",
	"paths./2012-09-25/jobs/{Id}.get.responses.484.schema.$ref": "#/definitions/InternalServiceException",
	"paths./2012-09-25/jobs/{Id}.get.x-waiters.length": 1,
	"paths./2012-09-25/jobs/{Id}.get.x-waiters[0].acceptors.length": 3,
	"paths./2012-09-25/jobs/{Id}.get.x-waiters[0].acceptors[0].argument": "Job.Status",
	"paths./2012-09-25/jobs/{Id}.get.x-waiters[0].acceptors[0].expected": "Complete",
	"paths./2012-09-25/jobs/{Id}.get.x-waiters[0].acceptors[0].matcher": "path",
	"paths./2012-09-25/jobs/{Id}.get.x-waiters[0].acceptors[0].state": "success",
	"paths./2012-09-25/jobs/{Id}.get.x-waiters[0].acceptors[1].argument": "Job.Status",
	"paths./2012-09-25/jobs/{Id}.get.x-waiters[0].acceptors[1].expected": "Canceled",
	"paths./2012-09-25/jobs/{Id}.get.x-waiters[0].acceptors[1].matcher": "path",
	"paths./2012-09-25/jobs/{Id}.get.x-waiters[0].acceptors[1].state": "failure",
	"paths./2012-09-25/jobs/{Id}.get.x-waiters[0].acceptors[2].argument": "Job.Status",
	"paths./2012-09-25/jobs/{Id}.get.x-waiters[0].acceptors[2].expected": "Error",
	"paths./2012-09-25/jobs/{Id}.get.x-waiters[0].acceptors[2].matcher": "path",
	"paths./2012-09-25/jobs/{Id}.get.x-waiters[0].acceptors[2].state": "failure",
	"paths./2012-09-25/jobs/{Id}.get.x-waiters[0].delay": 30,
	"paths./2012-09-25/jobs/{Id}.get.x-waiters[0].maxAttempts": 120,
	"paths./2012-09-25/jobs/{Id}.get.x-waiters[0].operation": "ReadJob",
	"paths./2012-09-25/jobs/{Id}.parameters.length": 9,
	"paths./2012-09-25/jobs/{Id}.parameters[0].$ref": "#/parameters/Action",
	"paths./2012-09-25/jobs/{Id}.parameters[1].$ref": "#/parameters/Version",
	"paths./2012-09-25/jobs/{Id}.parameters[2].$ref": "#/parameters/X-Amz-Content-Sha256",
	"paths./2012-09-25/jobs/{Id}.parameters[3].$ref": "#/parameters/X-Amz-Date",
	"paths./2012-09-25/jobs/{Id}.parameters[4].$ref": "#/parameters/X-Amz-Algorithm",
	"paths./2012-09-25/jobs/{Id}.parameters[5].$ref": "#/parameters/X-Amz-Credential",
	"paths./2012-09-25/jobs/{Id}.parameters[6].$ref": "#/parameters/X-Amz-Security-Token",
	"paths./2012-09-25/jobs/{Id}.parameters[7].$ref": "#/parameters/X-Amz-Signature",
	"paths./2012-09-25/jobs/{Id}.parameters[8].$ref": "#/parameters/X-Amz-SignedHeaders",
	"paths./2012-09-25/jobsByPipeline/{PipelineId}.get.description": "\u003cp\u003eThe ListJobsByPipeline operation gets a list of the jobs currently in a pipeline.\u003c/p\u003e \u003cp\u003eElastic Transcoder returns all of the jobs currently in the specified pipeline. The response body contains one element for each job that satisfies the search criteria.\u003c/p\u003e",
	"paths./2012-09-25/jobsByPipeline/{PipelineId}.get.operationId": "ListJobsByPipeline",
	"paths./2012-09-25/jobsByPipeline/{PipelineId}.get.parameters.length": 3,
	"paths./2012-09-25/jobsByPipeline/{PipelineId}.get.parameters[0].in": "body",
	"paths./2012-09-25/jobsByPipeline/{PipelineId}.get.parameters[0].name": "body",
	"paths./2012-09-25/jobsByPipeline/{PipelineId}.get.parameters[0].required": true,
	"paths./2012-09-25/jobsByPipeline/{PipelineId}.get.parameters[0].schema.$ref": "#/definitions/ListJobsByPipelineRequest",
	"paths./2012-09-25/jobsByPipeline/{PipelineId}.get.parameters[1].description": "Pagination token",
	"paths./2012-09-25/jobsByPipeline/{PipelineId}.get.parameters[1].in": "query",
	"paths./2012-09-25/jobsByPipeline/{PipelineId}.get.parameters[1].name": "PageToken",
	"paths./2012-09-25/jobsByPipeline/{PipelineId}.get.parameters[1].required": false,
	"paths./2012-09-25/jobsByPipeline/{PipelineId}.get.parameters[1].type": "string",
	"paths./2012-09-25/jobsByPipeline/{PipelineId}.get.parameters[2].in": "path",
	"paths./2012-09-25/jobsByPipeline/{PipelineId}.get.parameters[2].name": "PipelineId",
	"paths./2012-09-25/jobsByPipeline/{PipelineId}.get.parameters[2].required": true,
	"paths./2012-09-25/jobsByPipeline/{PipelineId}.get.parameters[2].type": "string",
	"paths./2012-09-25/jobsByPipeline/{PipelineId}.get.responses.200.description": "Success",
	"paths./2012-09-25/jobsByPipeline/{PipelineId}.get.responses.200.schema.$ref": "#/definitions/ListJobsByPipelineResponse",
	"paths./2012-09-25/jobsByPipeline/{PipelineId}.get.responses.480.description": "ValidationException",
	"paths./2012-09-25/jobsByPipeline/{PipelineId}.get.responses.480.schema.$ref": "#/definitions/ValidationException",
	"paths./2012-09-25/jobsByPipeline/{PipelineId}.get.responses.481.description": "IncompatibleVersionException",
	"paths./2012-09-25/jobsByPipeline/{PipelineId}.get.responses.481.schema.$ref": "#/definitions/IncompatibleVersionException",
	"paths./2012-09-25/jobsByPipeline/{PipelineId}.get.responses.482.description": "ResourceNotFoundException",
	"paths./2012-09-25/jobsByPipeline/{PipelineId}.get.responses.482.schema.$ref": "#/definitions/ResourceNotFoundException",
	"paths./2012-09-25/jobsByPipeline/{PipelineId}.get.responses.483.description": "AccessDeniedException",
	"paths./2012-09-25/jobsByPipeline/{PipelineId}.get.responses.483.schema.$ref": "#/definitions/AccessDeniedException",
	"paths./2012-09-25/jobsByPipeline/{PipelineId}.get.responses.484.description": "InternalServiceException",
	"paths./2012-09-25/jobsByPipeline/{PipelineId}.get.responses.484.schema.$ref": "#/definitions/InternalServiceException",
	"paths./2012-09-25/jobsByPipeline/{PipelineId}.parameters.length": 9,
	"paths./2012-09-25/jobsByPipeline/{PipelineId}.parameters[0].$ref": "#/parameters/Action",
	"paths./2012-09-25/jobsByPipeline/{PipelineId}.parameters[1].$ref": "#/parameters/Version",
	"paths./2012-09-25/jobsByPipeline/{PipelineId}.parameters[2].$ref": "#/parameters/X-Amz-Content-Sha256",
	"paths./2012-09-25/jobsByPipeline/{PipelineId}.parameters[3].$ref": "#/parameters/X-Amz-Date",
	"paths./2012-09-25/jobsByPipeline/{PipelineId}.parameters[4].$ref": "#/parameters/X-Amz-Algorithm",
	"paths./2012-09-25/jobsByPipeline/{PipelineId}.parameters[5].$ref": "#/parameters/X-Amz-Credential",
	"paths./2012-09-25/jobsByPipeline/{PipelineId}.parameters[6].$ref": "#/parameters/X-Amz-Security-Token",
	"paths./2012-09-25/jobsByPipeline/{PipelineId}.parameters[7].$ref": "#/parameters/X-Amz-Signature",
	"paths./2012-09-25/jobsByPipeline/{PipelineId}.parameters[8].$ref": "#/parameters/X-Amz-SignedHeaders",
	"paths./2012-09-25/jobsByStatus/{Status}.get.description": "The ListJobsByStatus operation gets a list of jobs that have a specified status. The response body contains one element for each job that satisfies the search criteria.",
	"paths./2012-09-25/jobsByStatus/{Status}.get.operationId": "ListJobsByStatus",
	"paths./2012-09-25/jobsByStatus/{Status}.get.parameters.length": 3,
	"paths./2012-09-25/jobsByStatus/{Status}.get.parameters[0].in": "body",
	"paths./2012-09-25/jobsByStatus/{Status}.get.parameters[0].name": "body",
	"paths./2012-09-25/jobsByStatus/{Status}.get.parameters[0].required": true,
	"paths./2012-09-25/jobsByStatus/{Status}.get.parameters[0].schema.$ref": "#/definitions/ListJobsByStatusRequest",
	"paths./2012-09-25/jobsByStatus/{Status}.get.parameters[1].description": "Pagination token",
	"paths./2012-09-25/jobsByStatus/{Status}.get.parameters[1].in": "query",
	"paths./2012-09-25/jobsByStatus/{Status}.get.parameters[1].name": "PageToken",
	"paths./2012-09-25/jobsByStatus/{Status}.get.parameters[1].required": false,
	"paths./2012-09-25/jobsByStatus/{Status}.get.parameters[1].type": "string",
	"paths./2012-09-25/jobsByStatus/{Status}.get.parameters[2].in": "path",
	"paths./2012-09-25/jobsByStatus/{Status}.get.parameters[2].name": "Status",
	"paths./2012-09-25/jobsByStatus/{Status}.get.parameters[2].required": true,
	"paths./2012-09-25/jobsByStatus/{Status}.get.parameters[2].type": "string",
	"paths./2012-09-25/jobsByStatus/{Status}.get.responses.200.description": "Success",
	"paths./2012-09-25/jobsByStatus/{Status}.get.responses.200.schema.$ref": "#/definitions/ListJobsByStatusResponse",
	"paths./2012-09-25/jobsByStatus/{Status}.get.responses.480.description": "ValidationException",
	"paths./2012-09-25/jobsByStatus/{Status}.get.responses.480.schema.$ref": "#/definitions/ValidationException",
	"paths./2012-09-25/jobsByStatus/{Status}.get.responses.481.description": "IncompatibleVersionException",
	"paths./2012-09-25/jobsByStatus/{Status}.get.responses.481.schema.$ref": "#/definitions/IncompatibleVersionException",
	"paths./2012-09-25/jobsByStatus/{Status}.get.responses.482.description": "ResourceNotFoundException",
	"paths./2012-09-25/jobsByStatus/{Status}.get.responses.482.schema.$ref": "#/definitions/ResourceNotFoundException",
	"paths./2012-09-25/jobsByStatus/{Status}.get.responses.483.description": "AccessDeniedException",
	"paths./2012-09-25/jobsByStatus/{Status}.get.responses.483.schema.$ref": "#/definitions/AccessDeniedException",
	"paths./2012-09-25/jobsByStatus/{Status}.get.responses.484.description": "InternalServiceException",
	"paths./2012-09-25/jobsByStatus/{Status}.get.responses.484.schema.$ref": "#/definitions/InternalServiceException",
	"paths./2012-09-25/jobsByStatus/{Status}.parameters.length": 9,
	"paths./2012-09-25/jobsByStatus/{Status}.parameters[0].$ref": "#/parameters/Action",
	"paths./2012-09-25/jobsByStatus/{Status}.parameters[1].$ref": "#/parameters/Version",
	"paths./2012-09-25/jobsByStatus/{Status}.parameters[2].$ref": "#/parameters/X-Amz-Content-Sha256",
	"paths./2012-09-25/jobsByStatus/{Status}.parameters[3].$ref": "#/parameters/X-Amz-Date",
	"paths./2012-09-25/jobsByStatus/{Status}.parameters[4].$ref": "#/parameters/X-Amz-Algorithm",
	"paths./2012-09-25/jobsByStatus/{Status}.parameters[5].$ref": "#/parameters/X-Amz-Credential",
	"paths./2012-09-25/jobsByStatus/{Status}.parameters[6].$ref": "#/parameters/X-Amz-Security-Token",
	"paths./2012-09-25/jobsByStatus/{Status}.parameters[7].$ref": "#/parameters/X-Amz-Signature",
	"paths./2012-09-25/jobsByStatus/{Status}.parameters[8].$ref": "#/parameters/X-Amz-SignedHeaders",
	"paths./2012-09-25/pipelines.get.description": "The ListPipelines operation gets a list of the pipelines associated with the current AWS account.",
	"paths./2012-09-25/pipelines.get.operationId": "ListPipelines",
	"paths./2012-09-25/pipelines.get.parameters.length": 2,
	"paths./2012-09-25/pipelines.get.parameters[0].in": "body",
	"paths./2012-09-25/pipelines.get.parameters[0].name": "body",
	"paths./2012-09-25/pipelines.get.parameters[0].required": true,
	"paths./2012-09-25/pipelines.get.parameters[0].schema.$ref": "#/definitions/ListPipelinesRequest",
	"paths./2012-09-25/pipelines.get.parameters[1].description": "Pagination token",
	"paths./2012-09-25/pipelines.get.parameters[1].in": "query",
	"paths./2012-09-25/pipelines.get.parameters[1].name": "PageToken",
	"paths./2012-09-25/pipelines.get.parameters[1].required": false,
	"paths./2012-09-25/pipelines.get.parameters[1].type": "string",
	"paths./2012-09-25/pipelines.get.responses.200.description": "Success",
	"paths./2012-09-25/pipelines.get.responses.200.schema.$ref": "#/definitions/ListPipelinesResponse",
	"paths./2012-09-25/pipelines.get.responses.480.description": "ValidationException",
	"paths./2012-09-25/pipelines.get.responses.480.schema.$ref": "#/definitions/ValidationException",
	"paths./2012-09-25/pipelines.get.responses.481.description": "IncompatibleVersionException",
	"paths./2012-09-25/pipelines.get.responses.481.schema.$ref": "#/definitions/IncompatibleVersionException",
	"paths./2012-09-25/pipelines.get.responses.482.description": "AccessDeniedException",
	"paths./2012-09-25/pipelines.get.responses.482.schema.$ref": "#/definitions/AccessDeniedException",
	"paths./2012-09-25/pipelines.get.responses.483.description": "InternalServiceException",
	"paths./2012-09-25/pipelines.get.responses.483.schema.$ref": "#/definitions/InternalServiceException",
	"paths./2012-09-25/pipelines.parameters.length": 9,
	"paths./2012-09-25/pipelines.parameters[0].$ref": "#/parameters/Action",
	"paths./2012-09-25/pipelines.parameters[1].$ref": "#/parameters/Version",
	"paths./2012-09-25/pipelines.parameters[2].$ref": "#/parameters/X-Amz-Content-Sha256",
	"paths./2012-09-25/pipelines.parameters[3].$ref": "#/parameters/X-Amz-Date",
	"paths./2012-09-25/pipelines.parameters[4].$ref": "#/parameters/X-Amz-Algorithm",
	"paths./2012-09-25/pipelines.parameters[5].$ref": "#/parameters/X-Amz-Credential",
	"paths./2012-09-25/pipelines.parameters[6].$ref": "#/parameters/X-Amz-Security-Token",
	"paths./2012-09-25/pipelines.parameters[7].$ref": "#/parameters/X-Amz-Signature",
	"paths./2012-09-25/pipelines.parameters[8].$ref": "#/parameters/X-Amz-SignedHeaders",
	"paths./2012-09-25/pipelines/{Id}.parameters.length": 9,
	"paths./2012-09-25/pipelines/{Id}.parameters[0].$ref": "#/parameters/Action",
	"paths./2012-09-25/pipelines/{Id}.parameters[1].$ref": "#/parameters/Version",
	"paths./2012-09-25/pipelines/{Id}.parameters[2].$ref": "#/parameters/X-Amz-Content-Sha256",
	"paths./2012-09-25/pipelines/{Id}.parameters[3].$ref": "#/parameters/X-Amz-Date",
	"paths./2012-09-25/pipelines/{Id}.parameters[4].$ref": "#/parameters/X-Amz-Algorithm",
	"paths./2012-09-25/pipelines/{Id}.parameters[5].$ref": "#/parameters/X-Amz-Credential",
	"paths./2012-09-25/pipelines/{Id}.parameters[6].$ref": "#/parameters/X-Amz-Security-Token",
	"paths./2012-09-25/pipelines/{Id}.parameters[7].$ref": "#/parameters/X-Amz-Signature",
	"paths./2012-09-25/pipelines/{Id}.parameters[8].$ref": "#/parameters/X-Amz-SignedHeaders",
	"paths./2012-09-25/pipelines/{Id}.put.description": "\u003cp\u003e Use the \u003ccode\u003eUpdatePipeline\u003c/code\u003e operation to update settings for a pipeline.\u003c/p\u003e \u003cimportant\u003e \u003cp\u003eWhen you change pipeline settings, your changes take effect immediately. Jobs that you have already submitted and that Elastic Transcoder has not started to process are affected in addition to jobs that you submit after you change settings. \u003c/p\u003e \u003c/important\u003e",
	"paths./2012-09-25/pipelines/{Id}.put.operationId": "UpdatePipeline",
	"paths./2012-09-25/pipelines/{Id}.put.parameters.length": 2,
	"paths./2012-09-25/pipelines/{Id}.put.parameters[0].in": "body",
	"paths./2012-09-25/pipelines/{Id}.put.parameters[0].name": "body",
	"paths./2012-09-25/pipelines/{Id}.put.parameters[0].required": true,
	"paths./2012-09-25/pipelines/{Id}.put.parameters[0].schema.$ref": "#/definitions/UpdatePipelineRequest",
	"paths./2012-09-25/pipelines/{Id}.put.parameters[1].in": "path",
	"paths./2012-09-25/pipelines/{Id}.put.parameters[1].name": "Id",
	"paths./2012-09-25/pipelines/{Id}.put.parameters[1].required": true,
	"paths./2012-09-25/pipelines/{Id}.put.parameters[1].type": "string",
	"paths./2012-09-25/pipelines/{Id}.put.responses.200.description": "Success",
	"paths./2012-09-25/pipelines/{Id}.put.responses.200.schema.$ref": "#/definitions/UpdatePipelineResponse",
	"paths./2012-09-25/pipelines/{Id}.put.responses.480.description": "ValidationException",
	"paths./2012-09-25/pipelines/{Id}.put.responses.480.schema.$ref": "#/definitions/ValidationException",
	"paths./2012-09-25/pipelines/{Id}.put.responses.481.description": "IncompatibleVersionException",
	"paths./2012-09-25/pipelines/{Id}.put.responses.481.schema.$ref": "#/definitions/IncompatibleVersionException",
	"paths./2012-09-25/pipelines/{Id}.put.responses.482.description": "AccessDeniedException",
	"paths./2012-09-25/pipelines/{Id}.put.responses.482.schema.$ref": "#/definitions/AccessDeniedException",
	"paths./2012-09-25/pipelines/{Id}.put.responses.483.description": "ResourceInUseException",
	"paths./2012-09-25/pipelines/{Id}.put.responses.483.schema.$ref": "#/definitions/ResourceInUseException",
	"paths./2012-09-25/pipelines/{Id}.put.responses.484.description": "ResourceNotFoundException",
	"paths./2012-09-25/pipelines/{Id}.put.responses.484.schema.$ref": "#/definitions/ResourceNotFoundException",
	"paths./2012-09-25/pipelines/{Id}.put.responses.485.description": "InternalServiceException",
	"paths./2012-09-25/pipelines/{Id}.put.responses.485.schema.$ref": "#/definitions/InternalServiceException",
	"paths./2012-09-25/pipelines/{Id}/notifications.parameters.length": 9,
	"paths./2012-09-25/pipelines/{Id}/notifications.parameters[0].$ref": "#/parameters/Action",
	"paths./2012-09-25/pipelines/{Id}/notifications.parameters[1].$ref": "#/parameters/Version",
	"paths./2012-09-25/pipelines/{Id}/notifications.parameters[2].$ref": "#/parameters/X-Amz-Content-Sha256",
	"paths./2012-09-25/pipelines/{Id}/notifications.parameters[3].$ref": "#/parameters/X-Amz-Date",
	"paths./2012-09-25/pipelines/{Id}/notifications.parameters[4].$ref": "#/parameters/X-Amz-Algorithm",
	"paths./2012-09-25/pipelines/{Id}/notifications.parameters[5].$ref": "#/parameters/X-Amz-Credential",
	"paths./2012-09-25/pipelines/{Id}/notifications.parameters[6].$ref": "#/parameters/X-Amz-Security-Token",
	"paths./2012-09-25/pipelines/{Id}/notifications.parameters[7].$ref": "#/parameters/X-Amz-Signature",
	"paths./2012-09-25/pipelines/{Id}/notifications.parameters[8].$ref": "#/parameters/X-Amz-SignedHeaders",
	"paths./2012-09-25/pipelines/{Id}/notifications.post.description": "\u003cp\u003eWith the UpdatePipelineNotifications operation, you can update Amazon Simple Notification Service (Amazon SNS) notifications for a pipeline.\u003c/p\u003e \u003cp\u003eWhen you update notifications for a pipeline, Elastic Transcoder returns the values that you specified in the request.\u003c/p\u003e",
	"paths./2012-09-25/pipelines/{Id}/notifications.post.operationId": "UpdatePipelineNotifications",
	"paths./2012-09-25/pipelines/{Id}/notifications.post.parameters.length": 2,
	"paths./2012-09-25/pipelines/{Id}/notifications.post.parameters[0].in": "body",
	"paths./2012-09-25/pipelines/{Id}/notifications.post.parameters[0].name": "body",
	"paths./2012-09-25/pipelines/{Id}/notifications.post.parameters[0].required": true,
	"paths./2012-09-25/pipelines/{Id}/notifications.post.parameters[0].schema.$ref": "#/definitions/UpdatePipelineNotificationsRequest",
	"paths./2012-09-25/pipelines/{Id}/notifications.post.parameters[1].in": "path",
	"paths./2012-09-25/pipelines/{Id}/notifications.post.parameters[1].name": "Id",
	"paths./2012-09-25/pipelines/{Id}/notifications.post.parameters[1].required": true,
	"paths./2012-09-25/pipelines/{Id}/notifications.post.parameters[1].type": "string",
	"paths./2012-09-25/pipelines/{Id}/notifications.post.responses.200.description": "Success",
	"paths./2012-09-25/pipelines/{Id}/notifications.post.responses.200.schema.$ref": "#/definitions/UpdatePipelineNotificationsResponse",
	"paths./2012-09-25/pipelines/{Id}/notifications.post.responses.480.description": "ValidationException",
	"paths./2012-09-25/pipelines/{Id}/notifications.post.responses.480.schema.$ref": "#/definitions/ValidationException",
	"paths./2012-09-25/pipelines/{Id}/notifications.post.responses.481.description": "IncompatibleVersionException",
	"paths./2012-09-25/pipelines/{Id}/notifications.post.responses.481.schema.$ref": "#/definitions/IncompatibleVersionException",
	"paths./2012-09-25/pipelines/{Id}/notifications.post.responses.482.description": "ResourceNotFoundException",
	"paths./2012-09-25/pipelines/{Id}/notifications.post.responses.482.schema.$ref": "#/definitions/ResourceNotFoundException",
	"paths./2012-09-25/pipelines/{Id}/notifications.post.responses.483.description": "ResourceInUseException",
	"paths./2012-09-25/pipelines/{Id}/notifications.post.responses.483.schema.$ref": "#/definitions/ResourceInUseException",
	"paths./2012-09-25/pipelines/{Id}/notifications.post.responses.484.description": "AccessDeniedException",
	"paths./2012-09-25/pipelines/{Id}/notifications.post.responses.484.schema.$ref": "#/definitions/AccessDeniedException",
	"paths./2012-09-25/pipelines/{Id}/notifications.post.responses.485.description": "InternalServiceException",
	"paths./2012-09-25/pipelines/{Id}/notifications.post.responses.485.schema.$ref": "#/definitions/InternalServiceException",
	"paths./2012-09-25/pipelines/{Id}/status.parameters.length": 9,
	"paths./2012-09-25/pipelines/{Id}/status.parameters[0].$ref": "#/parameters/Action",
	"paths./2012-09-25/pipelines/{Id}/status.parameters[1].$ref": "#/parameters/Version",
	"paths./2012-09-25/pipelines/{Id}/status.parameters[2].$ref": "#/parameters/X-Amz-Content-Sha256",
	"paths./2012-09-25/pipelines/{Id}/status.parameters[3].$ref": "#/parameters/X-Amz-Date",
	"paths./2012-09-25/pipelines/{Id}/status.parameters[4].$ref": "#/parameters/X-Amz-Algorithm",
	"paths./2012-09-25/pipelines/{Id}/status.parameters[5].$ref": "#/parameters/X-Amz-Credential",
	"paths./2012-09-25/pipelines/{Id}/status.parameters[6].$ref": "#/parameters/X-Amz-Security-Token",
	"paths./2012-09-25/pipelines/{Id}/status.parameters[7].$ref": "#/parameters/X-Amz-Signature",
	"paths./2012-09-25/pipelines/{Id}/status.parameters[8].$ref": "#/parameters/X-Amz-SignedHeaders",
	"paths./2012-09-25/pipelines/{Id}/status.post.description": "\u003cp\u003eThe UpdatePipelineStatus operation pauses or reactivates a pipeline, so that the pipeline stops or restarts the processing of jobs.\u003c/p\u003e \u003cp\u003eChanging the pipeline status is useful if you want to cancel one or more jobs. You can't cancel jobs after Elastic Transcoder has started processing them; if you pause the pipeline to which you submitted the jobs, you have more time to get the job IDs for the jobs that you want to cancel, and to send a \u003ca\u003eCancelJob\u003c/a\u003e request. \u003c/p\u003e",
	"paths./2012-09-25/pipelines/{Id}/status.post.operationId": "UpdatePipelineStatus",
	"paths./2012-09-25/pipelines/{Id}/status.post.parameters.length": 2,
	"paths./2012-09-25/pipelines/{Id}/status.post.parameters[0].in": "body",
	"paths./2012-09-25/pipelines/{Id}/status.post.parameters[0].name": "body",
	"paths./2012-09-25/pipelines/{Id}/status.post.parameters[0].required": true,
	"paths./2012-09-25/pipelines/{Id}/status.post.parameters[0].schema.$ref": "#/definitions/UpdatePipelineStatusRequest",
	"paths./2012-09-25/pipelines/{Id}/status.post.parameters[1].in": "path",
	"paths./2012-09-25/pipelines/{Id}/status.post.parameters[1].name": "Id",
	"paths./2012-09-25/pipelines/{Id}/status.post.parameters[1].required": true,
	"paths./2012-09-25/pipelines/{Id}/status.post.parameters[1].type": "string",
	"paths./2012-09-25/pipelines/{Id}/status.post.responses.200.description": "Success",
	"paths./2012-09-25/pipelines/{Id}/status.post.responses.200.schema.$ref": "#/definitions/UpdatePipelineStatusResponse",
	"paths./2012-09-25/pipelines/{Id}/status.post.responses.480.description": "ValidationException",
	"paths./2012-09-25/pipelines/{Id}/status.post.responses.480.schema.$ref": "#/definitions/ValidationException",
	"paths./2012-09-25/pipelines/{Id}/status.post.responses.481.description": "IncompatibleVersionException",
	"paths./2012-09-25/pipelines/{Id}/status.post.responses.481.schema.$ref": "#/definitions/IncompatibleVersionException",
	"paths./2012-09-25/pipelines/{Id}/status.post.responses.482.description": "ResourceNotFoundException",
	"paths./2012-09-25/pipelines/{Id}/status.post.responses.482.schema.$ref": "#/definitions/ResourceNotFoundException",
	"paths./2012-09-25/pipelines/{Id}/status.post.responses.483.description": "ResourceInUseException",
	"paths./2012-09-25/pipelines/{Id}/status.post.responses.483.schema.$ref": "#/definitions/ResourceInUseException",
	"paths./2012-09-25/pipelines/{Id}/status.post.responses.484.description": "AccessDeniedException",
	"paths./2012-09-25/pipelines/{Id}/status.post.responses.484.schema.$ref": "#/definitions/AccessDeniedException",
	"paths./2012-09-25/pipelines/{Id}/status.post.responses.485.description": "InternalServiceException",
	"paths./2012-09-25/pipelines/{Id}/status.post.responses.485.schema.$ref": "#/definitions/InternalServiceException",
	"paths./2012-09-25/presets.get.description": "The ListPresets operation gets a list of the default presets included with Elastic Transcoder and the presets that you've added in an AWS region.",
	"paths./2012-09-25/presets.get.operationId": "ListPresets",
	"paths./2012-09-25/presets.get.parameters.length": 2,
	"paths./2012-09-25/presets.get.parameters[0].in": "body",
	"paths./2012-09-25/presets.get.parameters[0].name": "body",
	"paths./2012-09-25/presets.get.parameters[0].required": true,
	"paths./2012-09-25/presets.get.parameters[0].schema.$ref": "#/definitions/ListPresetsRequest",
	"paths./2012-09-25/presets.get.parameters[1].description": "Pagination token",
	"paths./2012-09-25/presets.get.parameters[1].in": "query",
	"paths./2012-09-25/presets.get.parameters[1].name": "PageToken",
	"paths./2012-09-25/presets.get.parameters[1].required": false,
	"paths./2012-09-25/presets.get.parameters[1].type": "string",
	"paths./2012-09-25/presets.get.responses.200.description": "Success",
	"paths./2012-09-25/presets.get.responses.200.schema.$ref": "#/definitions/ListPresetsResponse",
	"paths./2012-09-25/presets.get.responses.480.description": "ValidationException",
	"paths./2012-09-25/presets.get.responses.480.schema.$ref": "#/definitions/ValidationException",
	"paths./2012-09-25/presets.get.responses.481.description": "IncompatibleVersionException",
	"paths./2012-09-25/presets.get.responses.481.schema.$ref": "#/definitions/IncompatibleVersionException",
	"paths./2012-09-25/presets.get.responses.482.description": "AccessDeniedException",
	"paths./2012-09-25/presets.get.responses.482.schema.$ref": "#/definitions/AccessDeniedException",
	"paths./2012-09-25/presets.get.responses.483.description": "InternalServiceException",
	"paths./2012-09-25/presets.get.responses.483.schema.$ref": "#/definitions/InternalServiceException",
	"paths./2012-09-25/presets.parameters.length": 9,
	"paths./2012-09-25/presets.parameters[0].$ref": "#/parameters/Action",
	"paths./2012-09-25/presets.parameters[1].$ref": "#/parameters/Version",
	"paths./2012-09-25/presets.parameters[2].$ref": "#/parameters/X-Amz-Content-Sha256",
	"paths./2012-09-25/presets.parameters[3].$ref": "#/parameters/X-Amz-Date",
	"paths./2012-09-25/presets.parameters[4].$ref": "#/parameters/X-Amz-Algorithm",
	"paths./2012-09-25/presets.parameters[5].$ref": "#/parameters/X-Amz-Credential",
	"paths./2012-09-25/presets.parameters[6].$ref": "#/parameters/X-Amz-Security-Token",
	"paths./2012-09-25/presets.parameters[7].$ref": "#/parameters/X-Amz-Signature",
	"paths./2012-09-25/presets.parameters[8].$ref": "#/parameters/X-Amz-SignedHeaders",
	"paths./2012-09-25/presets/{Id}.get.description": "The ReadPreset operation gets detailed information about a preset.",
	"paths./2012-09-25/presets/{Id}.get.operationId": "ReadPreset",
	"paths./2012-09-25/presets/{Id}.get.parameters.length": 2,
	"paths./2012-09-25/presets/{Id}.get.parameters[0].in": "body",
	"paths./2012-09-25/presets/{Id}.get.parameters[0].name": "body",
	"paths./2012-09-25/presets/{Id}.get.parameters[0].required": true,
	"paths./2012-09-25/presets/{Id}.get.parameters[0].schema.$ref": "#/definitions/ReadPresetRequest",
	"paths./2012-09-25/presets/{Id}.get.parameters[1].in": "path",
	"paths./2012-09-25/presets/{Id}.get.parameters[1].name": "Id",
	"paths./2012-09-25/presets/{Id}.get.parameters[1].required": true,
	"paths./2012-09-25/presets/{Id}.get.parameters[1].type": "string",
	"paths./2012-09-25/presets/{Id}.get.responses.200.description": "Success",
	"paths./2012-09-25/presets/{Id}.get.responses.200.schema.$ref": "#/definitions/ReadPresetResponse",
	"paths./2012-09-25/presets/{Id}.get.responses.480.description": "ValidationException",
	"paths./2012-09-25/presets/{Id}.get.responses.480.schema.$ref": "#/definitions/ValidationException",
	"paths./2012-09-25/presets/{Id}.get.responses.481.description": "IncompatibleVersionException",
	"paths./2012-09-25/presets/{Id}.get.responses.481.schema.$ref": "#/definitions/IncompatibleVersionException",
	"paths./2012-09-25/presets/{Id}.get.responses.482.description": "ResourceNotFoundException",
	"paths./2012-09-25/presets/{Id}.get.responses.482.schema.$ref": "#/definitions/ResourceNotFoundException",
	"paths./2012-09-25/presets/{Id}.get.responses.483.description": "AccessDeniedException",
	"paths./2012-09-25/presets/{Id}.get.responses.483.schema.$ref": "#/definitions/AccessDeniedException",
	"paths./2012-09-25/presets/{Id}.get.responses.484.description": "InternalServiceException",
	"paths./2012-09-25/presets/{Id}.get.responses.484.schema.$ref": "#/definitions/InternalServiceException",
	"paths./2012-09-25/presets/{Id}.parameters.length": 9,
	"paths./2012-09-25/presets/{Id}.parameters[0].$ref": "#/parameters/Action",
	"paths./2012-09-25/presets/{Id}.parameters[1].$ref": "#/parameters/Version",
	"paths./2012-09-25/presets/{Id}.parameters[2].$ref": "#/parameters/X-Amz-Content-Sha256",
	"paths./2012-09-25/presets/{Id}.parameters[3].$ref": "#/parameters/X-Amz-Date",
	"paths./2012-09-25/presets/{Id}.parameters[4].$ref": "#/parameters/X-Amz-Algorithm",
	"paths./2012-09-25/presets/{Id}.parameters[5].$ref": "#/parameters/X-Amz-Credential",
	"paths./2012-09-25/presets/{Id}.parameters[6].$ref": "#/parameters/X-Amz-Security-Token",
	"paths./2012-09-25/presets/{Id}.parameters[7].$ref": "#/parameters/X-Amz-Signature",
	"paths./2012-09-25/presets/{Id}.parameters[8].$ref": "#/parameters/X-Amz-SignedHeaders",
	"paths./2012-09-25/roleTests.parameters.length": 9,
	"paths./2012-09-25/roleTests.parameters[0].$ref": "#/parameters/Action",
	"paths./2012-09-25/roleTests.parameters[1].$ref": "#/parameters/Version",
	"paths./2012-09-25/roleTests.parameters[2].$ref": "#/parameters/X-Amz-Content-Sha256",
	"paths./2012-09-25/roleTests.parameters[3].$ref": "#/parameters/X-Amz-Date",
	"paths./2012-09-25/roleTests.parameters[4].$ref": "#/parameters/X-Amz-Algorithm",
	"paths./2012-09-25/roleTests.parameters[5].$ref": "#/parameters/X-Amz-Credential",
	"paths./2012-09-25/roleTests.parameters[6].$ref": "#/parameters/X-Amz-Security-Token",
	"paths./2012-09-25/roleTests.parameters[7].$ref": "#/parameters/X-Amz-Signature",
	"paths./2012-09-25/roleTests.parameters[8].$ref": "#/parameters/X-Amz-SignedHeaders",
	"paths./2012-09-25/roleTests.post.description": "\u003cp\u003eThe TestRole operation tests the IAM role used to create the pipeline.\u003c/p\u003e \u003cp\u003eThe \u003ccode\u003eTestRole\u003c/code\u003e action lets you determine whether the IAM role you are using has sufficient permissions to let Elastic Transcoder perform tasks associated with the transcoding process. The action attempts to assume the specified IAM role, checks read access to the input and output buckets, and tries to send a test notification to Amazon SNS topics that you specify.\u003c/p\u003e",
	"paths./2012-09-25/roleTests.post.operationId": "TestRole",
	"paths./2012-09-25/roleTests.post.parameters.length": 1,
	"paths./2012-09-25/roleTests.post.parameters[0].in": "body",
	"paths./2012-09-25/roleTests.post.parameters[0].name": "body",
	"paths./2012-09-25/roleTests.post.parameters[0].required": true,
	"paths./2012-09-25/roleTests.post.parameters[0].schema.$ref": "#/definitions/TestRoleRequest",
	"paths./2012-09-25/roleTests.post.responses.200.description": "Success",
	"paths./2012-09-25/roleTests.post.responses.200.schema.$ref": "#/definitions/TestRoleResponse",
	"paths./2012-09-25/roleTests.post.responses.480.description": "ValidationException",
	"paths./2012-09-25/roleTests.post.responses.480.schema.$ref": "#/definitions/ValidationException",
	"paths./2012-09-25/roleTests.post.responses.481.description": "IncompatibleVersionException",
	"paths./2012-09-25/roleTests.post.responses.481.schema.$ref": "#/definitions/IncompatibleVersionException",
	"paths./2012-09-25/roleTests.post.responses.482.description": "ResourceNotFoundException",
	"paths./2012-09-25/roleTests.post.responses.482.schema.$ref": "#/definitions/ResourceNotFoundException",
	"paths./2012-09-25/roleTests.post.responses.483.description": "AccessDeniedException",
	"paths./2012-09-25/roleTests.post.responses.483.schema.$ref": "#/definitions/AccessDeniedException",
	"paths./2012-09-25/roleTests.post.responses.484.description": "InternalServiceException",
	"paths./2012-09-25/roleTests.post.responses.484.schema.$ref": "#/definitions/InternalServiceException",
	"produces.length": 1,
	"produces[0]": "application/json",
	"schemes.length": 1,
	"schemes[0]": "http",
	"security.length": 1,
	"securityDefinitions.hmac.description": "Amazon Signature authorization v4",
	"securityDefinitions.hmac.in": "header",
	"securityDefinitions.hmac.name": "Authorization",
	"securityDefinitions.hmac.type": "apiKey",
	"securityDefinitions.hmac.x-amazon-apigateway-authtype": "awsSigv4",
	"security[0].hmac.length": 0,
	"swagger": "2.0",
	"x-hasEquivalentPaths": true
}